["The U.S. Supreme Court has struck down a backward, gender discriminating federal law based on shocking stereotypes   one being that most men hardly care about their children born out of wedlock.Under this law, a child born abroad to an unwed American mother automatically becomes a U.S. citizen if the mother previously lived in the U.S. for a minimum of one year.Under the very same law, a child of an unwed father can t become a U.S. citizen unless the father has lived in the U.S. for a continuous period of five years, two of them when he was over the age of 14.How could this law have such requirements? Who would think this?", "THE USDA, EPA AND NOW THE DOJ Obama is using billions of taxpayer dollars to redistribute to his cronies and liberal agitators. Just Tuesday, the DOJ s Loretta Lynch unleashed millions to be given to  community organizers  to do who knows what with The Justice Department announced $163 million in grants to be distributed for the purpose of  building trust with the community.", "An analysis by the Washington Post has discovered that in the first four months of 2016, there have been 23 people in America that have been shot by toddlers. Our gun obsessed nation has gotten to the point where deadly weapons in the hands of children too young for kindergarten actually has a body count.Last year, a Washington Post analysis found that toddlers were finding guns and shooting people at a rate of about one a week.", "We ve all heard the stories of Donald Trump preferring a well-done steak with ketchup and shunning any new delicacies, despite living a lifestyle that offers him all the luxuries one could ever desire, however, it s not just that the President has terrible gastronomical taste, a new memoir suggests that his diet is one of several poor lifestyle choices that could very well shorten his life.According to an excerpt from Let Trump be Trump, an upcoming book by Trump s former campaign manager Corey Lewandowski and aide David Bossie, we get to enter the inner circle where the President of the United States having a 2,400-calorie McDonald s dinner is par for the course. Trump s appetite seems to know no bounds when it comes to McDonald s, with a dinner order consisting of two Big Macs, two Filet-O-Fish, and a chocolate malted,  is just one of the claims made in the book.", "Trump has been very clear for the last week or so   he will not accept the results of Election Night if he s not the winner. He even said at a rally in Ohio: I would like to promise and pledge, to all of my voters and supporters and to all of the people of the United States, that I will totally accept the results of this great and historic presidential election   if I win.", "In June of 2016, the disgraced sexual predator, and Hollywood producer, Harvey Weinstein, hosted a fundraiser for Hillary s presidential campaign in Manhattan. Some of the top celebrities in the business accepted Harvey s invitation to the event.", "When Khizr Khan took the stage at the DNC to give a heartfelt speech about the very real sacrifice his Muslim son made in Iraq, and to call out Trump on his anti-Muslim hatred as the height of insult against people like Capt. Khan, many probably expected the GOP to hop on board and repudiate Trump.", "Trump supporters have been losing their minds over Trump s assault on the NFL, with many abandoning their teams and publicly destroying merchandise they ll have to re-buy in three weeks when their  boycott  fails like so many others. Claiming to be outraged at nonexistent  disrespect to the flag  while crapping all over the freedoms it represents, conservatives are clearly mad at something.One such Trump supporter is in the video below.", "As the Democratic Primary wraps up   with Hillary Clinton slated to clinch the majority of pledged delegates and thus reach the total amount of delegates needed for victory   sources with CNN and the New York Times confirmed that President Obama is ready to make an official endorsement this week.And that candidate is Hillary Clinton. According to the New York Times, the White House has been holding conversations with the Clinton campaign  as to where and when to formally endorse.", "We wholeheartedly approve Former House Speaker Newt Gingrich is now the leading candidate to be tapped by Donald Trump as his running mate, a close confidante of Trump tells Newsmax.On Tuesday, Trump told the AP that he has whittled down his choices to 5 or 6 names. I have a list of people that I would like,  Trump revealed in his interview Tuesday.But the name that keeps cropping up as his favorite is Gingrich, a Trump confidante tells Newsmax.Trump has tapped former presidential contender Ben Carson to help pick his running mate.", "email \nits no secret that workplaces in our country are still deeply misogynistic environments but with her  bid for the president of the united states hillary clinton worked tirelessly to not just be elected but to also break down barriers for women everywhere today marks a big win for gender equality because the glass ceiling has been shattered and it is finally acceptable for women to cry at work \nthats right ladies its time to iron those pantsuits and put on those heels because the day has finally come when its totally fine to sob openly in your office and theres nothing men can do to stop you \nfor far too long women have been marginalized written off and told that there are certain things they can never achieve but today that all ends because women are coming into work and crying at several unpredictable intervals throughout the entire day with absolutely zero negative consequences as of now it seems like anything is possible because from the boardroom to the lab women across the country are stepping up and owning their shit skulking around their offices with puffy eyes and tears streaming down their faces no ducking into the stairwell necessary \nits  baby so if you have two x chromosomes you better lean the hell in this news has got us like \nconsidering that just a short while ago most women were expected to be homemakers its incredible to think that our nation has gotten to the point where not one but all women can come to work and cry loudly in and around their workplaces no questions asked just  years ago women couldnt even attend college but now it is not only acceptable but even expected that this morning women went straight to the bathroom and cried uncontrollably out of anger or fear or downright despair \ny s queen \nthankfully today will go down as a huge victory for women because we can show our daughters and our granddaughters that right now its fine for their mothers to break down and spray a pool of mascarasoaked tears all over their desks at this historic moment the glass ceiling is totally shattered and theres absolutely no way its going back up", "Yes, he did say that bad grammar and all! Can you believe a man running for VP said something like that?", "Did Target really believe that 99.8% of Americans were going to be silent in the face of a decision that puts the safety of our women and children in jeopardy in order to satisfy the desire of a percentage of the .2% of Americans who consider themselves to be transgender? I cancelled my debit card with Target and lodged a complaint with their headquarters in Minneapolis.", "Why stop there? Using liberal logic, shouldn t the 3 year old girl who was raped at a refugee center apologize as well?", "Only one journalist has made it his mission to set the record straight about what really happened in Ferguson, MO on the day that Michael Brown was shot by Officer Darren Wilson. Every American needs to know about this man who faux  journalists  fear.", "As Hillary does her best to deflect and stonewall the release of her e-mails, we find out that even an employee of Clinton s server company knew something  shady  was going on. Hillary wants all of this to just go away and is spinning the e-mail scandal like it s just another  right wing conspiracy .", "Chuck Todd exposed his nasty side when he totally abused the Secretary of State Rex Tillerson on his show Meet the Press: Of course, Tillerson held his own and gave replies that we full of credibility and support for President Trump: I have a great relationship with the president. I understand what his objectives are.", "The bitter battle for the presidency is over. Democratic candidate Hillary Clinton lost.", "If there is one political ideology that every American should despise, it s Nazism. But conservatives don t seem to mind it one bit.On inauguration day last month, Nazi Richard Spencer got punched in the face by a protester during an interview.Spencer, along with others of his ilk, support Donald Trump and hail his presidency as a new era of white nationalism where fascism and racism flourish.It s no secret, of course.", "Joyce Curnell s family has been destroyed by South Carolina law enforcement after she was forced to spend 27 hours of pure torture in a jail before being murdered by the state. I say murdered because what she was subjected to is nothing short of an execution.Curnell had gone to the hospital for stomach pain that was diagnosed as gastroenteritis.", "Global warming has been shoved down the throats of every American since the day Obama took office. The only problem is that it s a massive hoax that is being used to transfer money from taxpayers to be redistributed amongst the liberal elite and those who the elites deem worthy.", "Donald Trump has made many promises to the working class citizen. He promised he d side with them through it all and the he would make the working class thrive.", "wed oct th  at  pm the comment came hours after trump promised a new deal for black america share on twitter print this post \nafter pretending he cared about earning the votes of african americans donald trump kicked a black man out of a rally in north carolina on wednesday calling him a thug while doing so protester escorted out of rally trump to protester were you paid  to be a thug were you paid you can get him out pictwittercomjukujyubh \n bryan anderson bryanranderson october   \ntrumps insulting and racially tinged rhetoric came hours after he was in charlotte reaching out to the africanamerican community and promising a new deal for black america if elected president \nthe republican nominee has insulted africanamerican voters throughout much of the campaign often calling their communities hell and claiming they only live in areas riddled with crime and crumbling schools \nof course in true trump form he didnt just use tasteless rhetoric insulting to the africanamerican community at his rally he also took a shot at syrian refugees trump in kinston nc the refugee program would leave us with generations of terrorism radicalism and extremism inside our shores \n ashley killough killoughcnn october   \nif youre keeping score at home african americans who stand up to trumps offensive campaign message are thugs and syrian refugees who come to the united states  in most cases women and children simply seeking a better life  are terrorists who will do damage to our country for generations \na man who has such disdain for so many americans has no business being president of the united states", "With this presidential election being as absolutely bizarre as it is, sometimes it s incredibly important to keep our sense of humor about us. One person who seems to being doing this very well is none other than Dixie Chicks  Natalie Maines.As a woman who s never shied away from letting her opinion be known about politicians, Maines began by taking to Twitter to make a joke about her apparent issues with airline travel saying that she ll vote for whoever makes the airline industry decent again.", "Well, this came back to bite Allen West on the ass.The former Republican congressman from Florida apparently wants to be part of Donald Trump s cabinet. So he had to scrub and make up a pathetic excuse to explain a very racist post on his Facebook page.In celebration of Trump s choice of former General James Mattis to be Secretary of Defense, West posted a meme of Mattis with the caption,  Fired by Obama to please the Muslims.", "People believe what they want to believe. When someone tells you they can solve your financial woes with a simple plan, you want to believe them.", "Donald Trump has been very busy trying to defend his anti-Semitic Star of David tweet, which came from an obviously bigoted white supremacist website, but this latest attempt to defend the indefensible really takes the cake. Trump actually tried to use Disney s popular Frozen movie   which in some sort of advertising campaign for goods relating to the movie used a 6-pointed star   to defend his own bigoted Twitter imagery.", "The Clintons always blame somebody else. Now it s FBI Director James Comey s turn to embody their all-purpose bogeyman, the vast right-wing conspiracy.", "Donald Trump decided he was anti-capitalism on Friday when he called for his supporters to boycott Apple products. Would he be joining in the boycott he called for?", "From the Civil War to Jim Crow to George Wallace, to the Confederate Flag that hung over the Statehouse until just last year, the state of Alabama has always been synonymous with racial struggle and with just plain ole racism.Things might be changing from an official level, but to many Alabamans, African-Americans are still second class citizens, and to some, just criminals. That seemed to be the idea behind an 8th grade test called the  LA Math Proficiency Test,  that portrayed black people and Latinos as prostitutes, drug dealers and drive-by shooters.", "ever wonder whats on the mind of todays most notable people well dont miss our unbelievable roundup of the best and most talked about quotes of the day  toads are dry and frogs are wet what more do i have to say  bindi irwin on telling frogs and toads apart  when i was in college i would sometimes run around campus and frantically shout for everyone to go to the river because someone was drowning it would really get peoples attention and wed all run to the river then in the middle of the river would be a big box with the word society written on the side of it that i had planted there id then look at everyone and go what are you going to do  moby on why he was kicked out of school  when i was a kid my father would point to our television and say son one day you are going to be inside of that thing telling everyone about the latest bruno mars dance  willie geist", "Hillary Clinton continued her overseas trashing of our president with her latest claim that former President Bush said some rude things about the ceremony. She s so bitter that it s embarrassing.", "When it comes to the Trump family, one thing is for certain, they love photo opportunities, especially with those who they think may boost the image of the campaign.The Trump campaign knows they re losing, by a lot, with minorities, so any chance they can get to make it look like they re not, they seem to hop on board.Seemingly knowing this, a pair of Latina sisters, Annie and Ceci Cardelle from Salisbury, North Carolina, went to go see Eric Trump as he was out campaigning for his dad in their state.The sisters, ages 23 and 17, are Hillary Clinton supporters, and Annie wore a shirt that read  Latina Contra Trump,  which of course means Latina Against Trump. However, knowing neither Trump nor his supporters would likely notice this, and maybe thought it read  Latina Con Trump  which means  with  the sisters took a chance to take advantage of the moment.Ceci tweeted out: When you protest a Trump rally but no one realizes your shirt says  Latinas AGAINST trump  so they take pics w/ you like you re supporters.", "The LA Times is reporting that moviegoing is at the lowest level since 1995. The article blames Americans who are going to see fewer movies, on streaming services, which, to some extent, could be true, but from the majority of the comments we ve seen on our Facebook page, which reaches almost 1.7 million followers, Americans are no longer interested in paying their hard-earned money to support the anti-American and anti-Trump hate machine that is Hollywood.", "If this had been a Tea Party group attacking Nancy Pelosi s home, it would have been international news Angry leftists with rocks, wood chunks and torches attacked a Chicago alderman s home this weekend. Once you start throwing objects, that crosses the line,  he said.", "There are many  C  words for Hillary but  competent  is not one of them .OUCH!", "House Speaker Paul Ryan was put on the spot last night during CNN s town hall, when a Republican attendee asked him a question that most of us would love to know   how can anyone, Republican or not, justify standing by Donald Trump after all the horrible things he s said and done?Student Zachary Marcone, who stressed that he himself was a Republican but would NOT be voting for Trump, confronted Ryan by pointing out Trump s bigotry. Marcone said: It concerns me when the Republican leadership is supporting somebody who s blatantly racist and has said Islamophobic statements, wants to shut down our borders.", "The San Jose Police Department has been plagued with accusations of racism and racial profiling, and now they re getting sued for it. A black family alleges that an officer followed them home from picking up their seven-year old daughter, and held them at gunpoint for absolutely no reason other than they were black, and the father, Emmanuel Stephens, might have matched the description of a  suspicious black man  in the area.", "US Congressman Joe Wilson was right! Obama is a liar His reckless and amateur decisions have made America more unsafe than we have ever been.", "Prosecutors allege that bone cement manufactured by Norian and its parent company, Synthes, was used to conduct  human experimentation,  resulting in a string of deaths over the past several years.As Fortune reports here, the deaths were the result of spinal injections of a product called Norian XR, described as  a cement that has the unique capacity to turn into bone when injected into the human skeleton. Norian XR was never approved by the FDA for use in the human spine.", "Tune in to the Alternate Current Radio Network (ACR) for another LIVE broadcast of  The Boiler Room  starting at 6 PM PST | 9 PM EST for this special broadcast. Join us for uncensored, uninterruptible talk radio, custom-made for barfly philosophers, misguided moralists, masochists, street corner evangelists, media-maniacs, savants, political animals and otherwise lovable rascals.Join ACR hosts Hesher, & Spore along with Andy Nowicki of Alt Right Blogspot, Jay Dyer from jaysanalysis.com, Jamie Hanshaw author of Weird Stuff, Branko Mali  of Kali Tribune, Randy J of 21Wire and Daniel Spaulding of Soul of the East for the 70th episode of BOILER ROOM.", "Pope Francis is once again speaking the truth, and  Christian  conservatives are going to hate him even more for it.This time it concerns the right s newest endeavor   spreading fake news. With reports of Pizzagate and now Newtown threats causing a rise in violence by right-wing ideologues (and Trump supporters), his holiness is taking on the epidemic of fake news, calling it  sin  and equating it to eating feces.Speaking to to Tertio, a Belgian Catholic weekly, the Pope said in rather strong terms:I think the media have to be very clear, very transparent, and not fall into no offense intended the sickness of coprophagia, that is, always wanting to cover scandals, covering nasty things, even if they are true.", "london telegraph october   \nb ritains economy expanded by pc in the three months following the eu referendum slowing down a touch from the pc growth recorded in the previous quarter but defying the most pessimistic predictions made by the remain campaign \nthe countrys economic performance was stronger than the pc predicted by economists and in line with the official forecasts made before the referendum took place  in march the office for budget responsibility predicted third quarter growth of pc it also disproves the treasurys referendum campaign claim that a vote to leave the eu would r esult in pc fall in gdp in the third quarter that would herald the start of a recession the treasurys worstcase severe shock scenario was even more pessimistic predicting a pc fall in the threemonth period \ns terling rallied on the initial estimates from the office for national statistics and economists said the unexpectedly strong numbers made it less likely that the bank of englands monetary policy committee mpc would cut interest rates at next months monetary policy committee meeting this article was posted thursday october   at  am share this article", "The CIA, the FBI, the Department of Homeland Security and the Office of the Director of National Intelligence are being sued for records containing information regarding Russia s tampering with the U.S. presidential election.On Monday, Journalist Jason Leopold and Ryan Shapiro, a Ph.D. candidate at the Massachusetts Institute of Technology (MIT), filed a lawsuit in the U.S. District Court for the District of Columbia. The suit alleges that the intelligence agencies failed to comply with the Freedom of Information Act (FOIA) by refusing to turn over requested documents.According to The Hill:On Dec. 14, Leopold and Shapiro asked the intelligence agencies for copies of communications to or from the Electoral College and any records that mention or refer to a requests Electoral College members made for information and briefings on the investigations into ties between Trump, his campaign or his associates.", "This isn t just any church organization, this is a  church organization  that takes in $45 MILLION in taxpayer funds every year! Why do we give them so much money?", "Republican front runner Donald Trump loves to tell Americans how great he is at just about anything   but one thing he ll never brag about is how good he is at making himself look like a complete idiot.Trump displayed this not-so-hidden talent perfectly on Monday, when he likely misinterpreted a reporter s question about children born of immigrants  that or the candidate has flip-flopped on one of his policies again. The question was asked during a South Carolina press conference, and the reporter opened by mentioning one of Trump s GOP rivals, fellow candidate Jeb Bush.", "Donald Trump doesn t exactly hide the fact that he s a sociopath. Just looking at the most recent events this country has faced, we ve witnessed the President of the United States turn his back on human suffering and be completely indifferent to those in need.", "Obama s minions in the Democrat party never disappoint in their efforts to support this president on just about anything. Mikulski is retiring so what does she care?", "Very outspoken Bernie Sanders supporter Seth MacFarlane recently told the Jason Rantz Show a few things he d like to see out of he fellow Bernie supporters. The Family Guy creator knows that you can be fervent in your support for a candidate without losing sight of the bigger picture.He said: I actually am one of the people who has been a little disappointed at the way that, not necessarily the campaign, the supporters of the campaign have treated Hillary.", "dml provides stunning analysis predicts trump will win presidential election k shares by a griffee  november    dml report  with only  days left before election day dennis michael lynch takes an electoral college map and shows how additional states will turn red and get trump over  electoral college votes to win the presidency \ntaking states that the media has tried to downplay as if trump has no chance to win them dml shows how trump not only has a chance but predicts he will win these states and he backs up his prediction with solid data and facts \ndml also clarified that the polls are extremely misleading he said trump has lit a spark in people who have not voted in decades  some who have never voted  but now they are embracing trump these people are not being included in the polls \nearly voting is also not a true representation of whats about to happen because more democrats tend to show up for early voting while the majority of republicans wait until election day \nwatch this eyeopening video for a critical statebystate analysis that proves trump can easily win the election  then share it everywhere \nnote in the video when dml talks about pa voting for trump he forgot to mention k democrats in pa switched parties over the past year in addition pa saw an eyepopping number of new voters register as republicans combined pa in this election has  more republicans than it did in  \nsign up to get alerts about dennis michael lynchs upcoming donald trump film and breaking news subscribe", "Another Gitmo detainee returns to terror Is anyone else starting to see a pattern here? Former Guantanamo detainee, Ibrahim Qosi, who is also known as Sheikh Khubayb al Sudani, is now an al-Qaeda leader in Yemen.April , 2012  For al-Qosi, his release will allow him to be reunited with his family.", "Donald Trump is terrified of Special Counsel Robert Mueller. This is especially true since it has been revealed that Mueller has now impaneled a grand jury in Washington D.C. in the Russian probe.", "podcast play in new window  download  embed \nyour vote is statistically meaningless and will not sway the selection your vote is strategically meaningless and decides nothing about the future of the country your vote is useless as the selection is rigged anyway but as larken rose of larkenrosecom reminds us what really matters is that voting is immoral legitimizing a system of authoritarian control and empowering the oligarchs who created the system and control its results \nclick here for show notes and mp audio for this conversation", "The  salt police  are coming to NYC! Thanks to the nutty liberal mayor of New York City, we have a new regulation on salt.", "Ironically, the two issues that catapulted Trump past all of his competitors in the GOP Presidential race were building the wall on our southern border and not allowing unveiled refugees to enter our country. We re gonna go out on a limb and guess that based on Trump s popularity with a wide variety of Americans, both issues are pretty important when it comes to our national security.Hillary Clinton will launch an attack on Donald Trump s national security policy Thursday, focusing on an issue the likely Democratic presidential nominee could use to her advantage over the billionaire New Yorker.The address in San Diego will  make clear the threat that Donald Trump would pose to our national security and to put forth her own vision for keeping America safe at home and leading in the world,  Clinton s campaign said in a statement Wednesday afternoon.For Clinton, the move is part of an effort to paint Trump as fundamentally unsuited to lead the world s most powerful military as she hopes to pivot away from the extended Democratic primary and toward a general election match-up with the presumptive GOP nominee.The attacks on Trump s lack of national security bona fides have increased speculation that he might pick a running mate with more experience in the defense or foreign policy, such as Senate Foreign Relations Committee Chairman Bob Corker (R-Tenn.).", "It s hard to imagine that Donald Trump could give America any more reasons why he shouldn t be the country s next president, but Trump just can t help it. When he s not offending minorities or destroying our relations with our countries, Trump is coming up with more shady excuses about why he can t release his tax returns, even after his own vice president, Mike Pence, said that they would both be releasing their tax documents.However, in a joint interview yesterday, Trump and his running mate seemed to be changing their story once again.", "If you want to watch a conservative throw a temper tantrum just mention slavery and grab your popcorn.Because when First Lady Michelle Obama talked about slavery and the great progress our country has made since the Civil War during an interview at the new Smithsonian Institution s National Museum of African American History and Culture, conservatives took to Twitter to whine.Mrs. Obama told Good Morning America host Robin Roberts about how she feels about visiting the museum, which opens this weekend.", "It appears that a hacker had a bit of fun with McDonald s corporate Twitter account Thursday morning. You are actually a disgusting excuse of a President and we would love to have Barack Obama back, also you have tiny hands,  the account tweeted to Donald Trump   and whichever nameless hero did it even pinned the tweet.Apparently, the hacker wanted to take the opportunity to make a completely accurate statement about Trump  but The Donald s fans will surely be  boycotting  the fast food giant by buying cheeseburgers and writing TRUMP on the wrapper or something stupid like when they tried to  boycott  Starbucks by buying coffee.Naturally, the internet is  lovin  it :Can't wait for @realDonaldTrump to tell us McDonald's is overrated and that he doesn't even eat mcdonalds.", "While Ted Cruz would say that he is possessed by the spirit of his Lord and Savior Jesus Christ, some would argue that he is instead possessed by a more insidious force. According to two men who attended one of the Texas Senator s rallies, he s plagued by demons  likely the sort that cause a person to say and do things so stupid that they have a chance of becoming the GOP nominee for President.The Dallas Morning News reports that Cruz had just begun a speech when two men wielding mirrors and crosses appeared, one of the men shouting: Ted Cruz look in the mirror and let the evil spirit depart!", "THE TRUMP BASHING CONTINUES A Washington Post columnist reviewed a fashion layout/interview Ivanka Trump did with Harper s Bazaar and totally bashed the lovely Ivanka. You d think it would be somewhat middle-of-road since it s in the arts and entertainment section of the Washington Post.", "Show of force The Russian long-range TU-95 Bear bombers breached airspace around the U.S and Canada known as the Alaskan Air Defense Identification Zone in which aircraft must be readily identified and report details of their course and destination. The Russian bombers stayed in international airspace.The bombers flew near the Aleutian Islands.", "Leaked emails from Hillary Clinton campaign manager John Podesta s personal email account published by WikiLeaks reveal the Clinton campaign s coordination with George Soros s Open Society Foundations on the subject of police reform.Soros, who has given almost $10 million to Clinton super PAC Priorities USA, is a major funder of Black Lives Matter. The Washington Times reported in August that Soros has given at least $33 million to the group through the Open Society Foundations (OSF), which he funds and controls.Both OSF and Clinton have called to crack down on police officers   implicit bias.", "After evidence has been uncovered that could point to Donald Trump and/or the Russians rigging the presidential election, a group of activists is encouraging Hillary Clinton to demand an audit of three states.Voter rights attorney John Bonifaz and director of the University of Michigan Center for Computer Security and Society, J. Alex Halderman, says they ve found persuasive evidence that the election results in Wisconsin, Michigan and Pennsylvania have been hacked or otherwise manipulated. They are privately lobbying the Clinton campaign to do something about it.Last Thursday, the activists held a conference call with Clinton campaign chairman John Podesta and campaign general counsel Marc Elias to make their case, according to a source briefed on the call.", "I think we can all agree that America believes Ann Romney would have made a great First Lady. She s respectable, thoughtful and kind hearted.Ann s remarks about a particular contender in the current crop of GOP Presidential hopefuls may surprise Hannity s viewers during this interview:https://youtu.be/Ezu5JHCsves", "The White House has warned Donald Trump not to turn his attacks to Michelle Obama, or things could get quite rough for him. I can t think of a bolder way for Donald Trump to lose even more standing than he already has than by engaging the First Lady of the United States,  principal deputy White House press secretary Eric Schultz told reporters aboard Air Force One.", "REMEMBER THIS? If they bring a knife to the fight, we bring a gun.", "Hillary Clinton s State Department was one of those agencies which signed off on the deal.Nine shareholders connected to Uranium One contributed a combined $145 million to the Clinton Foundation before or during the time the review took place. Some of those donations were not publicly disclosed at the time, as the Clintons promised they would.The transfer of 20 percent of America s uranium to a Russian-controlled company, first exposed in Clinton Cash and confirmed by the New York Times, has become a central subject of the presidential campaign.", "Donald Trump wanted the press to tour his brand new hotel in Washington D.C., so they did and discovered that he is truly a giant hypocrite.The Republican nominee was hoping to use the press corps as his own personal team of promoters but photographers were the only ones allowed to follow Trump inside the building. And that many cameras came in mighty handy as they captured how big of a liar Trump is when he claims he will  make America great again.", "Two Muslim men were shot to death in broad daylight while walking in the New York City borough of Queens on Saturday. Both men were dressed in traditional Muslim clothing.", "Episode #162 of SUNDAY WIRE SHOW resumes this November 28, 2016 as host Patrick Henningsen brings a 3 HOURS special broadcast of LIVE power-packed talk radio on ACR LISTEN LIVE ON THIS PAGE AT THE FOLLOWING SCHEDULED SHOW TIMES:SUNDAYS   5pm-8pm UK Time | 12pm-3pm ET (US) | 9am-12pm PT (US)This week s edition of THE SUNDAY WIRE is on the road broadcasting LIVE from the Valley of the Sun. This week host Patrick Henningsen covers this week s top stories in the US and internationally.", "One of the most beloved public figures in the entire world is Pope Francis. He has seemingly restored grace and dignity back to the Vatican, where most people were losing hope and feared that corruption and deceit had taken too much of a stronghold.", "Russia interfered in the 2016 U.S. presidential election in order to help Donald Trump become president of the United States, according to a CIA report the Washington Post has obtained.The CIA has concluded in a secret assessment that Russia intervened in the 2016 election to help Donald Trump win the presidency, rather than just to undermine confidence in the U.S. electoral system, according to officials briefed on the matter.Intelligence agencies have identified individuals with connections to the Russian government who provided WikiLeaks with thousands of hacked emails from the Democratic National Committee and others, including Hillary Clinton s campaign chairman, according to U.S. officials. Those officials described the individuals as actors known to the intelligence community and part of a wider Russian operation to boost Trump and hurt Clinton s chances.A senior official told the Post,  It is the assessment of the intelligence community that Russia s goal here was to favor one candidate over the other, to help Trump get elected.", "Macomb County, MI Executive Mark Hackel released audio recordings to local Detroit TV stations in which he claims the voice of Warren, MI Mayor Jim Fouts can be heard saying mentally disabled people are  retards  and  not even human beings. Hackel claimed the tapes were given to him by someone who is or was a member of Fouts  staff.Channel 4 WDIV-TV reports that reporter Mara McDonald spoke with the person who made the tape, an employee who recorded Fouts in his office.", "As the #NeverTrump movement has become officially irrelevant, our hilarious friend Joe Dan Gorman of Intellectual Froglegs puts the state of Trump s winning campaign into perspective for Americans #NeverTrump is fading into the sunset  now relegated to a few tassel loafered pockets of resistance .and social media trollers. The Anger babies, if you will (a phrase coined by my friend Anthony Adams, I liked it so I stole it).", "When Donald Trump first announced that he was running for the White House, no one took him seriously. We all laughed and joked about it, thinking it might be entertaining to watch his train wreck of a campaign for a few months before the other candidates left him in the dust.", "The newly elected US Senator Doug Jones (D-AL) just won the election by a small margin in a state where a Republican hasn t won for 25 years. Jones was pegged as a  liberal  and a  pro-abortion  by his opponents in the highly contentious race against the accused sexual predator, and ultra-conservative candidate, Roy Moore.", "After Sarah Huckabee Sanders read a letter from a little boy to the press (see below), liberal media like the Washington Post tried to prove that it was fake by using a handwriting analyst!THE LIBERALS TRY THEIR BEST TO PROVE THE LETTER IS FAKE:The Washington Post reported: Handwriting and children s cognitive experts were called and asked whether the letter appeared to be written by a child. We called one ourselves.", "Ammon Bundy and his armed ganged of militants have upset an entire nation over the last couple of weeks for their supposed special treatment by the police. While that did appear to be the case for the longest time, the raid was partially broken up by authorities after a shootout with one of Bundy s pals, LaVoy Finicum.", "Half of the eight mayoral hopefuls on Detroit s primary ballot next week have been convicted of felony crimes involving drugs, assault or weapons, a Detroit News analysis shows.Three were charged with gun crimes and two for assault with intent to commit murder. Some of the offenses date back decades, the earliest to 1977.", "This is pure gold that perfectly demonstrates that Republicans don t give a damn about a problem until they experience it personally.On Thursday, Arizona Republican Senator Jeff Flake joined his conservative colleagues in voting down an amendment that would have put an end to the airline industry practice of reducing the size of seats in order to cram as many passengers as possible into planes in a clear move that puts profit over the comfort of customers.According to the Washington Post, the amendment would have  empowered the FAA to set new standards, in consultation with experts, for seat dimensions that maintain  the safety, health and comfort of passengers. And as usual, Republicans sided with the lobbying arm of the airlines and killed the amendment.", "Donald Trump was once a Democrat, but that s no more. Donald Trump was once pro-choice, but not now.", "And the left says Trump hasn t given details about what he ll do when president? Hillary couldn t be more clueless and vague in her Twitter statement.", "It was just announced that there will be no autopsy of Justice Scalia after he was found dead in his room of  natural causes . Does anyone else out there think it should be mandatory for an autopsy to be performed?", "Former White House Press Secretary Josh Earnest said Monday that there were some  clear red lines  that would cause former President Obama to speak out publicly against federal action.In an interview, MSNBC s Chris Jansing asked Earnest about the former president s promise to weigh in publicly if he senses a threat to America s  core values. Obama spoke out in support of protests of President Trump s controversial temporary immigration ban proposal at the end of January.", "When comedian Alison Leiby tweeted a pretty cute, common sense joke in December, she had no idea how violent the repercussions would be. Conservative extremists have been sending her threats of rape and death every since.On December 16 2015, Leiby tweeted her 10,000 followers a fairly straightforward gag:As a woman, I just hope that one day I have as many rights as a gun does.", "Today, there were hundreds of marches showing solidarity with Charlottesville, Virginia, where anti-racist protesters were mowed down by a white nationalist. As is usual for these marches, people take pictures and post them to social media, and some inevitably find themselves being asked for permission to use the photos in news stories.", "Hey Barack Hussein Obama America is still waiting for statement about any of the recent violent murders of innocent cops. But you can t be bothered right?", "sonntag  oktober  sonntagsfrage was machen sie heute mit der zusätzlichen stunde tick tick tick  dieses geräusch werden sie dank der zeitumstellung heute eine stunde länger als sonst hören doch was tun mit der gewonnenen zeit in dieser woche will der zeitumstellon unterstützt durch watch control  von ihnen wissen und hier noch die unglaublich spannenden ergebnisse der letzten sonntagsfrage stimmen gesamt  was halten sie vom horrorclowntrend topantworten  ich warte auf den ersten horrorclown der mit seiner kettensäge tollpatschig hinfällt und sich den kopf absägt    stimmen  unerhört dabei lautet doch das  gebot du sollst nicht clown    stimmen  zum glück tun die medien alles um einer hysterie entgegenzuwirken    stimmen foto shutterstock", "Huma Abedin, Hillary s right hand woman, told in testimony that she burned Hillary s schedules in a  burn bag  during her tenure as Secretary of State. Even though the experts in this field are saying burning your schedule has never been done before, is their any doubt that this is just more underhanded secrecy from Hillary Clinton?", "A group of white nationalists and skinheads who support Donald Trump s presidential campaign who were involved in a stabbing attack in California have announced that they will be at the Republican National Convention this July in Cleveland.The group, who call themselves the  Traditionalist Worker Party  revealed their plans.A group of white nationalists and skinheads who held a rally in Sacramento over the weekend where at least five people were stabbed plans to show up at the Republican National Convention in Cleveland next month to  make sure that the Donald Trump supporters are defended. The violent clash at the California state Capitol accentuates concerns about the Republican National Convention, with political tensions high and thousands of pro- and anti-Trump protesters expected to descend on Cleveland.Matthew Heimbach, who leads the group, has been described by the Southern Poverty Law Center as someone  considered by many to be the face of a new generation of white nationalists.", "Is the European gravy train finally coming to an end?The Danish parliament is considering a bill to seize migrants  valuables to pay for their benefits.The leftists are very upset about this commonsense legislation. Daily Sabah reported:A controversial Danish bill to seize migrants  valuables to pay for their stay in asylum centers looks set to pass in parliament after the government on Tuesday secured a parliamentary majority.Parliament was set to begin a series of debates on the bill yesterday, ahead of a vote on Jan. 26.", "At least one D.C. public school marching band has participated in the past five inaugural parades, but none applied for consideration this year.Ballou High School s Majestic Marching Knights performed Destiny s Child s  Lose My Breath  at George W. Bush s second inaugural parade in 2005, and stepped along Pennsylvania Avenue as they played James Brown s  I Got You (I Feel Good)  at Barack Obama s second inaugural parade eight years later. But the beloved band decided to take a break in January and not apply to play in the inaugural parade after several other recent performances, the principal said.", "Nebraska Senator Ben Sasse seems to be fed up with his party, and there s no way in hell he s going to vote for Donald Trump. In a lengthy Facebook post, the Nebraska Senator called for a third party run to stop Trump.", "It has been 15 years since the World Trade Center Twin Towers fell. But Republicans and Donald Trump still exploit it for political gain.During Trump s primary run for the Republican nomination, he made a claim that sent journalists into a frenzy of fact-checking.", "The water crisis in Flint is not just simply a man-made disaster, it is the actualization of unconstrained Republican policy. For more than a year, Michigan Governor Rick Snyder and the emergency manager of Flint ignored the voices of all those who spoke out about the contamination of Flint s water.", "When Hillary Clinton called out  half  of Trump supporters for harboring deplorable behaviors   which include, but are not limited to the following: racism, sexism, homophobia and Islamophobia   the GOP threw a hissy fit. How dare Clinton call out the Trump base, which does lean more in the direction of white supremacy than any other campaign base of support.The media crucified her, and called it her  47 percent  moment.", "As you all know by now, former Daily Show host Jon Stewart once gave Donald Trump a much-retweeted nickname: F*ckface Von Clownstick   and on Tuesday, he told the crowd at this year s Stand Up For Heroes benefit exactly how Trump earned that nickname.Recounting Trump s numerous and blatant attempts to point out to his Twitter followers that Stewart is a Jew, demanding to know why he abandoned his heritage by adopting the name Jon Stewart for showbiz.If Jon Stewart is so above it all & legit, why did he change his name from Jonathan Leibowitz? He should be proud of his heritage!", "Donald Trump has revived the birther conspiracy theory, but this time he has targeted a fellow Republican: Ted Cruz.Cruz has begun creeping up in some state polls, particularly in evangelical-heavy Iowa, so as he has done in the past Trump went on the attack.Donald Trump said in an interview that rival Ted Cruz s Canadian birthplace was a  very precarious  issue that could make the Texas senator vulnerable if he became the Republican presidential nominee. Republicans are going to have to ask themselves the question:  Do we want a candidate who could be tied up in court for two years?", "On Saturday, Donald Trump tweeted a dire warning about Iran test-firing a missile, and proclaiming that the country was  working with North Korea,  whatever that means. The tweet was easy to overlook, since it was part of a litany of unhinged rants about Obamacare, Alabama s special election, a basketball player, the National Football League, and his idea of patriotism.Iran just test-fired a Ballistic Missile capable of reaching Israel.They are also working with North Korea.Not much of an agreement we have!", "It appears Donald Trump jumped the gun when he announced a ban on transgender people serving in the military.On Wednesday morning, Trump declared that he spoke with the general and military experts and decided to discriminate against transgender people.After consultation with my Generals and military experts, please be advised that the United States Government will not accept or allow  Donald J. Trump (@realDonaldTrump) July 26, 2017 .Transgender individuals to serve in any capacity in the U.S. Military. Our military must be focused on decisive and overwhelming ..  Donald J. Trump (@realDonaldTrump) July 26, 2017 .victory and cannot be burdened with the tremendous medical costs and disruption that transgender in the military would entail.", "Fox News  Harris Faulkner BLOWS UP the WHOLE Russia Collusion Theory with ONE SMART QUESTION that we re sure the media will ignore!On Sunday, Fox News anchor Harris Faulkner asked the best question to those who believe both, that there was collusion and that Jared Kushner had or reached out for a secret back channel with Russia after the election: If it s true, wouldn t that signify that there was not collusion? Why would you need a back channel with the Kremlin if, in fact, you already had several established?", "Leading Republicans have already expressed anxieties about Tillerson, as they contend with intelligence assessments saying that Russia meddled in the U.S. presidential election to help turn the tables Trump s way. FOX NewsThe RINOs will certainly join in with their concerns just like Marco Rubio did in a tweet: Being a  friend of Vladimir  is not an attribute I am hoping for from a #SecretaryOfState.", "If there s one thing that can likely unite all Americans regarding the 2016 presidential election, it s a general feeling of panic and uncertainty. At this point in the race, everything is still relatively up in the air in regards to who will be the nominee from either party, and most certainly who will win the White House come November.Perfectly encapsulating the panic and uncertainty we re feeling are the folks over at The Simpsons.", "Every American should be demanding answers about why Barack Hussein Obama is in such a hurry to empty Gitmo before he leaves office. Illegal alien prisoners are being released at an unprecedented rate.", "Comedian Jon Stewart has never been shy about his absolute disdain for Donald Trump, now the presumptive Republican presidential nominee. But since he left the Daily Show, he has been mostly silent on one of his most frequent targets as he achieved unprecedented political success.That just ended.", "This video takes you from the beginning of Trump s improbable rise in the ranks of professional politicians to the last man standing in the GOP. Here s why America is rooting for Trump:", "Every four years, we re told that the upcoming presidential election is the most important in our lifetimes. While it does seem that every election cycle the consequences become much more serious, this one is particularly notable because, regardless of politics, it s a clear choice between sane and insane.Donald Trump is insane.", "Ivanka Trump and Chelsea Clinton defended Malia Obama after conservative websites published breaking news showing the former President s daughter acting like a 19-year-old college student, which she is. Obama was seen in one photo kissing her Harvard University boyfriend, and a video circulated showing her blowing smoke rings and for some reason, that made Trump supporters  heads explode.", "Shawn Helton 21st Century WireEarlier this week Apple CEO Tim Cook publicly rejected an unprecedented US Federal Court order that would force the company to decrypt an iPhone linked to one of the San Bernardino shooters   a move that would have vast implications  PRIVACY & PROTECTION: Apple CEO Tim Cook challenges FBI court order to unlock private data of users (Image Source: Iphoneitalia)Breaching Public Privacy In a published open letter entitled,  A Message to Our Customers,   Apple CEO Tim Cook strikingly opposed a recent federal court ruling that would unlock a phone that s been connected to the San Bernardino Mass Shooting case.The FBI ruling stipulates that Apple must provide access for one time only. However, cyber security experts and technology companies insist this is a virtual impossibility and a guarantee that cannot be made.In theory, the decryption of the phone would be opened via a newly created operating system that would give the FBI a backdoor into the device.", "If there s one thing about Donald Trump that isn t presidential (aside from literally everything) it s the people he has selected for top-level positions   a raging anti-Semite and racist as White house chief strategist, a man who was too racist to be a judge for US attorney, and a guy who actually got caught holding plans for a national registry of Muslim immigrants in his hands during a photo-op with The Donald for Homeland Security secretary, for example.That a minority of Americans was able to elect someone like Trump is embarrassing enough but the people he is appointing to high-level roles makes us a laughingstock. Recently, legendary actor John Cleese was watching it all unfold on American television and noticed that   It looks as though Trump is assembling the crew for a pirate ship  rather than people who will lead the United States.Watching US TV today reminded me of my remark on Conan O'Brien.", "When you ve lost the support of the whole Reagan family, you re pretty much done for. While Republicans all across the country compete to see who can be the most like Ronald Reagan (hint   none of them can), the former president s family (including his neoconservative son) have been vehemently distancing themselves from the GOP and its presidential nominee Donald J. Trump.After a Trump supporter told Michael Reagan he wished the Gipper were still alive to see Trump ascend to the presidency, Reagan shot back with an unexpected (and surprising) revelation:My father would not support this kind of campaign,if this is what the Republican Party wants leave us Reagans out.Nancy would vote for HRC https://t.co/jkjKBvlwHa  Michael Reagan (@ReaganWorld) October 3, 2016Reagan has taken to Twitter in the last several days to utterly denounce Trump and apparently the entire GOP, hitting Reince Priebus for being a spineless hack who only cares about his career instead of the future of his party and country:If the RNC supports this I cant suppoet the RNC.Trump on Clinton:  I don t even think she s loyal to Bill  https://t.co/zTBMcB3wUi  Michael Reagan (@ReaganWorld) October 3, 2016It appears that that the only remaining Republican in the Reagan family may be on the verge of leaving the party for good.", "Well, we all know liberal goofball Sarah Silverman is attention deprived because she s always the loudest and most disgusting comic in the room. It s just embarrassing when she calls impassioned Bernie followers  ridiculous  for not buying into the Hillary Grifter scam.", "Hillary Clinton will be back in the spotlight this fall for an unprecedented, big-ticket book tour for her new tome What Happened, with tickets priced as high as $1,200.On Monday, the ex-Democratic nominee announced  Hillary Clinton Live,  a 15-city tour, which includes stops in a handful of states she lost in the election last year.The astronomically priced tickets for Hillary s loser tour, certainly begs the question:  If no one came to see Hillary at her rallies (for free) when she was running for president, why would they pay $1,200 to hear the even more irrelevant Hillary Clinton whine about why she lost to Trump? Promotional materials for her first stop, at the Warner Theatre in Washington, D.C., promises Clinton plans to  let loose  and tell her audience a  personal, raw, detailed and surprisingly funny story  of her election loss and recovery.The website promoting the tour, HillaryClintonBookTour.com, features a quote from Clinton too.", "Senator Jeanne Shaheen justifies leaking phone conversations of President Trump! She says that Trump s tweeting is  a problem  and that it s a  serious situation .", "People across America are waiting in line for hours to see Trump speak about how he plans to  Make America Great Again. Many are being turned away, simply because the venue doesn t have enough seats.", "Donald Trump can barely go a day without saying or doing something truly offensive to women. Further pushing away women voters (as he has been successfully doing during his entire campaign), Trump decided to make light of sexual abuse over the weekend by comparing the United States  relationship with China to rape.Trump made these misogynistic comments at a rally on Sunday, where he said: We can t continue to allow China to rape our country, and that s what they re doing.", "Donald Trump insists that he doesn t have to divest or sell his business empire to be president, but George Takei strongly disagrees.Throughout the campaign and ever since the election, Trump has been repeatedly criticized for desperately trying to hold on to his company.You see, past presidents have sought to avoid conflicts of interest by selling their businesses or putting them in a blind trust so that whatever decisions they make as president are for the good of the country instead of being for the profit of their business.But Trump not only wants to keep his business in the family while serving as president, he has openly used his status as president-elect to do business. For instance, Trump met with the leader of Japan and invited his daughter Ivanka to sit in.As Newsweek pointed out in a damning report on Trump s conflicts of interest, At the same time, officials with her clothing company were working on a licensing agreement with Sanei International.", "Move over, Storm-From-X-Men! In addition to having gigantic hands (the most giganticestest in the world, no less!", "The rogue government Twitter accounts, which all consider themselves to be helping resist Trump, go about their missions in different ways. Some are keeping the flow of information alive with an administration that wants everyone to shut it.", "A woman was raped by a football player at the University of North Carolina and she says that when she reported the attack to campus police, they laughed in her face.Delaney Robinson decided to go public with her horrific ordeal because she felt it would be the only way to get justice since the school would obviously rather protect a sports star than prosecute a sexual assault. Speaking at a press conference, Robinson said that on the night of Feb. 14, Tar Heels junior linebacker Allen Artis brutally raped her in a dorm room while she was  incapacitated.", "Canadians are not pleased after White House mouthpiece Sean Spicer refused to rule out Sarah Palin as Donald Trump s choice as Ambassador to Canada.During yet another disastrous press briefing, Spicer suggested to reporters that Trump is considering America s village idiot as the United States Ambassador to Canada. We have no additional ambassador nominations or announcements to make on that front,  Spicer said when asked about Palin s name being floated for the position.", "This story should send chills down the spine of every American. Communism is on our doorstep THEY CAME WITH A BATTERING RAM.", "Another day, another racist dog whistle echoed by Donald Trump. While the urban unrest in Charlotte, North Carolina continues, Trump   in a pathetic attempt to sound presidential   blamed the rioting on drug use, without citing any facts to back up his claim.The comment, made in a speech in Pittsburgh, was off-script: If you re not aware, drugs are a very, very big factor in what you re watching on television.", "The EPA had already started expanding powers over private property via the Clean Water Act when last year we covered a case of the EPA fining a family a crazy amount per day:EPA TARGETS COUPLE S PRIVATE POND:NOW THE EPA HAS EXPANDED ITS POWERS TO JUST ABOUT EVERY POSSIBLE THING THAT HAS TO DO WITH WATER:The EPA has released its Waters of the United States (WOTUS) rule critics say would allow the agency to regulate waterways previously not under federal jurisdiction, including puddles, ditches and isolated wetlands.Republicans, farmers and industrial groups have called the rule an EPA  power grab  because it extends the agency s powers to new heights. Environmentalists and the Obama administration, however, argue the WOTUS rule is necessary for protecting water quality.No matter how you spin it, the EPA s WOTUS rule does expand the agency s authority, and creates new avenues for environmental groups to sue projects they want to stop from moving forward.", "BRAVE GUY!", "A clueless CNN reporter trying to interview a cold and hungry woman with her children is oblivious to the fact that this woman and her kids need help STAT!Unreal! What the f*ck CNN!", "Arizona Republican Senator Jeff Flake has never been a fan of Donald Trump or his incendiary, divisive brand of politics. Now, he is a leading GOP voice against electing Roy Moore (R-AL) to the United States Senate.", "21st Century Wire says What is wrong with Chris Matthews?In the following clip from RT America s Redacted Tonight, host Lee Camp looks at a stunning revelation from MSNBC s Chris Matthews, who once famously said he had a strange feeling up his leg while watching Obama talk; a feeling that he described as an  objective assessment .Matthews flat out states that there is a plan in place at MSNBC to announce Hillary as the clear winner, hours before anything is officially declared, to make people think they will be wasting their time by going out to vote for Bernie.This is a stunning example of the dirty tricks that the mainstream media will play to further their preferred establishment candidate s position in the race: EVERYTHING ON ELECTION 2016: 21st Century Wire Election Files", "People who parrot and spread Trump s claims that the media lies absolutely cannot stand it when they re asked to provide examples. They try and deflect, just like Trump, except not all of them seem to be as skilled at twisting things around as Trump tries to be (and Trump himself becomes completely unhinged when someone in the media fact-checks him while talking to him).", "Politico Congressional reporter Rachael Bade started a Twitter war with Congressman Darrell Issa yesterday, accusing Issa of flipping her the bird when she questioned him on the topic of recently ousted former FBI director James Comey.In a tweet that has been retweeted more than 25,000 times since Tuesday, Bade claims in no uncertain terms that Congressman Issa  literally gave me the middle finger  when she asked for any recent news or comments on Comey s firing. Issa eventually replied to Bade s tweet to deny the claim, stating that Bade must have seen or heard something to believe this happened, but it didn t. I just asked @DarrellIssa abt the Comey news and he flicked me off   literally gave me the middle finger   and kept walking.", "If you have the stomach to actually follow the Republican debates that seem to happen every other day now, you know that Jeb Bush has a singular mission at this point in his campaign: Attack Donald Trump. Bush, long considered the establishment favorite to win the Republican nomination, has been pushed around by Trump since the very first debate with very little success at firing back.That s not for a lack of trying.", "To think that Huma Abedin had access to top secret State Department documents is frightening. She and her family have super shady connections to radical Muslim groups.", "Now, most of the demonstrators gathered last night were exercising their constitutional and protected right to peaceful protest in order to raise issues and create change. Loretta Lynch aka Eric Holder in a skirt", "Massive protests have been taking place Boston where a FREE SPEECH rally was planned at Boston Commons. It s now being reported that the FREE SPEECH rally has been shut down because the city was overwhelmed by violent members of ANTIFA and the Black Lives Matter hate group.Fox News captured a horrific incident on film of a woman who appears to be a senior citizen who was peacefully holding an American flag when she was blindsided by an Antifa thug who attacked her when he grabbed her US flag.", "WOW! John McCain is leading a vicious campaign against the Russian government since the November election.In January McCain suggested the Russian  hacking  of the election was an  act of war.", "If Donald Trump goes down, so does House Speaker Paul Ryan.At least that s what Trump supporters are suggesting in an attack on Ryan on Breitbart.com, whose CEO Steve Bannon works on the Trump campaign.An article posted on Breitbart accuses Ryan being a Hillary Clinton supporter who has a pro-Islamic agenda simply because he has been critical of Trump and some of the things he has said and done throughout the campaign.Ryan and Clinton share a progressive, globalist worldview, which is at odds with Trump s  America first  approach. Indeed, both Clinton and Ryan have said that they see themselves as representatives not only for American citizens, but also for foreign nationals and foreign interests.", "21st Century Wire says It s Halloween   and Hillary Clinton is getting asked what she will wear for a Halloween costume. There s plenty of scary to go around, but the recently defeated Democratic presidential candidate offered one idea that would send shivers down the spines of many on All Hallows  Eve: I think I will maybe come as the president!", "In an apparent attempt to prove to the world that he is the devil himself, George Zimmerman recently decided to auction off the gun he used to murder Trayvon Martin. The move has been universally condemned by everyone who is not a heartless monster.Fortunately, some brilliant individuals decided to hijack the online auction for the weapon, mocking the gun s sale with fake bids.", "The left can t take the great jobs report away from President Trump! He s delivering BIGTIME when it comes to jobs and growth!", "This is out of control! Is there anything more un-American than telling high school students they aren t allowed to cheer  U.S.A.!", "White House press secretary Sean Spicer said on Thursday that the federal government could crack down on recreational marijuana use across the country, even in states that have legalized weed. This from the party of states  rights.", "By Vin ArmaniHillary Clinton continues to blame Russia for the email leak   even though it doesn t matter who leaked the damning emails if they are true.Now she s hinting that Russia can hack and rig the election in favor of Donald Trump. Putin laughs at her.", "Who knew the Middle East had a prestigious school for fake inventors who bring fake bombs to school on 9-11? Clock kid  Ahmed Mohamed and his family announced Tuesday in a news release that they will move to Qatar, less than 24 hours after the 14-year-old met with President Barack Obama at the White House.", "In the age of Donald Trump, it seems that Twitter is ground zero for public spats, public shaming, and all sorts of back and forth exchanges. That is why this is the platform Lawrence O Donnell, host MSNBC s The Last Word, is using to troll Bill O Reilly s reprehensible behavior when it comes to what appears to be years and years of sexually harassing women from his throne over at Fox News.It seems that O Reilly is choosing to actually sue one of his accusers for speaking out, and O Donnell is determined to gin up as much public support as possible for this woman in her most vulnerable hour.", "Ted Nugent hits the nail on the head Ted Nugent and David Crosby are in the midst of a social-media spat over Nugent s claim that  political correctness  is keeping him out of the Rock and Roll Hall of Fame. Crosby has dismissed the Motor City Madman s work as not good enough, while Nugent called the former Byrds star a  bloated chemical repository  in response.Nugent fired the first shot last week when he accused Hall of Fame boss Jann Wenner of hating the Second Amendment and the NRA, of which Nugent is a board member.", "It s become more than obvious that Donald Trump has absolutely no filter when he speaks. He says exactly what is on his mind, and as it would appear, he may even believe his own lies.What Trump also seems to believe, is that he s the best thing that ever happened to the world and we should all be grateful to be alive during his existence on the planet.", "Brunell Donald-Kyei:  We want tougher immigration. To make sure that our borders are safe!", "A member of the Worker s World Party pulled down the statue in Durham, NC. It s really not about the statues It s a culture war and a leftist revolution.", "Donald Trump is a complete hypocrite.Just a day after curtsying to the Saudi Arabian king after repeatedly whining about President Obama bowing, Trump delivered a speech about terrorism in which he failed to say the words  radical Islamic terrorism,  something else he bitched about every time President Obama talked about terrorism.As you ll recall, Trump even went so far as to claim that President Obama was in league with ISIS just because he refused to say those three words. And he also said Obama should resign from office if he can t say it.", "THIS IS MADDENING! We have a president and congress who do nothing but promote illegal entry into America TREASON!", "There is an attitude among those on the right that if you aren t a straight white male, you come armed with a political agenda that keeps you from doing your job. Even Anderson Cooper, who is one of the nation s most respected journalists, and who happens to be gay, had his credibility called into question, at least when he s covering stories that happen to be about gay people.That was the accusation by Fox News  Howard Kurtz, who said that Cooper couldn t have been fair to Florida Attorney General Pam Bondi, when he asked her about her civil rights record when it comes to LGBT issues.", "dr david duke and dr slattery expose hillarys treason and why trump  duke will win   am \ndr david duke and dr slattery expose hillarys treason and why trump  duke will win \ntoday dr duke and dr slattery talked about hillarys clear acts of treason against the united states by providing massive shipments of weapons to saudi arabia at a time that she knew they were providing support to isis dr duke if elected to the senate would be in a position to expose hillary and push for her impeachment should she win steal the election blood on the traitors hands \ndr slattery discussed postelection scenarios he noted that if trump wins in a close election a small number of republican electors could be bribed to vote for hillary throwing the election to her or even vote for pence throwing the election to the house of representatives to decide from amongst trump hillary and pence should hillary win and trump supporters feel the election was illegitimate impeachment would be more likely \nthis is an extremely educating and enlightening show please share it widely \nour show is aired live at  am replayed at et pm eastern and am eastern \nclick on image to donate \nand please spread this message to others", "Senate Democrats had one last, huge move planned to stop Betsy DeVos from being confirmed as Education secretary   an all-night debate marathon on the Senate floor. Their ultimate goal?", "Military veterans are expressing extreme concerns about the behavior and reaction of Donald Trump to the revelation that hackers under the employ of Russia stole information from Democrats and passed it on to WikiLeaks in an attempt to influence the result of the election. While Donald Trump and congressional Republicans have down played this information, veterans are now pushing back.Retired Major General Paul D. Eaton, senior adviser to VoteVets.org, has released a statement blasting the Trump/Republican reaction to this dangerous moment:When you see a President-elect of the United States so enamored by the Russian regime, as well as are his National Security Adviser and potential Secretary of State, and then find out the Russian government interfered in our election to help that side, it is cause for alarm.We join Senator Wyden and other Intelligence Committee members in calling for materials on Russian hacking that can be declassified to be immediately released to the public.", "This did NOT go well.In a nearly empty room of people on Friday at the World Assembly for Women in Japan, Ivanka Trump had the gall to talk about sexual harassment despite the fact that her own daddy has been accused of rape and sexual harassment by over a dozen women, not to mention the fact that he has openly treated women like shit over the years. All too often, our workplace culture fails to treat women with appropriate respect,  Trump said.", "This woman has no shame1 Muslim activist Linda Sarsour (remember the fake women s march?) has been caught sending money meant for hurricane relief to a lefty political PAC.", "The Clinton Grifters were out in NYC and ready to fundraise for Hillary but looks like Bill didn t waste any time he s such a flirt! Check out the photo below of the not so loving grasp Bill has on Hillary.", "https://www.youtube.com/watch?time_continue=1&v=NeqMSI6OR5Q", "The keepers of the written word in America are so abhorred by the prospect of Donald Trump becoming president that they penned a letter to the country declaring their opposition.Hundreds of writers and authors, many of whom are world renowned, wrote and signed a letter listing the many reasons why they refuse to support the presumptive Republican nominee.Among those who signed the letter include horror author Stephen King, author of The Joy Luck Club Amy Tan, and novelist Daniel Handler, better known to audiences as Lemony Snicket.The letter condemns Trump for abusing language to advocate for violence, bigotry, sexism, and division all in the pursuit of power, which the authors point out has created many a dictatorship. They also declare that wealth and celebrity do not qualify anyone to speak for all Americans, much less lead the military.And in a final flourish, the writers declare that they  unequivocally  oppose Trump s candidacy as a  matter of conscience.", "Republican congressional investigators expect a potential  smoking gun  establishing that the Obama administration spied on the Trump transition team, and possibly the president-elect himself, will be produced to the House Intelligence Committee this week, a source told Fox News.Classified intelligence showing incidental collection of Trump team communications, purportedly seen by committee Chairman Devin Nunes, R-Calif., and described by him in vague terms at a bombshell Wednesday afternoon news conference, came from multiple sources, Capitol Hill sources told Fox News.The intelligence corroborated information about surveillance of the Trump team that was known to Nunes, sources said, even before President Trump accused his predecessor of having wiretapped him in a series of now-infamous tweets posted on March 4. What I ve read bothers me and I think it should bother the president himself, and his team because I think some of it seems to be inappropriate.", "Donald Trump hates losing. Not because it s a loss to his agenda, or a perceived loss to the American people.", "Recently re-released footage from a 1988 appearance on The Oprah Winfrey Show gives insight into what Donald Trump really thinks of women.In the video, Trump appeared with his then-wife Ivana Trump and told Winfrey that  We get along very well, and there s not a lot of disagreement because ultimately Ivana does exactly as I tell her to do. Like many of Trump s predictions and investments over time, that marriage also ended up going bust.", "In a recent interview with CNN, former senator and Republican presidential candidate Rick Santorum hinted that President Trump s time so far in office would be more successful and that he still has the ability to become a better leader if he makes one simple change   Just stop tweeting.During Sunday morning s edition of State of the Union with Dana Bash, Santorum made his point clear in absolutely no uncertain terms. If you tweet every day and complain about the media and complain about how you are being treated, you re going to be sidetracked and you re not going to get your deals done.", "Once again, conservatives have gone above and beyond to prove that quite literally anything will send them into a racist tirade against the President of the United States.On Mother s Day, Fox News posted photos on Facebook of a gorilla who had recently given birth unexpectedly. The pregnancy was a bit of a shock to the staff at Prague Zoo, who say they had  given up hope  that Shinda, the 24-year-old primate, would ever have a baby.", "Donald Trump drew a line in the sand: Pass the Obamacare repeal and replace bill or else.Then it blew up in his face. Republicans created a bill so unpopular that he couldn t even get it to pass the House.", "Illegal aliens are killing Americans and Trump has taken up their cause. Here s part of a town hall with Hannity and Donald Trump joined by families of those murdered by illegal aliens heartbreaking!#MakeAmericaSafeAgain#TrumpPence16https://t.co/JNcfsLJF9i  Dan Scavino Jr. (@DanScavino) August 24, 2016", "Obama can be seen addressing a crowd about religion and the role it plays in our lives and in politics. The most interesting line comes at the beginning of the video when he tells the crowd America is no longer a Christian nation:  We are no longer a Christian nation.", "dienstag  november  erdogan ratlos was er noch machen soll damit eu beitrittsgespräche beendet ankara dpo  es ist einfach wie verhext nachdem er seit monaten alles dafür getan hat dass die beitrittsgespräche seines landes mit der eu endlich abgebrochen werden ist der türkische präsident recep tayyip erdo?an mit seinem latein am ende warum die europäische union weiter verhandeln will kann er beim besten willen nicht nachvollziehen ich bin gerade dabei die todesstrafe einzuführen ich lasse täglich neue gegner meiner regierung verhaften schränke die presse ein flucht erdo?an während er gerade vor dem spiegel sein bärtchen stutzt worauf zum teufel warten die in brüssel denn noch das müsste doch locker reichen dass die türkei hochkant rausfliegt selbst will er die verhandlungen mit der eu nicht abbrechen ich muss warten bis brüssel die beitrittsgespräche abbricht damit ich das dann in aller öffentlichkeit anprangern und mich selbst als opfer darstellen kann so erdo?an wenn ich die gespräche abbreche bin ich der buhmann huch fast hätte ich die nasenhaare vergessen kritisch betrachtet sich erdo?an im spiegel er beschließt den deutschen außenminister frankwalter steinmeier der gerade die türkei besucht zu einem persönlichen gespräch zu empfangen ich haue dem zur begrüßung einfach eine rein jawoll ruft erdogan energisch und nickt seinem spiegelbild zu mal sehen was sie dann machen idee shp dan ssi foto m shutterstock artikel teilen", "There are quite the number of mixed reviews coming in this morning of Larry Wilmore s monologue at the White House Correspondents  Dinner. Wilmore, who runs The Nightly Show on Comedy Central, took some pretty serious stabs at the mainstream media, particularly CNN.At one point, Wilmore asked where Wolf Blitzer was by saying,  Speaking of girls, where s Wolf Blitzer.", "Florida Governor Rick Scott isn t up for re-election. His creepy, Skeletor-like appearance is secured through 2018.", "The Police Union came out almost immediately after the Mosby press conference today with a response against her assessment of the Freddie Gray Case. They are fighting back against the claim that the 6 officers did anything wrong during the arrest and transport of Mr. Gray.Fraternal Order of Police lodge is asking Baltimore State s Attorney Marilyn Mosby to appoint a special prosecutor to the Freddie Gray investigation because of her personal connection to the Gray family s attorney, William H.  Billy  Murphy Jr., and her marriage to a city councilman.", "Donald Trump supporters are so desperate to be in power that they are threatening America at gunpoint to vote for him or be killed.That s what Georgia Trump fan Jimmy Arno is preparing for after the election votes are tallied in November because he expects a bloody civil war to break out in order to overthrow the government before Hillary Clinton is inaugurated.Arno is even considering joining a right-wing militia, whom he collectively refers to as  patriots,  because he seriously believes only they can defend the Constitution. Should martial law, civil war   whatever   break out in this country, they will uphold the Constitution and rebuild our loss,  he said.", "Keep your eye on Anita Moncreif If knowledge is power she is the Democrat Party s worst nightmare. When you re on the left, and all of your friends are leftists, and your parents are leftists, you don t hang around with other people, and you only get the view of folks as what you see on TV, and how they present it to you.", "As it turns out, 67 year old Hillary Cinton used to hear her grandparents talk about the immigrant experience when she was a young girl, so she just thought they were immigrants Mission accomplished. No more clarification is necessary.On Wednesday in Iowa, Hillary Clinton invented three immigrant grandparents to push for more foreign workers.", "When you re Donald Trump (or any Republican for that matter) and the Washington Post comes to your defense, you know it means there are too many untruths surrounding the story to pull off this particular lie Donald Trump is complaining that the media has spun a fable that he kicked a baby out of his rally in Ashburn, Va.The New York Post, for instance, headlined its article:  Trump loves crying baby, then kicks the tot out of his rally. The New York Daily News, in its article on the incident, began:  What a baby.", "It was just this morning that Donald Trump once again tried to ignore his mounting failures and pump up his ego by trashing the press. Taking to Twitter, the undeserving POTUS bashed the New York Times (again) with yet another one of his lies.", "pm again donald trump was not opposed to the war in iraq   \never since donald trump was lambasted by leaders in both parties for fighting with a gold star family and dishonoring the service of captain humayun khan hes been trying out a new approach pretending khan would still be alive if he was president \nkhan was killed in  in a suicide attack in iraq \nwhen the republican was asked in an interview with abcs george stephanopoulos if he thinks he should apologize for the way he treated the khan family following the democratic national convention he repeated this bogus claim \nvideo  realdonaldtrump stands by claim slain us army capt humayun khan would still be alive if he had been president httpstcovglaqcja pictwittercombcditmxyk \n abc news politics abcpolitics october   \ntrump said i have great respect for the khan family i have great respect for  i mean their son is a great hero  but if i were president at that time capt khan would be alive today george because i wouldnt have been in iraq  i was opposed to the war in iraq \nas hillary clinton and many objective sources have noted repeatedly throughout the campaign donald trump was not opposed to the war in iraq from the beginning had he been president at the time the war still would have taken place because trump was in favor of it \nin fact trumps campaign rhetoric today indicates that he would be a president who acts recklessly and would only embolden our enemies this would make the world a more dangerous place and only increase the odds that america gets mired in more conflicts not less \nfor their part the clinton campaign has continued to stand up to trumps attacks on the khan family in an emotional new ad released days ago capt khans father recounts how his son died protecting everyone in his unit khans father asked of trump would my son have a place in your america \nthe answer to mr khans question is a resounding no as trump has promised to ban muslims  like the khans  from even entering the united states for those living here already a president trump would treat them like criminals \ndonald trump will likely continue to rewrite history when it comes to his initial support of military intervention in iraq but after spending so much time throwing mud at the khan family its unlikely that anybody will buy it", "Just when you thought Republicans couldn t get more deplorable, they go and prove you wrong.The official Twitter handle for the Tennessee GOP just tweeted out a tweet that said: Watch thousands of deplorables chanting:  lock her up  at Trump rally in Colorado Springs. Even worse, with the hashtag  EvangelicalTrump  because you know, that s what Jesus would do.", "The Washington Post reports that the Republicans and the billionaires that own them are more or less writing off the White House as a total loss and rushing to hold onto both the House and the Senate. They re afraid, and for good reason, that if when Donald Trump becomes the Republican nominee, he s going to be crushed so badly in the general election that he ll deliver both chambers of Congress to the Democratic Party:The efforts are being driven by major players such as the Koch brothers  political network, which has already begun laying groundwork in Colorado, Ohio and Pennsylvania, along with the Crossroads organizations and the U.S. Chamber of Commerce.The behemoth Koch operation   which aims to spend almost $900 million before the November elections   is now considering abandoning Trump as a nominee and focusing its resources on behalf of GOP congressional candidates.My colleague Korie Beth Brown wrote about how Trump is putting the heavily gerrymandered House into play and this move by the GOP Donor Class confirms it: Trump is leading the Republican Party to electoral annihilation.Hooray!According to WaPo, instead of dumping a billion dollars into winning the White House, the Kochs and their fellow oligarchs are planning to spend all of that money just to keep what they already have:A key element of the strategy will be a springtime wave of television ads that slam Democratic contenders and tout Republican incumbents as attuned to hometown concerns.", "The LA Times is reporting that the Federal Bureau of Investigation carried out a search warrant on the campaign office of Rep. Duncan Hunter (R-CA) in relation to misappropriated funds during the campaign. Specifically, they searched the campaign treasurer s office for documents and electronic records related to campaign spending.This is far from the first time Duncan Hunter has made his way into the news cycle for misusing campaign funds, so it should come as no surprise that the investigation has gone this far.", "While Donald Trump may have spent a lot of time dissing President Barack Obama during his presidential campaign, he has definitely changed his tone   likely because he knows how incredibly screwed he is if Obama doesn t hold his little orange hands during this transition process.On Wednesday, Trump horrified the entire Republican Party by showering praise on our current president and even said that he thinks so highly of our current Commander in Chief that he has taken some of Obama s advice on his future cabinet. During an interview on The Today Show, Trump touched on several subjects, but his most shocking statements were his kind words about Obama.", "Florida Senator Marco Rubio actually knows something the rest of us know for once: That there aren t enough racists in America   or even the Congress   to pass Donald Trump s new immigration bill. The bill would curb even legal immigration, setting a completely arbitrary limit on how many total people could come to America through traditional methods.Last Wednesday, Trump trotted out that annoying kid from the Comey hearing, Tom Cotton, and human stegosaurus David Perdue to unveil the RAISE Act, a singularly horrible piece of legislation that would among other things require proficiency in English, advanced degrees, and/or high-paying job offers in order to legally immigrate to this country.", "Is it any wonder veterans are getting behind Donald J. Trump in huge numbers? Isn t it about time we took care of our veterans the way they deserve to be taken care of?", "170619-N-AA175-092..SAN DIEGO (June 19, 2017) Command Master Chief (Ret.) Kathleen Henson, from Midland, Mich.,, center, and USS Makin Island (LHD 8) Sailors cut a cake during the Lesbian, Gay, Bisexual, and Transgender Pride Month observance.", "This is exactly what Bill Maher had in mind when he invited Milo Yiannopoulos to come on his show.In response to Yiannopoulos being unable to speak at UC Berkeley earlier this year because protesters refused to let him spew his hate on their campus, Maher decided to bring on Real Time. After scheduled panelist Jeremy Scahill dropped out in protest, Maher blasted the decision.", "Just one day before California and New Jersey have their primaries, the Associated Press reports that Hillary Clinton has reached the threshold of delegates (including pledged and non-committed) to win the Democratic Primary.The AP reports that Clinton clinched the nomination just after 8 p.m. Eastern Time when about 25 superdelegates came out and backed Clinton.This is an historic moment, as the Democratic Party has made the move to make Clinton the first woman nominated to a major political party for President of the United States.Democrats were also the first major party to nominate a woman for the Vice Presidential position in 1984, with Geraldine Ferraro.Before the hour s big superdelegate shift, Clinton was 24 delegates away from clinching the nomination, and was expected to make up the difference when the polls closed in California and New Jersey, which would have sent her way over the top.Should Clinton clinch the amount of pledged delegates needed for a majority, which estimates put at 2,206, there would be no chance of a contested convention in Philadelphia this July.Talking to reporters on Monday, Clinton said: I certainly am going to be reaching out to Sen. Sanders and hope he will join me in that, because we ve got to be unified going into the convention and coming out of the convention to take on Donald Trump and to repudiate the kind of campaign he is running and make it very clear that s not the kind of president or commander-in-chief we want. Tonight, Democrats prove once again to be the progressive party.", "The Washington Post just came out with an explosive report about the extremist candidate that Alabama is running for the United States Senate, Roy Moore. This is a man who has said that homosexuality should be illegal, got removed from the Alabama Supreme Court twice for defying the United States Supreme Court   once over a giant monument of the Ten Commandments he refused to remove from the courthouse, and once for defying the Obergefell v. Hodges ruling that legalized same-sex marriage   and has always made incendiary and bigoted statements that are out of the mainstream even for the Republican Party.", "One of the most interesting and insightful pieces you will read on the reason Americans are drawn to Trump Where did all the Trump voters come from, and where did the Cruz evangelicals go? One of the great mysteries of the 2016 primary is how so many assessments of the Republican electorate turned out to be wrong.", "The Obama family continues to rack up huge bills on transportation alone when they take the thinly veiled humanitarian vacations at the taxpayer s expense. The bill for air transportation is HUGE!", "With the unveiling of the Senate Republicans  disastrous new health care proposal, it s never been more clear that Trumpcare is going to cost tens of thousands of Americans their lives.This health care proposal, which is supposed to replace Obamacare, has been trashed by medical professionals all over the country. There are even several Republicans who are standing firmly against such an inhumane piece of legislation, and on Saturday New York GOP Rep. Tom Reed strengthened the fight against Trumpcare by demonstrating the exact kind of heartlessness that stands behind the proposal.In an interview with MSNBC s Joy Reid, Reed blatantly admitted that the fact that 20,000 or more Americans will die under the GOP s health care plan is of no concern to him.", "Criminals who try to recruit immigrant students, drug dealing and massive brawls between different ethnic groups. This is the situation in Malm , Sweden where they have opened their doors to a flood of unvetted refugees ***Disclaimer***This article has been translated from Swedish to English language.", "It can be said that Florida, while being a very popular vacation destination, is probably more dangerous than the Outback of Australia. Between the wildlife, the mosquitoes, and people like George Zimmerman, it s not always the safest place to be.Fox News just made this abundantly clear.No, they re not warning people about guns or alligators running amok, Fox News host Shepard Smith just told everyone living along the Atlantic coast in Florida that if they don t take the storm warnings seriously, then they re going to die.", "After Tuesday s semi-coronation of Donald Trump as the Republican nominee, a lot of people, both liberal and conservative, took to social media to hyperventilate over the impending disaster of Trump winning the 2016 election.Donald Trump is never going to be President of the United States. Ever.", "Monday night s presidential debate showed a stark contrast between two personalities. One was calm and cool, even under stress and the other was a bloviating braggart who couldn t maintain his temper.On top of those  qualities,  Donald Trump is sexist and he proved it Monday night when Hillary Clinton brought up Trump s record of fat shaming a former Miss Universe.", "In May, New Jersey s Collingswood Public School System adopted a new policy that required teachers to report all incidents of student misbehavior to police.According to Collingswood Police Chief Kevin Carey, the policy required police to respond to incidents they previously would not have investigated, including anything  as minor as a simple name-calling incident that the school would typically handle internally. According to Carey, nearly every student report was forwarded to the New Jersey Division of Child Protection and Permanency.Between the time the school adopted the new policy and the end of the school year, about a month later, police had been called on Kindergartners for arguing, second-graders for calling each other names like  fat  and  short,  a game of tag that was  too rough,  and much more.Police were called on an elementary school student who reportedly made a  gun noise,  and  held his ukulele like a gun.", "Does anyone else get the sense Hillary is not quite as popular with Americans as the media would like us to believe? She can barely fill a phone booth with supporters at her rallies and the activity with her social media accounts pale in comparison to Donald Trump s. Will the media be able to convince enough Americans that voters actually like or trust Hillary by November?", "After GOP candidate Donald Trump and Democratic candidate Hillary Clinton wrapped up their appearance on MSNBC s  Commander In Chief  forum, Reince Priebus, chairman of the Republican National Committee, had some very sexist words for Clinton:@HillaryClinton was angry + defensive the entire time   no smile and uncomfortable   upset that she was caught wrongly sending our secrets. Reince Priebus (@Reince) September 8, 2016The old  she needs to smile more  and  she s too emotional  spiel.", "Donald Trump just accused millions of Americans of voter fraud, proving once again that he should be denied the presidency.Over the course of the last 24 hours, Trump has been whining about a recount effort in Wisconsin and attempts to trigger recounts in Michigan and Pennsylvania. If the recount goes against him, Hillary Clinton would become the President-Elect and Trump would be forced to go home and cry into a gold-lined pillow about how big of a loser he is.In addition to those Twitter posts about recounts, Trump just posted three more bragging that he won the popular vote even though the current vote count shows Hillary with more than a 2 million vote lead.Trump claims he won the popular vote because 3 million people voted illegally, which is a wild accusation that has zero evidence supporting it.In addition to winning the Electoral College in a landslide, I won the popular vote if you deduct the millions of people who voted illegally  Donald J. Trump (@realDonaldTrump) November 27, 2016Trump then claimed that he would have won the popular vote had he focused more on a few large states rather than smaller ones.It would have been much easier for me to win the so-called popular vote than the Electoral College in that I would only campaign in 3 or 4  Donald J. Trump (@realDonaldTrump) November 27, 2016states instead of the 15 states that I visited.", "Trey Gowdy destroys this clueless DHS employee when asking about the due process of getting on the terror watch list. Her response is priceless:  I m sorry, um, there s not a process afforded the citizen prior to getting on the list.", "Just one day after Paul Ryan failed to garner support from his own base to repeal and replace Obamacare, a proposal alleged president Donald Trump staunchly supported, Rep. John Culberson (R-TX) had to face hundreds of angry constituents at a town hall in Texas on Saturday. Let s just say that he didn t have a good weekend.We ll give Culberson credit for at least showing up while many of his colleagues refuse to face their own constituents.", "The topic of Donald Trump s taxes   or rather the lack of disclosure about Trump s taxes   was central to the 2016 vice presidential debate on Tuesday night. Appearing on CNN just as the debate ended, Trump s son Eric appeared in order to defend his father.Eric Trump tells @DanaBashCNN that Donald Trump  absolutely  pays federal income taxes https://t.co/6OZtrfIwim https://t.co/gm29AedxT4  CNN Politics (@CNNPolitics) October 5, 2016Host Dana Bash repeatedly asked the young Trump whether his father paid taxes, and if he would disclose his tax returns to the American people, something he has failed to do so far.In response, Eric Trump repeatedly claimed his dad paid  tremendous  amounts to the IRS and also asserted that he would disclose his tax forms.But reporting from the New York Times shows that when Trump reported a staggering near-$1 billion in losses in 1995, it very likely set him up to dodge paying taxes for the next 18 years.", "After being held in civil contempt for failing to follow a judge s order not to racially profile, Sherriff Joe Arpaio and others held in the contempt of court may now be facing criminal prosecution.Judge G. Murray Snow, who presided over the civil contempt case after finding evidence that Arpaio and other deputies intentionally violated order, referred the case to the criminal court system: The purpose of Tuesday s hearing was to discuss remedies for the civil contempt violations and the possibility of referring Arpaio and others to the U.S. Attorney s Office for Arizona for criminal contempt charges, which could carry prison sentences. The other individuals who may face criminal charges are Captain Steve Bailey, the former head of the MCSO s internal affairs; attorney for the Maricopa County Sherriff s Office Michele Iafrate; Chief Deputy Jerry Sheridan.According to the Phoenix New Times:Bailey and Iafrate allegedly misled the court s monitor about the existence of more than 1,400 IDs improperly seized by the MCSO from individuals stopped or arrested, many of them Latinos.", "Ironically, He KILLED Cops Protecting Rights Of Cop Haters The gunman who opened fire Thursday night in Dallas in an attack on police officers has been identified as Micah Xavier Johnson, the Los Angeles Times and CBS News report.Racist Micah Xavier Johnson was an Army Reserves veteran who took the life of at least one former Marine who was protecting the rights of protesters to protest cops. Officer Brent Thompson has been identified as one of the 5 Dallas police officers killed in Thursday s sniper attack.", "Twenty-four years ago, Oprah Winfrey had a former third-grade teacher on her show who blew every racist s justifications for their own stupidity right out of the water.Jane Elliot was that guest. She is well-known for her  blue-eyed/brown-eyed  experiment (you can read more about that here) which taught her young students in Iowa how racism is learned, not something they are born with.", "Dr. Ben Carson is one of the best at putting a difficult topic into simple terms. Patty and I were lucky enough to hear Dr. Carson speak in Detroit.", "In 2017, Kelli O Brien, the aunt of Joshua Boyle spoke publicly about the kidnapping of her nephew and his wife Caitlan Boyle who expresses her disappointment over the lack of response from Prime Minister Trudeau. Interestingly enough, Trudeau was visiting President Trump when Trump announced that he would soon be announcing some very good news would be forthcoming regarding the captured family s status.TODAY, Boyle and Coleman s families got some very good news!", "21st Century Wire asks The sensational reporting by US corporate media has almost fallen off the edge of reality in this new divise, post-election partisan media envirnoment. As evidenced by the latest engineered  fake news  crisis, the establishment are desperate to recoup its lost credibility.", "Rush Limbaugh is spot on with his analysis of Barack Obama and how he has intentionally torn our nation apart, and more importantly, how Republican leadership has allowed him to do it. This is a great read for anyone who would like to understand exactly how this war on cops and war on White America started RUSH: This is so predictable to me.", "About a month ago, people started noticing a large black man who always seemed to rush to Hillary s aid during coughing fits, or when she exhibits bizarre behavior.Hillary's Handler? Brain washer?", "Here is his epic response to her criticism: Lady came up, told me I should take this hat off. Told her she should go get her money back for her ugly haircut.", "When getting to the truth behind Donald Trump s scandals, there s probably nothing more revealing than Trump s Twitter history and his erratic behavior. Time and time again, we ve seen that when Trump s scandals begin to close in on him, he just gets crazier and does whatever he can to distract from the situation.", "On Thursday, Hillary Clinton ripped Donald Trump and his bigoted administration apart for being on the wrong side of history and refusing to defend LGBT rights   and while she was at it, she showed conservatives just what they missed out on by letting a former reality television star get into the White House instead of a well-qualified politician.At a fundraiser for LGBT community organization The Center, Clinton received an award and gave a speech in which she thanked her audience for their continued support. However, her message came with a chilling warning about the Trump administration as she said the progress that we fought for, that many of you were on the front lines for.", "Donald Trump likes to brag occasionally that he runs a very frugal campaign. Supporters have said this is proof that he ll run a very frugal country, too.", "This summarization by Peter Flaherty, President of the National Legal and Policy Center, of why the indictment of Paul Manafort actually exposes the truth about the dirty dealings of special prosecutor Robert Mueller, is brilliant and is a must-read for anyone who cares to see what s really going on behind the curtain.Daily Caller   More than anything else, the indictments of Paul Manafort and his partner Rick Gates demonstrate the fraudulent nature of Special Counsel Robert Mueller s investigation. The probe has little to do with Russian interference in last year s election.", "the ultimate underdog  shares\n   \never since the telling of biblical fairy tales few stories have lived up to the hype around the mismatch between the shepherd boy david and the giant goliath in the biblical encounter david prevailed by keeping his foe goliath at a distance with a formidable weapon his sling\ntoday a modernday version of david and goliath is playing out\nalthough granted political asylum by ecuador a target of us empire finds himself ensconced under a form of arbitrary detention in ecuadors london embassy under constant surveillance by british police the fully weaponized us empire which boasts of its fullspectrum dominance has arrayed itself and its allies against one unarmed as in having no conventional weaponry man who heads a publishing organization\nthis uppity publisher has had the temerity to expose the secret machinations and war crimes of the militaryeconomic albeit faltering on both fronts behemoth to the worlds public the protransparency publisher wikileaks its founder and de facto political prisoner julian assange and antisecrecy collaborators infuriated the united states establishment with a slew of documents emails and graphic exposes like the  collateral murder  video that demonstrated a us military engaged in war crimes\nnations states are adamant and fastidious about keeping their internal workings under wraps but it is a oneway street as many nation states seek to gather and store any and all information about the citizenry without seeking court approval or the approval of the citizenry in question\nmore swedish government implicated in charges against assange un body to rule on arbitrary detention of wikileaks founder websavvy wikileaks objects to this double standard and it welcomes vets and publishes troves of secret information premised on the principle of the publics right to be informed about what their government is up to\nevidence makes it clear that the violent american establishment engages in browbeating inciting socalled color revolutions to destabilize and overthrow disobedient governments military encirclement and saber rattling this selfdescribed indispensable nation which preens its might before major nation states such as china and russia was not about to have its fullspectrum dominance challenged by punk computer hackers\nleaning on its allies the us enacted a financing squeeze on wikileaks many nation states have been severely crippled and devastated by us sanctions but tiny wikileaks proved more resilient and cleverer than the washington schemers\nin an attempt to topple wikileaks the us establishment has sought to lop off the head of wikileaks it has kept close tabs on julian assange and is purportedly behind a scheme to bring assange down in sweden we have been warned that the pentagon for example is thinking of deploying dirty tricks to ruin us\nin sweden consensual sex has been parlayed as rape in selfdefense assange spoke to the facts of the situation \nhere we have a case the swedish case where i have never been charged with a crime where i have already been cleared by the stockholm prosecutor and found to be innocent where the woman herself said that the police made it up where the united nations formally said the whole thing is illegal where the state of ecuador also investigated and found that i should be given asylum those are the facts but what is the rhetoric\n the un formally found that the whole thing is illegal never even mentioning that ecuador made a formal assessment through its formal processes and found that yes i am subject to persecution by the united states\ndisinformation and distraction are among the underhanded tactics of empire\nwhile in britain assange was eventually placed under house arrest sweden played out the drama while refusing to press charges or interview assange in britain on the allegations it insisted he come to sweden which assange was unwilling to do without an assurance that he would not be deported elsewhere knowing full well that the us department of justice was preparing a case against him sweden refused to give such an assurance which speaks strongly about swedens intent to seek justice for any alleged crimes committed against its citizens\ndespite all this intrigue wikileaks has continued to publish and assange has continued to give interviews assange did not cower instead he chose to fight back against hillary clinton and the democrats this is because hillary clinton and the democrats are the principals in power and the grand jury investigation into himself and wikileaks has been occurring during their time in government\nclinton and the democrats are victims of their own zeal and hubris along the way many outs presented themselves to the democrats they could have dropped the grand jury investigation they could have provided an assurance that there would be no request for assanges deportation from sweden the us could even have given a presidential pardon to assange extremely telling about the caliber of man that assange is is that he offered himself as a prisoner in exchange for the release of another political prisoner chelsea manning\nbut empire and its minions were dismissive as is the way of empire empire does not negotiate deals it takes what it wants because it believes it can\nthe result\nthe corruption in the democratic party has come to light wikileaks revealed that the democratic national committee conspired against party aspirant bernie sanders and heads fell clinton tellingly hired the subsequently fallen dnc chair debbie wasserman schultz\nclintons emails were leaked as were those of her campaign chair john podesta revelations include payforplay as they call it giving access in exchange for money to states individuals and corporations a  direct connection between hillary clinton and the foundation of jihadism of isil in the middle east libya more than anyone elses war was hillary clintons war and banks buying cabinet positions\nthe clinton campaign has predictably been thrown into disarray\nthe clintonites could not refute what was in their own emails instead they sought to deflect attention elsewhere the clintonites blamed russian hacking for interfering in the us presidential race finally julian assange felt compelled to state \nthe clinton camp has been able to project that kind of neomccarthy hysteria that russia is responsible for everything hilary clinton stated multiple times falsely that seventeen us intelligence agencies had assessed that russia was the source of our publications that is false we can say that the russian government is not the source\nneither is wikileaks complicit with russia\nwe have published about  documents of various kinds that relate to russia most of those are critical and a great many books have come out of our publications about russia most of which are critical our russiadocuments have gone on to be used in quite a number of court cases refugee cases of people fleeing some kind of claimed political persecution in russia which they use our documents to back up\ngraciously toward clinton assange said he feels sorry for the woman who wanted to  drone  him imagine what the response would have been if assange had discussed the possibility of a drone attack against clinton\npresently assange downplays the damage from the barrage of leaks to the clinton campaign for the presidency\ntrump would not be permitted to win why do i say that because hes had every establishment off side trump doesnt have one establishment maybe with the exception of the evangelicals if you can call them an establishment but banks intelligence agencies arms companies big foreign money  are all united behind hillary clinton and the media as well media owners and even journalists themselves\nhowever a counter coup was announced against the coup by clinton cronyism it is said to include fbi cia military intelligence other security organizations through julian assange that have promised to stop clinton from becoming president and to convict and indict her and her cronies\na revolution\nno matter what transpires on november  the reverberations from this confrontation should be monumental us democracy has  again  been revealed to be glaringly corrupt most importantly the worlds preeminent militaryindustrial complex has been shown to be susceptible to the power of one person properly framed it is the power of one person to work with other persons to form a greater consciousness a consciousness that ultimately will transcend and defeat the corruption of empire", "Dem Rep. Debbie Wasserman-Schultz Pakistani IT staffer Imran Awan was arrested at Dulles airport while trying to flee the United States. Get the back story from Maria Bartiromo:  How is it possible that 3 brothers are hired, Muslim brothers just saying, to work in Congress and deal with our most intelligent and sensitive information, number one?", "New bumper sticker idea:  My inmate is smarter about immigration than your Harvard Business School student A group of New York inmates has toppled Harvard s prestigious debate team.It took place at the Eastern New York Correctional Facility, a maximum-security prison in Napanoch. The Ivy League undergrads were invited last month to debate the inmates who take in-prison courses taught by Bard College faculty.Harvard s team won the national title this year and the world championship in 2014.But the inmates are building a reputation, too.", "The Russians have wanted a puppet in the White House for decades, and now they have one after successfully helping Donald Trump win the election.Last week, the CIA concluded along with over a dozen other intelligence agencies that Russia interfered in the election to get Trump elected. Trump refused to acknowledge that Russia meddled.", "Donald Trump is desperately trying to find A-list entertainers to perform at his inauguration in January. Trump s friend, famed opera singer Andrea Bocelli, backed out of performing at Trump s big event after a backlash ensued.", "Everyone knows that Donald Trump absolutely HATES Melissa McCarthy s portrayal of White House Press Secretary Sean Spicer. Well, this week s edition of SNL certainly will not please The Donald, because McCarthy s  Spicey  came back with a vengeance.The segment opened with Aidy Bryant doing an absolutely PERFECT impression of Sarah Huckabee Sanders, the Deputy Press Secretary and daughter of former Arkansas Governor Mike Huckabee, filling in for Spicer as she has been doing all week since Trump fired FBI Director James Comey and sent Washington reeling once again.", "posted monday october   at pm edt \nlow cholesterol and its consequence \n\npreviously we have seen that cholesterol is a critical element of our cells and tissues  in addition scientific evidence suggests that high cholesterol is not necessarily harmful but offers a protective effect against brain disorders such as alzheimers disease  at this point we should ask the opposite question what about if we have too little cholesterol what are the consequences \n\nwithout cholesterol we would die \nit is well known today that cholesterol performs several important functions in the body one of the best important is not the most important function of cholesterol is to assist the proper regulation of the immune system indeed people who have a low blood cholesterol have an anergic immune system ie a lack of reaction by the bodys defense mechanisms to foreign substances vredevoe et al  in other words your body cannot fight off pathogens such as bacteria viruses parasites and fungi without cholesterol the different cells involved in an immune response such as macrophages lymphocytes etc cannot recognize the invaders and destroy them interestingly it was shown that the ldl particles are the ones needed for an adequate immune response masterjohn  these particles neutralize microbes and toxins before they cause any damage to the tissuesorgans and we call these ldl particles bad cholesterol without them we would be dead another fact is that a low blood cholesterol increases our risks of developing tuberculosis \nmore importantly a sufficient supply of cholesterol to the immune system is critical to eliminate cancer cells indeed cholesterol is needed to slow down the progression of cancer in addition to cholesterol saturated fats like palmitic and myristic acids are also necessary for an optimum immune system these fats are found in tropical oil such as coconut oil would this fact explain why asian people have a lower rate of cancer than north americans \n\nis cholesterol protective not causative of heart disease \nthere is a tremendous amount of evidence to suggest that microbial infections are one of the primary drive force of plaque accumulation in the arteries of the heart   in support of this a lack of buccal hygiene considerably increases your risk of heart disease  some researchers have noticed that people who suffered from a heart attack also had the flu a few days prior   it seems that those microorganisms change the structure of the blood vessels leading to inflammation and an accumulation of plaques at the sites of injury based on this evidence we can propose that cholesterol actually minimizes the risk of developing heart disease via the elimination of dangerous pathogens indeed it seems to be the case  \nit is time to end this war on cholesterol science is very clear cholesterol does not cause heart disease on the contrary cholesterol is a vital element of a vibrant health by making sure the immune system is strong by being a critical component of vitamin d synthesis by helping the body make sex hormones among other functions", "Texas conservatives are cheering after Britain voted to leave the European Union because they believe it means they can secede from the United States.Upon learning of the results, conservatives took to social media to urge Texas to declare independence.Texas should leave the failed American Union & rejoin the world as an independent, self-governing nation. #Texit https://t.co/0esvrO46Ei  Trey Mays (@TreyMays) June 24, 2016 Now, Texas, Louisiana, and Oklahoma secede and form a new country called the United States of Awesome!", "You can t be black and support President Trump. The intolerant left simply won t allow it Boxing legend George Foreman has had about enough of the disrespect of the United States he s seeing in some professional athletes, particularly Colin Kaepernick and Kevin Durant.In an interview on the Offended America Podcast on Monday, the 68-year-old former world heavyweight boxing champion blasted the national anthem protests and shunning of the White House by the likes of Kaepernick and Durant, suggesting they were born out of ignorance about just how privileged we are to live in this great country.As for Durant s announcement that he would not attend the White House if his Golden State Warriors are invited because he doesn t  respect who s in office right now,  Foreman said he and the others protesting Trump were just  sore losers.", "Have you ever noticed how DHS Director Jeh Johnson repeatedly lies or answers questions with very vague answers? I can name numerous times he s given smug and incomplete answers when testifying about immigration and terrorism.", "She s really come undone in this latest interview Hillary Clinton became visibly irritated during an interview with Australian TV when she was asked about Wikileaks  Assange.The interview with local Australian TV has several delusional moments that reveal her continued bitterness and downright psychosis when it comes to the 2016 election loss to Donald Trump. I think Assange has become a nihilistic opportunist who does the bidding of a dictator,  Clinton said, apparently referring to Russia s Vladimir Putin.When the interviewer noted many people view Assange as a  martyr for free speech and freedom of information.", "email \n\ndemocratic vice president joe biden wants american women to get back in the workforce to help boost the economy if we just put all the women back to work if they were able to afford childcare we would increase the gdp in america by close to eight tenths of one percent he said thats trillions of dollars over the next decade \nbiden made his remarks during a campaign event for hillary clinton at chatham university in pittsburgh pennsylvania on tuesday the state of our economy could be characterized by a single word pitiful he argued were still battling recession i dont care what the official stats are saying america is still in recession and were not doing anything about it \nhe added that it was lazy american women who brought about the downfall of the economy because they sit around on their behinds doing nothing and squandering their days away when they could be improving the country that has given so much to them im not sure how exactly we got to this point but were here and we need to move like yesterday he said \nmark my words and mark them well he addressed the crowd hillary clinton is the only one who can force american women to go to work this is true because of a number of reasons first shes a woman herself and not just any woman shes a selfmade woman so you better believe what shes saying is true and has been tried and tested in practice plenty of times \nsecond hillary clinton understands how difficult it can be to give up the status of a freeloader when your husband is the breadwinner of the household and the wife is expected to tend to the house the children make sure dinner is served and always be in the mood for marital duties shes been all that and shes learned how to break free from it the hard way i might add biden continued \ntodays women are pampered and arent used to rolling up their sleeves and getting the job done on their own the vice president said theyre too dependent too weak and too lazy to contribute to the economy the reason for that is theyve learned how to manipulate men by employing one of the most fundamental laws of economics when a soughtafter commodity becomes short in supply the demand for it rises even higher \nnow thats all fine and dandy when it comes to their personal interests but if you look at the big picture its the economy thats missing out on valuable workforce and thats why we need to get them off their lazy behinds and get them into their workplaces and like i said hillary clinton is the only one who can do it which is what makes her the ideal candidate for the next president of the united states we need to heal this country folks not run it into the ground even deeper biden concluded", "As we all know, Donald Trump does not like to read books. Hell, he really doesn t read anything at all unless it s something that strokes his ego.", "A car plowed into a group of counter-protesters at a white nationalist rally in Virginia on Saturday afternoon, news reports said. Several people were reported with injuries from minor to life-threatening.", "The Washington Post reported that higher ups in the State Department jumped ship before Rex Tillerson could take the helm but we don t know that was the case. Were the people who left asked to vacate their post or did they jump ship?", "Joe Scarborough, the former Florida GOP congressman and host of MSNBC s Morning Joe, announced during his appearance on Late Night with Stephen Colbert on Tuesday night that he is leaving the Republican party, stating  I am a Republican, but I m not going to be a Republican anymore. He later said he was going to become an Independent.The announcement comes merely weeks after President Donald Trump launched a scathing Twitter attack against Scarborough and Mika Brzezinski, his Morning Joe co-host, in late June, where the President not only criticized the program s ratings, but referred to Scarborough as a  psycho  and Brzezinski as  low I.Q.", "When you re running for re-election in your toughest campaign yet, in a state with a heavy Hispanic voting population, what s the one thing you shouldn t do? Well, for starters, you shouldn t underestimate the voting bloc that could make or break you.But John McCain doesn t care.", "The political correctness police are apparently more powerful than those who have been trained and dedicate their lives to defending citizens A Roswell police sergeant who was fired from her job this month for flying the Confederate battle flag in front of her house is appealing her termination and said Tuesday she had no idea the flag was controversial.In an interview with The Atlanta Journal-Constitution, former police sergeant Silvia Cotriss said she had been flying the battle flag below the American flag in front of her Woodstock house for more than a year with no complaints from neighbors or passersby. So she was surprised the week of July 11, when detectives with the department s internal affairs division notified her that she was being investigated for conduct unbecoming an officer on or off duty.", "It s starting to get old but Trump was right again   Iranian state-run media in Tehran did indeed videotape the arrival of a January 17 flight carrying $400 million in cash from the United States   and the money itself   judging from a documentary that aired the following month in the Islamic republic. Republican presidential nominee Donald Trump has been in a firestorm of controversy since first claiming on Wednesday to have seen  secret  footage of money being offloaded from an aircraft.He admitted Friday morning on Twitter what his campaign had said more than a day earlier, that he had seen ordinary archival footage of a different plane, carrying American hostages freed from Iran arriving in Geneva Switzerland after the money changed hands.", "CNN Money has released a report saying that Donald Trump violated Fox News  rules during the last Republican primary debate.The claim comes from an unnamed rival campaign. Apparently Trump consulted with his campaign manager, Corey Lewandowski, during Thursday s debate in Detroit.", "WAS IT HILLARY OR THE STATE DEPARTMENT? We know that Cheryl Mills and others at the State Department have been protecting Hillary all along so hopefully we ll get to the bottom of this.", "It s shocking that stalking conservatives to intimidate or harm them is actually happening in 2017. Several instances of stalking and threatening behavior have been reported by conservatives on campus at UC Berkeley.", "Since the Colin Kaepernick and his fellow players started their Black Lives Matter kneeling campaign, social media has been lit up with photos of empty stadiums, proving that fans are not interested in supporting players who disrespect our flag and our law enforcement officers. The photos seem to suggest that every week more and more seats remain empty in NFL stadiums across America.", "One of the Bundy  militiamen  has lost his sole source of income thanks to his decision to join the merry mob of marauding morons in their armed occupation of the Malheur Wildlife Refuge in Oregon. Was he skipping work?", "After the Paris Accord, the United States under Donald Trump is generally seen as the baby in a high chair that s been pulled up to the table at which the adults are sitting   and leaders are more and more willing to openly express that sentiment because at this point any hope that Trump would prove naysayers wrong is out the window at this point.On Sunday, The Donald continued his attempts to harness the London Bridge attack to promote his agenda. While at one point this would have led to condemnation of his words, London s Mayor showed the world that it s time to just stop taking him seriously at all.", "Cliven Bundy and his unstable group of family and followers have been refreshingly quiet in recent months in the aftermath of their ill-conceived hijacking of an Oregon wildlife refuge and subsequent arrests. It s hard to  occupy  anything behind bars except, perhaps, a 6 10 slab of concrete.", "Marlee Matlin may have had no comment on Thursday when it was revealed that Donald Trump called her  retarded  because she is deaf, but she destroyed him on Friday for it. Recent media reports have circulated that Donald Trump allegedly referred to me as  retarded,  the AcademyAward-winning actress wrote on Twitter.", "How elite leftists celebrate America s Independence Day The Kennedy clan gathered at their Hyannis Port compound on Cape Cod over the weekend for their annual Fourth of July festivities, and took some time to attack Donald Trump.Robert F. Kennedy Jr. s daughter Kathleen, between known as Kick, posted a photos of a pinata of The Donald from a family party over the weekend. It s yuge party!,  wrote Kick in the caption of the Instagram post, which also showed some of her family members milling about in the background.She later deleted the Instagram post just before 11am on Monday.Via: Daily Mail", "The crowd went wild when President Trump and the First Lady arrived at the National Guard Armory in Louisiana:FAKE MEDIA BLACKOUT!Louisiana Crowd goes wild & chants USA, USA, USA, when our @POTUS Arrives at National Guard Armory! #Respect     pic.twitter.com/JTCQIiCULs  Amy Mek (@AmyMek) September 3, 2017Don t let the mainstream media fool you!", "Did you know that a record number of illegals crossed our border last month? While we re focusing on the Syrian refugee influx, our southern border is wide open.", "A creationist tried to debate an atheist about evolution and he got owned within seconds.Outside the recently opened Noah s Ark museum in Kentucky, which took $18 million from taxpayers in violation of the separation of church and state, protesters gathered to counter the bullshit creation story that Ken Ham is trying to shove down everyone s throats.Noted atheist Aron Ra joined the protesters and was soon challenged to a debate on evolution by creationist Eric Hovind, a fundamentalist Christian who agrees with Ham that the Earth is only 6,000 years old and that dinosaurs and humans existed at the same time despite all the science that proves otherwise.Conservative  Christians  like Hovind and Ham reject evolution science and advocate for teaching creationism in science class in order to indoctrinate kids into Christianity against their will.But after the way Hovind got his ass handed to him by science during this encounter on Thursday, it s clear why creationism should never be taught in schools. There are hundreds of state-funded museums around the world teaching the religion of evolution,  Hovind whined even though evolution is science, not religion.One protester pointed out that those state-funded museums do not discriminate against against people seeking employment the way the Ark museum discriminates against anyone who isn t a Christian who shares their beliefs.Ra responded by noting that unlike creationism, evolution is  demonstrable verifiable science.", "In a speech at MacDill Air Force Base in Tampa, Florida on Tuesday, President Obama declared that  [n]o foreign terrorist organization has successfully planned and executed an attack on our homeland. The claim earned perfunctory applause, but a closer look at the reaction of many of the servicemen and women there made clear what they really thought about the administration s handling of national security.Obama speaks to our troops at MacDill Air Force Base about foreign terror attacks on our homeland:The President s claim  which he has repeated in some form or fashion over the last few years  is an obvious rhetorical attempt to gloss over the reality of the threat of radical Islamic terror on American soil.", "You can believe that if this incident with Iran kidnapping our sailors had happened under a Republican president, you would be hearing 24/7 about this. I digress, this wouldn t have happened if we had a president who had the least bit of a backbone.", "IF SHE S NOT TOAST NOW THEN WE RE IN BIGGER TROUBLE THAN I THOUGHT. There s so much more to this whole thing and it s just getting worse for Bill and Hill.", "Oh, Donald Trump. The pathological liar has struck again, although everyone should have seen this coming.", "adobochron  comments the trump hotels in las vegas left and doral \ndes moines iowa  the adobo chronicles  since he launched his bid to be the republican nominee for president of the united states donald trump has made many promises but nothing has caught the attention of the media and electorate more than what he said today in iowa on the eve of the first caucus of the  presidential elections season \nif elected president of the united states trump says he will not live in the white house \ninstead the billionaire candidate will establish his own white house outside of washington dc  as a matter of fact two of them  one in florida and another in nevada trumps white house s will be headquartered in the trump hotels in doral and las vegas \nthis will bring the white house  and the president  closer to the people trump declared he also indicated that he will not be using airforce one or marine one rather he said he will be using his own private jet at no cost to the taxpayers \nthe adobo chronicles asked trump what will happen to the media and the white house press corps when he travels across the country or abroad \nwell they just have to book their own commercial flights and follow me around he said \nthousands of miles away in the philippines a leading presidential candidate said that if elected president he will not live in malacañang  the filipino counterpart of the white house  because he likes to sleep in his own bed his bed is in davao city of which he is currently the mayor \nrodrigo duterte said he will commute daily from manila to davao using a private jet of his friend davao is about a hour and fortyfive minutes by plane from manila which is a far way shorter commute than being stuck in daily traffic on metro manilas streets", "Thank God America has people like Ted Cruz in our Senate, who are unafraid speak out against the enemy, and fight for the safety and security of our nation. Now, if we could only get our  Commander in Chief  to accurately identify and confront the enemy America must stand with our allies against the scourge of radical Islamic terrorism.", "A new report from the Missouri Ethics Commission documents 32,128 gifts to state legislators from lobbyists undoubtedly hoping to influence their decisions.The Missouri Ethics Commission collected information on gifts provided to state lawmakers from January 2012 to January of this year. St. Louis Today published a searchable database here.", "Donald Trump posted his most embarrassing attack on the New York Times yet on Friday.Proving once again that he really should think before he tweets, Trump reacted to a New York Times article that accurately reported that he hadn t spoken to Chinese President Xi Jingping since November 14th.Ever since Trump took a phone call from Taiwan, and basically treated Taiwan like a legitimate nation, China has not been happy. It has been American policy for decades that the president does not communicate with Taiwan because China considers Taiwan part of the real China.The  One China Policy  has been a crucial agreement between China and the United States, but Trump blew that all to hell with a single phone call and has been escalating confrontation with China ever since.The New York Times published a story on Thursday before Trump spoke with China s president to end the silence between them.Again, let s be absolutely clear.", "What happens when a black police officer sings the national anthem at a ball park? Is that racist as well?", "Something we keep hearing about Hillary Clinton is that the former Secretary of State is pals with Donald Trump. Of course this line is perpetuated by the fact that Hillary did attend Trump s wedding in 2005.", "Antifa threw fireworks at police during the Patriot Prayer rally at Waterfront Park in Portland, Oregon. The Patriot Prayer rally had to be cancelled because of the Antifa violence.", "Another Republican woman is telling the GOP to go f*ck themselves because they still support Donald Trump.Melissa Gesing had hoped that her party would condemn and drop their endorsement of Donald Trump entirely after audio emerged of the Republican nominee bragging about groping women.But after the national leader of the organization she belongs to announced their continuing support of the admitted serial groper, Gesing reached her breaking point.National Federation of Republican Women President Carrie Almond made a statement reaffirming the group s  unified support of Republican Presidential Nominee Donald J. Trump  because  thousands of women from all 50 states, from every walk of life, are steadfast in our very clear understanding that Hillary Clinton does not represent us; not as women, not as Americans. Well, that s not true at all considering Gesing officially and publicly resigned from her position as the president of the Iowa Federation of Republican Women on Tuesday.", "Former House of Representatives member and Chairman of the House Committee on Oversight and Government Reform Jason Chaffetz (UT-R)  was a guest on the Judge Jeanine show last night. Judge Jeanine started out her segment with Chaffetz talking about how Hillary Clinton and friends keep lying and obfuscating the law.", "On Thursday during a visit to Mexico City, Mexico, Vice President Joe Biden apologized to the citizens of our neighbor to the South for the hateful rhetoric they have been hearing from our nation s Republicans   especially the hate speech coming from Donald Trump s campaign: There has been a lot of damaging and incredibly inaccurate rhetoric and I would argue, I almost feel obliged to apologize for some of what my political colleagues said. It is about Mexico, it is about Mexican people.Biden explained to President Enrique Pe a Nieto that  it s a heated campaign season,  and that Republicans are willing to say pretty much anything to be declared King or Queen of Stupid Mountain as they vie for the GOP nomination.", "David Duke is a former Ku Klux Klan Grand Wizard who also happens to be one of the most famous white supremacists in modern history. He is also, like many white supremacists, anti-semites, and other assorted despicable bigots, a Donald Trump supporter.", "Georgia Marshall has had just about enough of the white privilege performance art masquerading as a patriotic revolt against the tyranny of something something EVIL GUB MINT! Ever since the Bundy terrorists seized a wildlife refuge in Harney County, the entire county has been seriously pissed off at the presumption of these idiots that they speak for the residents.", "adobochron  comment \nsan francisco california  the adobo chronicles san francisco bureau  now it can be told  now that hillary clinton is all but assured of the democratic presidential nomination \nfor months since the former secretary of state launched her presidential bid her campaign logo has always symbolized americas quest to move forward with the arrow in the logo pointing to the right lefthanded people of course dispute that symbolism because for them moving forward should be pointing to the left \nbut there is another school of thought about hillarys logo many believe that the arrow pointing right actually symbolizes moving to the conservative right as opposed to the liberal left \nthe logo was a brilliant concept designed to help the democrats win over republican voters in the general elections  voters who will definitely choose a rightist over a leftist candidate \nthe gops presumptive nominee donald trump is perceived by many as more leftist than rightist which would give clinton the edge among conservative voters \nwho knew the placement or direction of an arrow could spell victory or defeat for an american presidential candidate rate this", "A Leon Circuit Judge in Florida has adopted a map of Florida Senate districts that is a huge win for voter s rights groups and a crushing blow to one of the most heinously corrupt political systems in the country. Florida registered Democrats outnumber Republicans.", "Close your eyes and imagine a white professor telling his students there will be no peace as long as  blackness  exists. Now picture that teacher in the unemployment line with about 100 cameras and reporters around him demanding he apologize for his blatant racism.", "It s a pretty safe bet that the press isn t able to reveal any bad blood between Donald and his second wife or we wouldn t even have to ask,  Whatever happened to Trump s second wife?", "The left is going ballistic over supposed words said by President Trump to a grieving military widow. President Trump made a call to Myeshia Wilson that s been turned into a political football by the left to make Trump out to be  crazy .", "As we get ready for the most bigotry-fueled, racist, misogynistic administration in the modern history of the United States, the Republican Party is already setting its sights on robbing people of their human rights. Knowing full well that President-elect Donald Trump shares their values (or lack of), the GOP has already announced their plan to defund Planned Parenthood, and Democrats across the country are organizing to stop them.Perhaps the most perfect takedown of this plan we ve seen so far comes from New Jersey s Senator Cory Booker, who was a massive supporter of Hillary Clinton during her presidential campaign.", "Facebook CEO Mark Zuckerberg has had about enough of the blatantly racist antics happening right within the walls of the company s Menlo Park, California offices. In an internal memo obtained by Gizmodo, Zuckerberg is outright furious over some employees going to the famous  wall,  where everyone is free to write what they want, and crossing out  Black Lives Matter  to replace it with  All Lives Matter.", "Well, well, well, look what we have here.During his meeting with President Obama, Donald Trump apparently was convinced that repealing Obamacare is probably not a good idea after all.According to the Wall Street Journal, Trump told reporters after the meeting that he may just simply  amend  Obama s signature healthcare law and said he would consider suggestions the president made during their discussion. Either Obamacare will be amended, or repealed and replaced,  Trump said.", "The Clinton camp has been able to project a neo-McCarthyist hysteria that Russia is responsible for everything. Hillary Clinton has stated multiple times, falsely, that 17 US intelligence agencies had assessed that Russia was the source of our publications.", "The media can t seem to get enough of the story of the Texas mother who killed her two daughters and was then shot and killed by local police. Of course, there hasn t been any inquiry into the possible wrongful actions by the law enforcement officer who killed her by the cop-hating Black Lives Matter group.", "On Thursday, Donald Trump tweeted that if China, North Korea s sole major ally, doesn t deal with North Korea  properly,  the United States and  its allies  will. Now China is neither an ally or enemy of the United States , but they are a major power with around 300 nuclear warheads and the largest army in the world  a fact many of our allies would consider before backing us in any war that might involve them.", "email \n\nhillary clinton personally ordered a consultant to use a nonprofit group to troll the trump campaign with a donald duck mascot according to the democratic operatives who say they arranged it with a nonprofit organization \nwhen breitbart news washington political editor matthew boyle confronted mook about creamer and his firm in the spin room after the third presidential debate mook claimed theyve never worked for our campaign when asked if clinton had ever discussed the controversial political operations with creamer directly mook replied i dont think so \nnow however okeefe and project veritas have released video of creamer claiming that clinton directly approved one of his more bizarre plans  an effort to attract media attention and incite violence by dressing an activist in a donald duck costume and sending that activist into trump events emphasizing the argument that trump was ducking releasing his tax returns \nthe action if true would be a blackletter violation of federal election law which prohibits presidential campaigns from coordinating activities with outside groups that can collect unlimited dark money from contributors  and dont pay taxes on what they collect \nproject veritas action video footage shows robert creamer a convicted felon who was forced out of his executive role at the liberal consultancy democracy partners saying clinton chose the duck stunt \nin the end it was the candidate hillary clinton the future president of the united states who wanted ducks on the ground so by god we would get ducks on the ground creamer says in the video", "Ben Shapiro makes the best case yet for why Americans should support Kim Davis who s in jail for refusing to give out same-sex marriage licenses:  Her arrest represents tyranny   not because there is no legal authority to arrest, or because freedom of religion trumps rule of law, but because selective use of legal authority is tyranny. As of Friday morning, Kentucky county clerk Kim Davis sits in jail for her refusal to hand out state licenses for same-sex marriages.", "One of our biggest concerns is that so many Americans don t realize the magnitude of just how much our nation is in deep trouble. With the election of Trump, the  shadowy foes  have been coming out and showing themselves to attack Trump.", "Donald Trump continues to embarrass himself in a desperate effort to prove that he s a job creator.In yet another self-serving and self-promoting post on Twitter, Trump crowed about an announcement made by Ford Motor Company that it is investing $1.2 billion in three automotive plants in Michigan that will keep and create jobs.Big announcement by Ford today. Major investment to be made in three Michigan plants.", "When you re accused of being racist, as the Trump campaign is, because they are, it s probably best to show some people of color modeling your campaign gear. However, when all you have is a stock photo of a white model to work with, there s apparently only one thing to do   photoshop.On Twitter, Eric Ming, digital director for Donna Edwards, pointed out that Trump s campaign appeared to photoshop a model to be darker than she actually is:So it appears Donald Trump s campaign photoshopped their model to be brown: pic.twitter.com/V0DghCiQAW  Eric Ming (@ericming5) March 3, 2016It looks as though since the Trump campaign likely has a difficult time finding people of color to support the candidate, they ve resorted to literally making them up.Here s the original model:Generic gray shirt from jcgapparel.comNow, here is that same model on Trump s campaign website on August 9th of last year already appearing a bit darker:via donaldjtrump.comClearly not satisfied with making her only slightly darker, the Trump campaign turned her into full Trump orange as only they can.", "Americans have been spending well over $2 trillion on Christmas since at least 2000, with that number topping $3 trillion in recent years. But if you ask Donald Trump, Americans  rather typical spending this year is all thanks to him.Seriously   he took credit for Christmas.The world was gloomy before I won   there was no hope.", "Sometime around 2:00 am on July 17, a man armed with a handgun entered Parrish Medical Center, located in Titusville, Florida. He opened fire, killing one elderly patient and a hospital employee who was in the same room.As soon as they heard the sound of gunfire, two unarmed security guards reacted.", "oped by laraine c abbey president obamas statement giving up some freedom in exchange for security  was a lance through my heart give up", "Only days after the worst mass shooting in the nation s history happened against the LGBT community, the GOP decided they could go back to being discriminatory.One would think they d wait at least a week, but apparently three days seemed long enough to mourn the loss of those who perished at Pulse nightclub in Orlando, Florida, because according to Vanity Fair:Republican leaders in the House of Representatives blocked a vote on a proposal that would ensure federal contractors can t discriminate against employees on the basis of sexual orientation or gender identification.That s right, you read that correctly, they seem to think it s perfectly acceptable for federal contractors to be able to fire someone for being gay.According to The Hill:Rep. Sean Patrick Maloney (D-N.Y.), who is gay, filed an amendment to a Defense Department spending bill that would enforce a 2014 executive order prohibiting discrimination against LGBT people.Yet, the House Rules Committee didn t see it worthy of consideration and wouldn t even allow it to be voted upon. Nope, not even a vote.", "President Trump just made an 11-year old boy s wish come true but the left is in a tizzy over it. Frank Giaccio wrote to the president offering to cut the White House lawn.", "The fundamental transformation of America: Watch Obama and the Democrat party beg tens of millions of people who broke the law when they entered our country to get to the polls to shape the future of our nation Leticia de la Paz s family has two major motivations for pursuing U.S. citizenship.They want to move past the discrimination they feel as foreign-born residents, and they want to take part in choosing a leader who, as de la Paz says,  will care about immigrants and a better future. She shares these sentiments through a Spanish-language interpreter, as her 25-year-old daughter, Gabriela, works through a crowded room at Nashville s Global Mall where dozens of Middle Tennessee immigrants are completing the paperwork that will put them on the path to naturalization.", "Chelsea Clinton thought she was quite clever when she cited the  story of Lucifer  to support her argument for removing confederate statues. What is it about the Clinton s citing anything to do with faith to support their argument that makes everyone cringe?The story of Lucifer-who rebelled against God-is part of many Christians' traditions.", "In his current position of having a historically low approval rating and a running track record of multiple colossal failures, one would think that Donald Trump is in NO position to be criticizing others and judging his more successful predecessors on how they handled business before him. However, this didn t stop him from trying to throw former president Barack Obama under the bus last night as he tried to distract America from focusing on his Russia scandal and the shortcomings of his administration.On Wednesday night, Trump retweeted two tweets that blamed Obama for the current North Korean crisis, which Trump has recently f*cked up beyond belief by threatening the regime with nuclear attacks.", "This story just keeps unraveling Two days ago, conservative Thomas Wictor dropped a bombshell on Twitter, exposing what he suggested was a forged Roy Moore signature on the yearbook that allegedly belongs to Beverly Young Nelson, the most recent sexual misconduct accuser of GOP Senate candidate Roy Moore.CNN published a story about Roy Moore signing Nelson s yearbook. Thomas Wictor dissected the signature and the validity of her story on Twitter:Beverly Young Nelson said Alabama GOP Senate candidate Roy Moore wrote a message in her yearbook in December 1977 that said, \"To a sweeter more beautiful girl, I could not say, 'Merry Christmas.", "Two nights ago, Mark Levin dropped a bombshell on his show about the Muslim terrorist who killed 9 people in Manhattan and injured dozens. The Diversity VISA immigration program that allowed the Muslim terrorist, and 23 people who were tied to his lottery draw from Uzbekistan to live in the United States, was given the brainchild of none other than New York s own Democrat senator, Chuck Schumer.Mark Levin; NYC muslim terrorist came to US under  Diversity VISA Program    a bizarre lottery to shove more foreigners down our throats  Deplorable MD   (@MDDeplorable) October 31, 2017Numbers USA breaks down Senator Chuck Schumer s Diversity Visa immigration program: The Irish Immigration Reform Movement (IIRM) began working directly with Rep. Charles Schumer (D-N.Y.) and his staff to draft a diversity program that differed significantly from those considered up to that point.", "farm owner arrested for protesting dakota access pipelines theft of her land \n  vicki batts tags eminent domain  dakota access pipeline  civil liberties naturalnews there have been countless stories across the web that have documented those struggling to fight against the dakota access pipeline native americans farmers ranchers landowners and environmental activists have joined together to oppose the pipeline and bring the project to a grinding haltjust recently  native american activists were arrested at a construction site near the standing rock sioux reservation in north dakota despite the corporate medias attempts to suppress information surrounding the controversial pipeline concerns about the dakota access project have become increasingly visiblehowever one issue has remained in the dark the governments abuse of eminent domaineminent domain is what gives the government the right to seize private lawabiding citizens properties for public use normally this means a road a school or another public structure that will be used by the citizens of a town or which in some way serves them however the government can also seize private land if they can prove that it will provide some sort of public good this loophole  and yes it is a loophole  has allowed our government to steal land from taxpayers for years and then give it to a private citizen or company such is the case with the dakota access pipelinethis pipeline is not a public project it is being conducted by a private company that will profit off their endeavors and yet in spite of all the land that will be destroyed and the people whose lives will be disrupted by this project the government has still seen fit to steal land and give it to the pipelines creators under the guise of public goodin iowa a major conflict between farmers and the government has broken out you see the state government is trying to take their land and consequently their livelihoods to make way for the pipeline the states decision to hand over land owned by farmers to the dakota access llc has been met with quite a lot of opposition  as it should have just last week calhoun county farmer cyndy coppola was arrested on her own property for protesting the governments usurpation of her own land apparently they expected farmers to idly sit back and watch them steal what they worked so hard forcyndy coppolas arrest has been ignored by the mainstream media probably because it doesnt align with their narrative that big government knows best an injurious move at best her arrest highlights everything wrong with the way our government is being runthe theft of privately owned land simply cannot be ignored any longer  it is unconstitutional for the government to give a taxpaying citizens land to a multibillion dollar energy company so that they can make even more money and it wont just be the oil and gas companies that profit off this disgusting display of government dozens of big banks and investment firms will also be taking home a piece of the pie food and water watch reported in september than  financial institutions loaned dakota access llc a whopping  billion to launch their project they noted that banks have also given a substantial number of resources to the energy transfer family of companies such as billiondollar credit lines and revolving credits in total a staggering  banks have given this corporation over  billion in loans and creditshow many of those banks do you think have ties to our government goldman sachs is on the list as are several other infamous industry namesif you think the pipeline is being constructed to better our country youre wrong its being constructed to make money for a group of elitist corporations  and they plan on taking down anyone and anything that stands in their way sources", "racist drivel", "Several top Republicans have yet to endorse Donald Trump as the GOP presidential nominee. On Sunday, Republican National Committee chair Reince Priebus had some strong words for those individuals.", "Hillary Clinton has had it with Donald Trump s rude, offensive supporters and the numerous intimidation tactics they try to use against her and the rest of the country.On Tuesday night, Clinton was holding a rally at Reverend Samuel Delevoe Memorial Park in Fort Lauderdale when a Trump supporter shouted,  Bill Clinton is a rapist! over and over, disrupting her speech.", "American citizens should be more concerned about the Left and the leftist media s attempt to HIDE the brutal truth about Sharia in America, than a billboard that gives readers an opportunity to learn the truth.In a state that doesn t tolerate any discussion of what the massive influx of Somali refugees has done to their neighborhoods and schools, this billboard will likely be a hot topic in Minnesota. Recently, the Minnesota Governor told his constituents to  Leave the state  if they don t like the massive influx off Muslims.", "Michael Moore seems to think that socialism is better than capitalism He Tweeted out last night that socialism is about  fairness", "Table set for thanksgiving in Siem Reap. (Photo: Andre Vltchek)Andre Vltchek NEOA table was set up for two, an advertisement table, a table with a photo of a giant turkey, two elegant plates, and a U.S. flag sticking out into the air.", "9-11 is a distant memory for liberals George Washington University has hired a former Islamic extremist to work at its center on homeland security   a man who once denounced the United States and made threats against the creators of the TV series  South Park  for depicting the Prophet Muhammad in a bear suit.While reformed extremists have worked at universities in Europe to help fight terrorism, this is believed to be a first in the United States.Jesse Morton, who was known as Younus Abdullah Muhammad when he was a recruiter for the al-Qaeda, brings a  unique perspective  to counter-terrorism work, said Seamus Hughes, deputy director of the Program on Extremism at George Washington University s Center for Cyber & Homeland Security .Watch Younus Abdullah Muhammad here:During his days as an extremist, Morton earned a master s degree in international affairs from Columbia University.Hughes said before making the hiring decision, he discussed Morton with the FBI, leaders in the security community and the lawyers that prosecuted Morton.He said he s sure Morton is completely reformed from the days he served time in federal prison after inciting people to join a terrorist organization. I trust him,  he said.", "It would be a great sight to behold if a New York City police officer were ordered to place Donald Trump in handcuffs. People would cheer.And it could happen if New York State Attorney General Eric Schneiderman has enough evidence to charge Trump with crimes related to his fraudulent  charity.", "Jedediah Bila is at most, a lukewarm conservative. She s a hardcore Trump hater, so the show gave her a little leeway when it came to expressing her lukewarm conservative views.", "Today s testimony between AG Sessions and Senators went from testy to hysterical when Senator Tom Cotton went into a really funny line of a combined statement with questions He started pointing out there s no evidence and then went through spy novel names then this:  Have you ever in any of these fantastical situations  Great stuff!Senator Cotton:  Let s turn to the potential crimes that we know have happened leaks of certain information. Here s a short list of what I have The contents of alleged transcripts of conversations between Mr. Flynn and Mr. Kislyak.The contents of President Trump s phone calls of Australian and Mexican leaders.The contents of Mr. Trump s meetings with the Russian Foreign Minister and Ambassador.", ". @Judgenap: Samsung allowed British intelligence to spy on Americans through their televisions pic.twitter.com/kHkNt0s8Ar  FOX & friends (@foxandfriends) March 9, 2017", "Fox News and Republican front-runner Donald Trump have been in a strange power struggle ever since Trump decided to boycott the network s Thursday night GOP debate because the business mogul can t stand to be in the same room as Fox host and debate moderator Megyn Kelly.Clearly shaken up since Kelly got the best of him the first time she moderated the Republican debate, Trump has decided to make the GOP lineup look like even more of a circus by skipping the debate. So far the network is standing by Kelly, stating that it wouldn t give into  terrorizations toward any of our employees.", "During a recent appearance on Good Morning Britain, Donald Trump made several claims about Muslims that are, perhaps unsurprisingly to most people, completely bogus. During the interview, Trump claimed that one of the biggest challenges in the fight against terrorism is that  good  Muslims are withholding information about terrorist plots.", "Daily Shooter 21st Century WireJust as ISIS is being routed in Deir Ezzor, Syria, and soon out of Raqqa, and driven from its remaining strongholds in Iraq   we discover how the US government has been busy keeping the organization thriving within its own shores.What you are about to read is simply breathtaking, but should be of no surprise to our readers. These new court findings reaffirms much of what 21WIRE and the Daily Shooter column have been reporting for the last five years   that the FBI is responsible for the majority of so-called  terrorist  attacks in the US.According to a new legal case filed against the FBI, court filings have revealed how the agency allowed an alleged  home grown  ISIS attack to take place in Garland, Texas on May 4, 2015. International criminal lawyer Jennifer Breedon shows the FBI was complicit in the attack, and even enticed the two terrorists to carry out the attack, and where agents had  pretended to be ISIS  in order to keep their entrapment operation going.", "Rep. Maxine Waters (D., Calif.) Monday accused President Donald Trump of having a tendency to target women and people of color for his ire.Waters spoke uninterrupted for almost four minutes on MSNBC s  The Beat  about the Trump Administration s handling of the aftermath of Army Sgt. La David Johnson s death in Niger.", "this is how it works in the clinton cabalor is it the mainstream mafia  qatar supports isis just by the way  qatar wants to buy advanced us missile defence systems apache attack helicopters and other military materiel  ratheon a big defence contractor wants to sell said us military goods to qatar  these kinds of foreign military sales have to be approved by the state department  hillary becomes secretary of state  hillary has a charitable foundation  hillary has a former potus as her spouse  hillary has a network of aides confidants bundlers and fundraisers at her beck and call all part of the clinton organized crime family  john podesta at that timeyeah the same john podesta who is having all of his emails released right now held dual titles at the state department as a senior advisor and as a member of a foreign policy advisory board secretary clinton created  ratheon hires john podestas sisterinlaw heather podesta along with john merrigan and matt bernstein both major donors or bundlers to hillary clintons  and  campaigns this guaranteed them access to hillary clinton  qatar meanwhile donated millions to the clinton foundation they hired bill clinton to make  speeches that paid him between  and  million dollars they gave slick willy another  million as a birthday giftaaahhh isnt that sweet  the  billion dollar sale from ratheon to qatar waswait for it  approved by hillary clinton yeah  heather podesta john merrigan and matt berstein were paid  in lobbying fees by ratheon  hillary clinton left the state department  ratheon released podesta merrigan and bernsteinas they no longer had direct and personal access to the secretary of state this is how it is done folks this is payforplay the isis supporting nation of qatar gets advanced us military gear the clintons the podestas and assorted others in the clinton crime family get richer there are still a lot of americans who need to wake up pay attention and then make the right decision on november th", "For months now, Republicans and some in the Bernie Sanders camp have been looking for a smoking gun; a damning piece of evidence that proves, without a shadow of a doubt, that Hillary Clinton is cheating. The YouTube channel, SourceFed, thought they found the smoking gun, when they demonstrated what they thought was irrefutable proof that Google was in the tank for Hillary Clinton.", "analyst most americans like neither candidate  \npress tv us democratic presidential candidate hillary clintons unpopularity among american voters has reached a new high according to recent polls putting her on par with her republican rival donald trump \naccording to the final preelection new york timescbs news poll released on thursday an overwhelming majority of american voters are disgusted by the state of us politics and most view trump and clinton as dishonest \nmore than  percent of voters say the presidential campaign has left them repulsed rather than excited the poll found \nhaving the two most hated politicians running for president of the us representing the two largest political parties has made a mockery of our democracy and electoral process hoenig told press tv on friday \nhillary clinton lied and stole her way to the nomination for the democrats and trump bullied his way by insulting every interest group in america including his fellow republican opponents he added \nfor the third parties we have gary johnson of the libertarian party who has been made a laughing stock for his ignorance of foreign policy his poll numbers are dropping the other rd party candidate is jill stein of the green party who is seeing an actual rise in her numbers in spite of lies and smears coming from mostly the democrats with assistance from the main stream media he said \nthat the race is tightening is no surprise it often happens at this time but the reasons now are not because people are becoming more assured of who they want but more and more disgusted in the choices they have he stated \nregardless of who wins and its most probable that itll be either clinton or trump this countrys nightmare will only begin on jan st the day after the inauguration if its clinton one wouldnt be surprised if the ink on the articles of impeachment isnt already dried by then its possible that criminal charges will have been presented to her or that she had received by then a presidential pardon from the outgoing president obama the analyst noted \npresident ford once said when he was a leader in the house of representatives that impeachment is for whatever the congress wants it to be simply the whiff of impropriety or criminal behavior would make any partisan congressman see that as reason enough for such an article of impeachment compound that with an actual indictment and its guaranteed he said \nthe commentator said trump has a different set of problems if he were to be inaugurated in january his positions are so outlandish that even his own party which by and large has rejected him would pounce on anything he does that would jeopardize their chances as a party and individually in the next offyear elections of  \nwe have to look inward as to what kind of nation we are that we have degenerated to the point where a majority of americans want neither candidate to win he said in his concluding remarks", "This Supercut of Hillary vs Comey gets to the heart of why she should be indicted!", "Fox News found themselves in a really uncomfortable position on Friday because of Donald Trump s gullibility.During a Fox News broadcast on Tuesday, Andrew Napolitano attempted to defend Trump s continuing insistence that President Obama wiretapped him by accusing the British intelligence agency GCHQ of wiretapping Trump after being ordered to do so by Obama.Just like Trump s original accusation, Napolitano s accusation was just as wild and baseless. Yet, White House mouthpiece Sean Spicer repeated it as gospel without providing any evidence to back up the claim.In a rare statement issued by the GCHQ, the agency angrily refuted the accusation.", "The rumors that Hillary Clinton is sick have been flying around the right as conservatives desperately search for any way possible to take her down and elevate the disaster that is Donald Trump. Even Katrina Pierson tried to claim that Hillary has a  rare brain disease  with no evidence whatsoever.", "There s not much to say here. GIPHY killed it with this one: When someone goes on a rant but you have receipts.", "A post on Reddit citing an investigative journalist reads as follows:  RED ALERT! JIM STONE DISCOVERS SOROS BOT FUNDING JILL STEIN S RECOUNT CAMPAIGN AT RATE OF $160,000/HOUR!!!!", "This isn t going to end well for Germany A hospital in Sigmaringen, Germany has been forced to hire security guards after numerous incidents in which migrants physically attacked nurses while they were receiving free healthcare.Schw bische.de reports that the SRH Hospital in Sigmaringen took the precaution after 40 attacks on nurses in September alone, with nursing manager Silvia St rk revealing that staff were  totally distressed  by the onslaught of verbal and physical abuse. St rk said that refugees were biting and spitting at nurses, with drunk migrants behaving particularly aggressively towards female nurses during night time hours.", "Sean Spicer got off to a bit of a rocky start as White House press secretary on Saturday when he embarrassed himself, his President, his country, and pretty much anyone who has so much as heard of the United States, with his trainwreck of a press briefing. Spicer chose to kick off his new, exciting, and likely short career by focusing on the issues that matter the most   like Trump s crowd size.Despite a turnout that was dwarfed many times over by a stampede of Nasty Women descending on Washington D.C. to tell Trump to go f*ck himself, Spicer claimed that This was the largest audience to witness an inauguration.", "A major bipartisan infrastructure bill has gone through the House, and it proved that House Republicans don t care all that much about  buy American  (just like their lord and savior, King Cheeto). The bill, which would have permanently required all piping for water infrastructure projects receiving federal funding to be made in the U.S., has sadly been watered down to a single year.Why is this?", "Jared Kushner, senior White House adviser and son-in-law of President Donald Trump, was interviewed by special counsel Robert Mueller s office at the beginning of November, according to a source familiar with the process. As part of an interview that lasted approximately 90 minutes, Kushner was quizzed mainly on his interactions, meetings, and any general contact he had with former national security adviser Michael Flynn, as well as his son, in regards to Flynn s private business dealings with his firm, Flynn Intel Group.", "Shawn Helton  21st Century Wire JFK FILES    Conspiracy still shrouds the JFK assassination. (Photo Illustration Shawn Helton)The assassination of US President John F. Kennedy, is one of the most infamous crimes of the 20th century.", "Today s act of terror against a GOP Congressional baseball team by a Bernie Sanders supporter was about as ugly and hateful as anyone could imagine. But no one should be surprised by this violent act, given how many leaders in the Democrat Party have been calling for violence against anyone who disagrees with their radical progressive agenda, starting with our former president and community organizer, Barack Obama.", "According to a new report from a combined 13 federal agencies, not yet made public, even if the entire world stopped emitting greenhouse gases right this instant, we would still feel half a degree warmer on average over the next hundred years from the average today.That s the primary conclusion of the report, obtained by the New York Times, that is sitting in limbo awaiting Trump s approval for release. One contributor to the findings, speaking anonymously, said that he and many of the scientists involved in its production are concerned that the Trump administration will suppress it.That would be no surprise: Donald Trump made it a cornerstone of his candidacy   and a primary point of his presidency   to deny the effects of global warming.", "A painting on display at a University of Alaska Anchorage art gallery, which depicts the severed head of President Donald Trump, is sparking debate about free speech rights and whether the image is appropriate for display, at a public institution.The artwork, created by Assistant Professor of Painting Thomas Chung, is part of a faculty art exhibition, at the UAA Fine Arts building.In describing his painting, Chung said,  It s an image of the actor who plays Captain America, and two eagles are sort of screaming into his ears, and he s holding the severed head of Trump, and there s a young Hillary Clinton clinging to his leg. I was reminded of those 80 s rock posters, where there s a woman in tattered clothes clinging to a strong male hero s leg.", "Donald Trump has claimed since he launched his presidential campaign to be worth at least $10 billion. He has not offered any proof of this, and has not given any evidence that the $10 billion figure is anything but a completely made up figment of his imagination.Now, a smoking gun document has been found that shows Trump to be far less wealthy than $10 billion, and it comes from Trump himself.In the document, which concerned the securitization of commercial mortgages on properties including Trump Tower in New York City, Trump was described as being worth more than $4.2bn, with liquid assets of more than $250m.A passage in the 132-page filing says:  The sponsor is Donald J Trump.", "Is Disney officially admitting they re in the business of indoctrinating our children to become good little progressives? For anyone who says this book has nothing to do with Disney or their philosophy, Disney Publishing Worldwide s company overview claims to publish books that are  in support of the franchises :Disney Publishing Worldwide, Inc. publishes children s books, comics, and magazines.", "Welcoming a pro-life, pro-marriage leader at the White House with a crowd of abortion and gay rights activists, is as classy as hosting an Alcoholics Anonymous meeting with an open bar. Mike Huckabee said Tuesday that Barack Obama  pretends to be a Christian,  after the president s guest list for Pope Francis  White House welcome ceremony included a short list of Catholics and other Christians who haev visibly parted with Church doctrine.", "John Oliver absolutely humiliated Mitch McConnell and the GOP for vowing to block any Supreme Court nominee picked by President Obama.During his show on Sunday, Oliver had wanted to recap the last three months he has missed since going on break, but due to the unexpected death of Justice Antonin Scalia he changed the plan and focused instead on how Republicans vowed to obstruct President Obama from filling Scalia s empty seat on the bench.Indeed, Scalia s body wasn t even cold yet before Republicans declared their willingness to desecrate the Constitution he loved so much, and Oliver ripped them apart for it. There is now a huge vacancy on the Supreme Court that needs to be filled, or if you listened to the Republicans in the last 24 hours   not,  Oliver began before showing a clip of Donald Trump telling Senate Majority Leader Mitch McConnell to  delay, delay, delay  until a new president can fill the seat in 2017.", "Marco Rubio, the latest victim of the Trump train that has wreacked havoc on the Republican Party, has bowed out of the race for the nomination after getting destroyed in Florida, becoming the latest victim in a long line of Republican candidates that has now trickled down to just three. Stephen Colbert bid farewell to Rubio with an epic sendoff, putting together a compilation of absurdities committed by Rubio throughout his campaign for the presidency.", "Authorities have released the identities of nine men who were arrested on April 23 during a clash between about a dozen white supremacist demonstrators, a group of counter-protesters and police in Stone Mountain, Georgia.According to WXIA, chaos broke out after a  pro-white  organization planned a rally at Stone Mountain Park on Saturday. The white supremacist group  Rock Stone Mountain  organized the demonstration to protest what they claim are  efforts to erase the white race.", "Tune in to the Alternate Current Radio Network (ACR) for this week s broadcast of The Boiler Room . Join us for uncensored, uninterruptible talk radio, custom-made for barfly philosophers, misguided moralists, masochists, street corner evangelists, media-maniacs, savants, political animals and otherwise lovable rascals.Join ACR hosts Hesher and Spore alongside Patrick Henningsen, Editor of 21WIRE, Daniel Spaulding from Soul of the East, FunkSoul (21WIRE & ACR contributor) and Randy J (21WIRE & ACR contributor), for the hundred and twenty-third episode of BOILER ROOM.", "In a meeting about  party unity,  Donald Trump had trouble holding his tongue (no surprise there) toward Senate Republicans who haven t always had the most flattering things to say about the GOP frontrunner. He threatened three of them with making sure none are reelected.Trump is famously very thin-skinned.", "Watch the fascinating analysis of Rice s body language here:The latest news from The Daily Caller proves that Susan Rice was lying in her PBS interview:Former President Barack Obama s national security adviser Susan Rice ordered U.S. spy agencies to produce  detailed spreadsheets  of legal phone calls involving Donald Trump and his aides when he was running for president, according to former U.S. Attorney Joseph diGenova. What was produced by the intelligence community at the request of Ms. Rice were detailed spreadsheets of intercepted phone calls with unmasked Trump associates in perfectly legal conversations with individuals,  diGenova told The Daily Caller News Foundation Investigative Group Monday.", "Nothing to see here. Just keep flying them in, our FREE tax-payer funded Healthcare system will take care of them at least the ones who are willing to submit to the rigorous treatments required to cure the dangerous disease TB is an airborne infectious disease caused by bacteria that spreads through the air, person to person, when someone coughs or sneezes.", "Following the situation in Charlottesville, Trump was one of the very few people to call out all sides for displays of violence and bigotry: white supremacists, black supremacists, Communists, and Antifa. In short, this flurry of frustration was far from one-sided.Amidst all of the chaos, David Duke tried to link Trump to the bigotry and violence that was present in Charlottesville.", "The presidents of Nordstrom sent an email criticizing President Donald Trump s ban on immigrants from seven Muslim-majority nations entering the United States just days before the retail giant dropped Ivanka Trump s clothing line:In the note, brothers Peter, Erik, and Blake Nordstrom told employees of the company that they would do all they could to help those who might be impacted by the ban while celebrating the many things the immigrant community have contributed to the retailer over the years.The Nordstrom brothers also pointed out that the company was founded by an immigrants, their great grandfather John.Two days later, the Seattle-based retailer announced that they would no longer be carrying Ivanka Trump s line of clothing, handbags, shoes and accessories. Read more: Daily MailThe left had also organized an effort to harm the Ivanka Trump brand months ago by pushing retailers to drop her.", "Bill Clinton was in Philly today and got swamped by protesters holding signs about Black Lives Matter or Benghazi. It was ugly but what was even worse is Bill decided to give the BLM protesters a dose of truth.", "Donald Trump s candidacy has been very concerning to experts and leaders on national security. His erratic and aggressive philosophies on war and security would likely get thousands of Americans and others killed, while destabilizing the world and making the entire planet less safe.To address those concerns, a new ad has been produced by the veterans group VoteVets starring Major General Paul D. Eaton highlighting why he cannot support Trump for president.Referencing his father s military service, and the men and women who served under them during his time in the military, General Eaton says,  for all of them, and for our country, I cannot support Donald Trump.", "No wonder Donald Trump is accusing everything of being rigged   the polls are no longer showing Trump  beating  Hillary Clinton. Some polls have her six points ahead, some seven, some as high as fifteen.But a new poll from the conservative Fox News shows a very telling attitude in the public s shift towards Hillary Clinton.", "Got News-  New York Times Mexican telecom mogul Carlos Slim s blogger Michael Schmidt told professional liar Brian Williams that he hadn t seen the memos that James Comey allegedly wrote. Someone that had seen them recounted details to me,  Schmidt said in what is a breach of journalistic protocol.Schmidt has been called out for getting a story wildly wrong before thanks to his anonymous sources.", "They laughed at us when we said @realDonaldTrump would win This morning they're too devastated to get out of bed.#MAGA #TrumpTrain pic.twitter.com/A0xApdid7K  Harlan Z. Hill (@Harlan) November 9, 2016", "Ohio Governor John Kasich has had a pretty difficult time getting his message out during the Republican race for the White House. Many of us assumed it was because he is being overshadowed by Trump and Cruz, but apparently this is a problem that he is facing in his own state as well   and it is quite embarrassing.Last week, the governor gave his annual State of the State Address and laid out his plans for the state.", "Aww Poor @CNN   Payback s a bitch  commentary by @TeamCavuto pic.twitter.com/e2mi1ncGZZ  Boston Bobblehead (@DBloom451) January 13, 2017", "On Independence Day, National Public Radio tweeted the entire Declaration of Independence to accompany their annual reading of the most important document in our nation s history.In Congress, July 4, 1776. NPR (@NPR) July 4, 2017The unanimous Declaration of the thirteen united States of America,  NPR (@NPR) July 4, 2017When in the Course of human events,  NPR (@NPR) July 4, 2017it becomes necessary for one people to dissolve the political bands which have connected them with another,  NPR (@NPR) July 4, 2017and to assume among the powers of the earth,  NPR (@NPR) July 4, 2017the separate and equal station to which the Laws of Nature and of Nature s God entitle them,  NPR (@NPR) July 4, 2017a decent respect to the opinions of mankind requires that they should declare the causes which impel them to the separation.", "Every website has a 404 page that you land on if you type in the wrong address. They re usually generic with a big  404  to let you know the error of your typing, but some websites like to be clever and let you know you re not where you re supposed to be by making a funny 404 landing page.One of those websites happens to be HillaryClinton.com.If you accidentally type in the wrong web address while looking for something on Hillary s website, you ll be taken to a page that asks: Trying to get where you want to go?", "Pastor Stephen L. Anderson of Faithful Word Baptist Church in Tempe, Arizona, is a terrible human being. In 2014, he made the case that AIDS can be eliminated if we just wiped all the  f*ggots  off the face of the planet.", "Rudy is the best! He stays on message and was there when the Trump speech and comment happened.", "Wow! America is hungry for a real leader.", "College is the time to dream. For many, it s also the time to party.", "On August 15, 2017, Jim Murren, CEO of MGM which owns Mandalay Bay Casino and Resort, came out with a bold statement of support for Hillary Clinton s presidential campaign: As a lifelong registered Republican, I ve crossed the aisle only a few times in elections past, and almost never at the presidential level. Each time, it was a gut-wrenching decision.But this year it s an easy choice.", "The Russian attacks on our election were far more widespread than previously thought. Recently, a woman by the name of Reality Winner was arrested for leaking classified information related to Kremlin hacking of multiple states  election systems.", "Can you believe a first grader was  investigated  for whether she intentionally  misgendered   a fellow student who decided to identify from a boy to a girl? This is just too much for a young child to process.", "Last night, at the birthplace of free speech, we watched as rioters took to the campus of Berkeley College to shut down the free speech of gay conservative Milo Yiannopoulos. The speech was scheduled in advance, and police were aware that angry Democratic Party supporters and anarchists were likely to cause chaos and threaten the security of students who attended the event, as well as the guest speaker.", "21st Century Wire says Trump claims that after suspicions that US Intelligence services were leaking information from classified meetings he was having with them, that he conducted his own sting operation to prove this was happening. I think it s pretty sad when intelligence reports get leaked out to the press.", "It s now no surprise that Donald Trump, the most hated presidential candidate in the field, is the GOP s frontrunner. It seems being hated is all the Republican Party is good for these days.And there s even better news for Democrats!A new poll from the Pew Research Center shows that the GOP is overwhelmingly hated by the American public and has reached its highest level of disdain since 1992.", "top university stole millions from taxpayers by faking global warming research \n  j d heyes naturalnews the global warmingclimate change charade is bad enough in that it is nothing more than a politically motivated issue used by globalists of all political stripes to gain more control over the worlds populationbut now its costing some citizens scarce tax dollarsas reported by the daily caller  a top university in britain has been caught stealing millions of taxpayer dollars from a federal budget that is chronically in the red just to produce phony global warming data a global warming research center at the london school of economics received millions of dollars pounds from uk taxpayers after taking credit for research it did not performthe uks daily mail noted further that the uk government provided  million  million in us dollars in funding to the centre for climate change economics and policy cccep in exchange for research that was never done massive scientific fraud regarding global warming a number of papers that cccep claimed to have published to receive government funding were not even about global warming and were written before the organization was even founded or written by researchers who were not affiliated with the center worse government officials never bothered to check ccceps alleged publication lists saying instead they were taken on trust according to a recently released reportit is serious misconduct to claim credit for a paper you havent supported and its fraud to use that in a bid to renew a grant professor richard tol a climate economics expert from sussex university whose research was reportedly stolen by cccep told the daily mail  ive never come across anything like it before it stinksthe centers chairman since  has been nick stern a wellknown global advocate for more policy action supposedly aimed at combating climate change in addition he is also the president of the british academy an invitationonly society that is reserved for the academic elite and which disburses grant money in the millions of pounds to researchers as well as lord sterns own organizationin recent days the cccep which is jointly based at the london school of economics and the university of leeds hosted a gala event that was attended by experts and officials from around the world the occasion a celebration to mark the th anniversary of the stern review a page report detailing the alleged economic impact of climate change a review that was commissioned by tony blairs governmentthe massive paper claimed that the world must take immediate action to reduce greenhouse gas emissions or face dramatically higher costs in the future the review exerted a great amount of power and influence on a series of british governments as well as international organizationsbut now the reports contents and conclusions are in serious doubt not the first time global warming data has been faked following the daily mail s report cccep spokesman bob ward admitted the organization had made mistakes in both claiming credit for studies it did not perform and foro papers that were actually researched and published by other academicsacademics and experts whose work was falsely represented were furious including one who said ccceps actions were a clear case of fraud  using deception for financial gain the dc reportedstudies receiving financial support from the public sector are not required to disclose it as an ethical conflict of interest even when financial support is in the millions of dollars the dc noted that recent studies in the united states which the environmental protection agency epa uses to support the scientific case for its massive new power plant regulations the clean power plan saw the agency give  million  million and  million in public funds to lead authors  all of whom essentially provided the agency with the results it wantedas natural news founder and editor mike adams the health ranger reported in june   this isnt the first time socalled global warmingclimate change data has been faked sources", "As we know, the final United Nations General Assembly of President Obama s presidency is occurring in New York City this week. That gave diplomats from around the world to weigh in on this year s very strange presidential election.", "The film industry wants us to believe that it is liberal, that there is no racism. However, nothing could be further from the truth, and the fact that for the second year in a row all of the Oscar-nominated actors are white.", "Because everyone deserves a  safe space right? The White Student Union (WSU) at the University of California, Santa Barbara (UCSB), a new student club dedicated to creating a  safe, supportive and inclusive student community of European descent,  has recently released a  list of demands  that it expects the university to fulfill by the second week of the Winter quarter.The list protests anti-white  racism  and  marginalization  of students of European descent.", "While Donald the Trump is busy making the rounds decrying immigration, Hillary Clinton decided to make a surprise appearance in New York City for Pride. She joined NYC mayor Bill de Blasio and Governor Andrew Cuomo on the parade route near the Stonewall Inn   an especially fitting show of solidarity and support following the Orlando massacre.Hillary has worked hard on reaching out to the LGBT community, and right now, they need it more than ever.", "This letter was sent to 100% FED Up! by an anonymous author:It doesn t matter who you support for President in 2016.", "This is especially monumental since the Wall Street Journal is a conservative newspaper.Donald Trump is running out of supporters, and that includes his supporters within the media.The straw that appears to have broken the camel s back is Trump s accusation that President Obama wiretapped him during the 2016 Election. Of course, Trump offered zero evidence to back up his claim then and he still hasn t provided any now.But when FBI Director James Comey testified to Congress under oath that Trump s wiretapping accusation is complete bullshit, whatever shred of credibility Trump had left imploded in an instant and now some right-wing media outlets are backing away from him.Fox News began distancing themselves from Trump after he threw them under the bus because Sean Spicer repeated a claim that President Obama enlisted British intelligence to wiretap Trump, which was basd o a conspiracy theory offered up by Fox legal analyst Andrew Napolitano, who has since been refuted by the network and removed from all programming indefinitely.And now the Wall Street Journal appears to also be coming to their senses.In a piece published on Tuesday, the Journal slammed Trump for clinging to his lies about Obama like a drunk person clinging to an empty bottle.", "It looks as though Ted Cruz is really proud of himself for everything he believes he is doing for the nation as he is running for president. On Monday, he sent out a campaign email explaining all the  sacrifices  he s making as he s on the campaign trail.", "After former reality show star Donald Trump was caught on video speaking casually about sexually assaulting women, it s clear that his supporters take no issue with that. Sexual assault is a soul-crushing experience but to them, the victim just needs to  get over it.", "After already having several massive failures under their belts as a result of Donald Trump s presidency, it sure doesn t seem like the Republican Party has much faith in the Senate s health care bill.So far, the GOP s attempt at repealing and replacing Obamacare has been one disaster after another, and the latest report from CNN shows that they might be preparing to fail one more time. It turns out, Republicans are currently trying to protect Trump from the health care bill s backlash if it fails by distancing Trump from the legislation.", "The Democrats went down the path of identity politics long ago but it s only gotten worse in the past 8 years of Obama. He was a mater at dividing groups and pitting Americans against each other according to race, sex and gender.", "Liz Cheney, the daughter of former Vice President Dick Cheney, is planning a second attempt at running for Congress, ostensibly after her Dad uses alien technology to transfer the remaining essence of his dark energy into her not-quite-yet poisoned soul, allowing her to continue his twisted Supreme-Leader-Snoke-like legacy beyond his own lifetime.Seriously, Liz Cheney is running for Congress in Wyoming s only congressional district. (Wyoming is basically an empty square on the map, and not enough population to facilitate any more than a single member of the House.)", "If there s one person in this entire nation who does not deserve a seat at the State of the Union, it s Kentucky county clerk Kim Davis. Her reckless abuse of her position of power to deny same-sex couples the right to marry was outright unconstitutional.", "Does anyone care? If Hillary personally gassed these citizens would anyone care?", "On Tuesday, the day after he won the Republican Party s Iowa caucus, presidential hopeful Ted Cruz admitted that his campaign had sent out an email alert implying that political rival Ben Carson was dropping out of the race.The email warned that Carson was leaving the campaign trail after Iowa, and said that he would be making a formal announcement next week. Recipients of the email were instructed to spread this lie among Carson supporters during the caucuses.", "Six more women have come forward to allege that they were sexually harassed by Roger Ailes, the chairman of the conservative Fox News Channel. Ailes is currently the subject of a lawsuit from former Fox anchor Gretchen Carlson, who alleges that he demoted her after she rebuffed a sexual advance and complained about a sexist work environment.New York magazine is reporting on the new allegations, in which two women have gone on the record while the remaining four are making their claims anonymously at the moment.Kelli Boyle, a former field adviser for the Republican National Committee, says that she went to dinner with Ailes in 1989 when he then propositioned her: He had a driver and a car, and after dinner he said,  Can I take you to your friend s?", "United Airlines is in an economic and pulic relations tailspin after they were caught on tape brutally dragging a passenger from a plane after he refused to leave. The man, David Dao, is a doctor, and he was left bloody when he was physically forced to disembark because the plane was overbooked.", "Last week, after the New York Giants player Odell Beckham Jr., kneeled for our national anthem, he scored a pair of touchdowns in the team s 27-24 loss to the Eagles and celebrated the scores in very different ways Very disgusting ways.Odell Beckham is the perfect heel pic.twitter.com/6oLFAsnj2U  Dan Gartland (@Dan_Gartland) September 24, 2017Sports Illustrated reported: After an impressive toe-tap catch in the back of the end zone, Beckham Jr. drew a flag for pretending like he was peeing on the Lincoln Financial Field surface.Odell Beckham raises his fist after scoring for a second time today pic.twitter.com/dy2G3mgEul  Sports Illustrated (@SInow) September 24, 2017This week, the disrespectful NFL player had a much different experience on the field:The alarming Giants season is going full disaster.Odell Beckham Jr. was carted off the field in the closing minutes of Sunday s home loss, 27-22, to the Chargers, the team s fourth (and best) wide receiver to be hurt on the day.Beckham went down on a pass that fell incomplete with about 4 minutes left in the game, the Giants up 22-20 at the time, before they promptly blew the game. He rose for the catch then came down awkwardly, his ankle appearing to get caught under cornerback Casey Howard.He has a broken left ankle.", "PLEASE GO TO THE 2:00 MARK IN THIS VIDEO WHERE LYNCH SPEAKS ABOUT  OUR BABIES  AKA MINORITY CHILDREN:So it s no surprise that Lynch stood before a black congregation today and spoke of  WE NOT as in ALL Americans but just the black community. Her true racist colors are showing She DID say something about those of us who re not of the black community and it was rooted in the fear mongering that people like Jesse Jackson and Al Sharpton pushed in the black churches for so many years.It s so sad that even our own black president for the past 8 years said it never thought we could be  post racial .Well, most Americans don t feel that way.", "corbettreportcom november   \nin douglas adams so long and thanks for all the fish  there is a scene where a spaceship lands on earth and a robot emerges from the craft proclaiming that i come in peace and exhorting the earthlings to take me to your lizard the storys protagonist arthur dent has this strange request explained to him by his friend ford prefect an experienced galactic hitchhiker \nit comes from a very ancient democracy you see \nyou mean it comes from a world of lizards \nno said ford who by this time was a little more rational and coherent than he had been having finally had the coffee forced down him nothing so simple nothing anything like so straightforward on its world the people are people the leaders are lizards the people hate the lizards and the lizards rule the people \nodd said arthur i thought you said it was a democracy \ni did said ford it is \nso said arthur hoping he wasnt sounding ridiculously obtuse why dont the people get rid of the lizards \nit honestly doesnt occur to them said ford theyve all got the vote so they all pretty much assume that the government theyve voted in more or less approximates to the government they want \nyou mean they actually vote for the lizards \noh yes said ford with a shrug of course \nbut said arthur going for the big one again why \nbecause if they didnt vote for a lizard said ford the wrong lizard might get in got any gin \nwhat \ni said said ford with an increasing air of urgency creeping into his voice have you got any gin \nill look tell me about the lizards \nford shrugged again \nsome people say that the lizards are the best thing that ever happened to them he said theyre completely wrong of course completely and utterly wrong but someones got to say it \nif only this was a joke but here we are on the verge of a contest between the two least respected most distrusted candidates to run for office in modern political history and some people say these lizards are the best thing that ever happened to them \nif there is any solace at all in this years selection cycle it is that as the corbett report has been pointing out since the very day of its inception there is absolutely nothing at stake here the presidential figureheads are mere puppets false fronts for the shadow government and deep state that commands and controls the military economic and diplomatic machinery of the usled world empire \ndo you really think the oligarchs put their entire system up on the chopping block every four years hoping against hope that the public doesnt use the dreaded ballot box to vote them out of power dashing decades or centuries of carefully cultivated enslavement with pencils and touchscreens just in case anyone dislikes rhetorical questions let me answer that one for you no no they do not \nbut dont take my word for it take emma goldman as shes been reputed to have said and if she didnt feel free to tell other people that i said it if voting changed anything theyd make it illegal \nor take hl mencken who in his usual inimitable fashion quipped  \nthe stateor to make the matter more concrete the governmentconsists of a gang of men exactly like you and me they have taking one with another no special talent for the business of government they have only a talent for getting and holding office their principal device to that end is to search out groups who pant and pine for something they cant get and to promise to give it to them nine times out of ten that promise is worth nothing the tenth time it is made good by looting a to satisfy b in other words government is a broker in pillage and every election is a sort of advance auction sale of stolen goods \nor take lysander spooner who wrote  \nthe principle that the majority have a right to rule the minority practically resolves all government into a mere contest between two bodies of men as to which of them shall be masters and which of them slaves a contest that  however bloody  can in the nature of things never be finally closed so long as man refuses to be a slave \nor wendy mcelroy who reminds us that \nvoting is not an act of political freedom it is an act of political conformity those who refuse to vote are not expressing silence they are screaming in the politicians ear you do not represent me this is not a process in which my voice matters i do not believe you \nyes voting is worse than a dead end its less effective than bashing your head against a wall in a vain attempt to cure your headache its more pathetic than allowing the oligarchs into your kitchen and then begging for a scrap of food from your own table it is evil immoral and contemptible it is the act of a slave who has internalized that slavery so thoroughly that he wants to ensure that everyone around him is enslaved too \nbut as i pointed out in yesterdays conversation with larken rose if there is any bright spot in all of this it is that your vote doesnt matter anyway and will not change anything at all it will not even register as a protest as some would like to believe since the elections are rigged and the votes arent counted \nso if you are so inclined knock yourself out cast a ballot but instead of sitting back and feeling good about yourself for having done this senseless meaningless and immoral act can we at least agree to use the next  days to do something actually productive i leave it entirely up to you how to interpret the phrase actually productive but if youd allow me to offer some humble suggestions \nfind join or create a community organization or freedom cell with a focus on fostering economic connections and social ties with people in your geographical area \nfind join or create a community currency  community trading program or community exchange to foster agoristic connection between yourself and others in your area \ncommit to spending a certain amount of time each week spreading awareness about the banking oligarchy  false flag terrorism  gmo crops  or any subject you feel strongly about either offline or online using the work of others or by starting your own blog newsletter or community meet up group \nlearn about gardening  canning appliance repair d printing  monetary theory  or any subject that you think will be handy in the event of a government collapse or even if the government doesnt collapse \nread more books spend less time arguing with people online and more time making friends at the local coffee shop learn a new skill and teach it to someone else \nin short do all of the million things that have nothing whatsoever to do with the phony baloney political charade exemplified by national selection day because if all you ever do is tick a box in a voting booth and sit back to see who wins the rigged sporting event you probably believe the lizards are the best thing that ever happened to you", "the greatest trick that feminism has pulled is to convince the masses that women are presently disadvantaged relative to men\nit is true that at first glance men dominate every field from business to pokémon go achievements  which can lead some to think that there is a conspiracy against women but the male superiority in many fields is exactly what allows society to prosper years after the humiliating debunking of the wage gap its time to address the real elephant in the room the fact that women dont pay taxes\na research report on the fiscal contribution of men and women across age groups was published by the victoria university of wellington  lets explore the key findings\n\nthis is the wellknown earnings gap incorrectly referred to as the wage gap womens preference for low paying jobs among others is a factor at play here another factor is the amount of women working part time the average week for women in this research was  hours and  for men the workforce participation rate did not differ between men and women in significant ways\n\nthis is the disposable income this is the income remaining after deduction of taxes and other mandatory charges available to be spent or saved as one wishes you can see that progressive taxes unfairly impact males  and reduces males disposable income near womens although the market income was almost double that of womens if it disproportionately affects men  you can be assured that no one will complain\n\nthose are the raw taxes paid by men and women the tax gap has oddly never been an gender issue until now\n\nwhen the tax money received by men and women is included in the equation you can see that for most of womens lives except between  to  they receive more tax money than they supply the state with men on the other hand give the state more tax money than they receive from  to  years\n\nthis is where it gets upsetting as you can see womens short period of positive fiscal impact doesnt come close to counterbalance an already massive overall negative impact the net fiscal incidence on men is approximately zero when accumulated over all ages as such society invests in young males and they subsequently pay back societys investment women bear massive costs to society while we were taught to see them as underprivileged\nby the end of her life the average woman will cost about  to the average taxpayer this means that an average man is extorted  in his lifetime that will be directly transferred to women if men could use that money to their will women would chase men as much as men chase women nowadays\nthere are a few confounds that need to be ruled out the authors mention specifically that health and education costs are almost equal for men and women also the workforce percentage doesnt exceed  difference between men and women women dont spend more for children either according to the report even if there were confounds that needed to be accounted for this is not something feminists have done for the cent wage gap they have compared raw percentages without accounting for any confounding factors\nalso these numbers do not include massive costs for the governmental budget for womens issues that is a massive burden for the state for instance my local government from a canadian province of  million people just announced a  plan to fight sexual violence against women  after two immigrants dingdongditched women in a student house \nadd to that millions invested in sexed programs in which a feminist teaches boys that porn movies tailored for them shouldnt be imitated and that instead that they should have their partners pleasure in mind while teaching the exact opposite to girls the government takes money from males to empower women into hating men and their contribution to society\nhttpstcornbrpfws québec canada announces  million plan against sexual violence after two foreigners touched female students\n nicolas kilsdonk nkgervais october   \n\nthe data also doesnt include all the money directly and personally transferred from a man to a woman for instance while women make so little they still account for  of all consumer purchases  and you were wondering why marketers so desperately try to appeal to women in advertisements\na metaphor for male taxpayers and women this is a real danone ad watch it here or see my comment here \nthe only defense that feminists can use when confronted with these facts is that women invest so much time in children however feminists made it very clear in the past decades that a womans contribution to society shouldnt be based on her involvement with children moreover at birth rates of half the necessary  birthrate for population stability theyre also doing the children thing pretty badly\nthese findings raise a serious question would feminism survive a libertarian regime that doesnt involve male tax money after all it is not a coincidence that women consistently vote for a welfare state within  years of womens suffrage in the usa the government doubled their tax expenditure and revenue  womens voting patterns have made the government become the new providing husband but this time the providing husband doesnt get a woman or children in return remove taxes and no woman will ever claim to be a strong independent woman the state is cucking you a little like if prostitution was not only legal but free  most guys would probably be strong independent single males\npretty ironic that the institution that gives money to women for being pregnant prevents them from being paid less makes abortions affordable is entirely supported by men feminists are not seriously against living in a society entirely supported by men they are just against men having the autonomy over the wealth they create male wealth is a public good and female wealth is her body her choice\nits time we fight for equal tax\nhere are my social media accounts twitter  facebook  youtube \nread more yet another mediahyped rape accusation is debunked", "Ted Cruz provided a funny moment during the Republican debate last night:", "Donald Trump is definitely protesting too much.This would be a good time for Trump to keep his mouth shut, but as usual, he s not.When top law firms refused to work for him on this case, they did so for precisely this reason. Having a client who constantly sets fires with his mouth is not a client any lawyer wants to put up with.", "21st Century Wire says We are sure that the military industrial complex is not at all happy about the prospect of using diplomacy before cruise missiles.In Donald Trump s foreign policy speech today he made numerous points that would lead us to believe that his stance on this area of policy will be radically different to what has become the norm.Aside from the usual campaign rhetoric of ensuring America has the strongest military on the planet, Trump made numerous points clearly stating that the military option will not be his first option.Trump specifically spoke of being very careful as to whom the US assists, particularly in the Middle East, and to only help those who are true allies, which is a clear stab at recent policies to arm and support terrorist groups to overthrow nations like Libya and Syria.He also explicitly stated that the US needs to  stop seeking radical change in the world , and instead look to promote stability through diplomacy saying: Our goal is peace and prosperity, not war and destruction. The presidential hopeful is also looking to drastically cool off the rising tensions with Russia.", "Before we get too far into this story, it needs to be pointed out that the 18 year old teen who was just sentenced by a judge for having a homemade Nazi tattoo, was only 15 years old at the time, and has since admitted he made a mistake. The Afghan  rapefugee  on the other hand, was 17 years old when he brutally raped a 72 year old woman.", "After his reelection in 2012 Obama removed the bidding process from section 8 housing. Obama then schemed to provide HUD initiated grants to their  pet  organizations.", "is deindustrialization a natural phenomenon of developed economies increasing real revenues affect peoples lifestyle choices jörg guido hülsmann  misesorg   \nlet me first state my position and then add a few arguments to back it up \neconomic growth typically entails a reallocation of labor away from industrial production but it does not all by itself lead to falling industrial output the decline of industrial production in the us and france in the past thirty years is to some extent due to capital exports but especially to government interventionism in the form of mushrooming labor business and financial regulations education policies social security funding and taxation this decline cannot be stopped through more interventions even if they are designed with the good intention to reindustrialize the country \nnow let me offer a few considerations in support of these contentions \nthe reallocation of labor in a growing economy results most notably from capital accumulation and from changing preferences of the workingage population further investments and extensions of the existing structure of production make it necessary to spend more time devising new methods preparing industrial activity coordinating and monitoring supply chains lowquality bluecollar labor diminishes whereas there is some increase in highquality bluecollars but especially an increase in whitecollars working in and around the supply chains \nincreasing real revenues affect peoples lifestyle choices rather than laboring long hours that provide essentially a monetary reward they increasingly prefer enjoyable activities that provide immediate psychological and emotional rewards thus the blossoming of artistic intellectual and scientific activities in developed countries at the expense of traditional industrial pursuits \nas a natural consequence of economic growth therefore industrial production declines relative to what it could be if it attracted even more people but this does neither imply a shrinking physical industrial output nor does it imply shrinking industrial revenues capital accumulation and technological progress make it possible that industry thrives even when less people have industrial employment germany provides an example \nin the past thirty years western capitalists have invested large amounts of capital in formerly communist countries of the east and far east this reallocation of capital though beneficial from the overall point of view of the world economy has been detrimental in the shortrun to the industrial development of those western countries where the capital would otherwise have been used \nbut capital investments in countries such as france and the us have declined even more as a result of mushrooming government interventions welfare checks diminish the incentive to accept lowpaying and nongratifying industrial jobs massive subsidies for secondary and higher education artificially prolong schooling reduce the supply of qualified manual labor and create an artificial bias among the workingage population for scientific intellectual and artistic activities panoply of regulations have on the one hand increased the costs of doing business and on the other hand stimulated rentseeking and manifold forms of evasion and regulatory arbitrage today they are feeding entire armies of lawyers accountants auditors and financial advisors all at the expense of ordinary business \nthese tendencies cannot be stopped through socalled reindustrialization policies which boil down to even more government spending premised on the spurious notion that irresponsible and often also inexperienced politicians know best how to use the available scarce resources such policies have utterly failed in the past airbus included and will fail in the future genuine reindustrialization requires more oxygen for industry it requires nothing less than a rollback of the artificial obstacles for industrial development that government interventions have created in past generations", "The leftist media was quick to blame Donald Trump for the organized chaos and riots that were fueled by paid protesters who, when pressed by FOX News reporters, clearly had no idea why they were there. Jim Acosta, of CNN News, admitted the number of anti-Trump protesters and amount of violence was underreported, but laid the blame squarely on Trump:  Donald Trump, for whatever reason decided to hold a rally, almost in the Lion s Den.", "21st Century Wire says This is one step closer to the future industry of farming organs in human surrogates.American scientists are now trying to grow human organs inside of pigs in order to  tackle the donor shortage  (problem, reaction, solution).The potential for limitless profits here is immense  The GuardianScientists trying to grow human organs inside pigs in an attempt to tackle a shortage of donors have successfully created part-human, part-pig embryos, it has been reported.Researchers at the University of California, Davis combined human stem cells and pig DNA and allowed the embryos to mature for 28 days, before terminating the experiment and analysing the tissue.They believe that the animals, which would have a human internal organ, may look and behave like any other pig and could be a ready source of organs for life-saving transplants.It was reported earlier this year that scientists had begun attempts to create the embryos but there has been opposition from authorities. In September last year, the US National Institutes of Health said it would not back research into so-called chimeras until it knew more about the implications.It cited fears that the presence of human cells could affect the animal s brain and behaviour, potentially making it more human.", "In the Trump administration s ongoing war on the LGBTQ+ community, the president has no greater champion than one Jefferson Beauregard Sessions, the head of the Justice Department. The Attorney General has a long history of animosity toward anyone outside his own tiny window of experience, including women, non-English speakers,  colored  folk, and especially those he has casually referred to as  ho-mo-SEK-shals  in court briefings (assuming he types in his own accent).Back in July, Sessions attempted to argue, in the same vein as the unsuccessful attempt in Loving v. Virginia to maintain a ban on interracial marriage, that discrimination against gays and lesbians was constitutionally protected because it applied equally to men and women.Now Sessions has narrowed his focus to the  T  part of his least favorite acronym: Transgender people.", "Domestic terrorists  torched  a limousine in D.C.near the parade. Because nothing says,  I hate President Donald Trump  like lighting a perfect strangers vehicle on fire.Keep it up you bunch of loser criminals and you ll never win another election Fire on 13 & K looks like a car was torched.", "A Republican state senator in Utah believes that porn is such a threat to public health that he is proposing legislation to make the state take his aversion to skin flicks official. Whatever happened to limited government?Sen.", "Donald Trump has been exposed once again, and he s having a full blown meltdown because of it.Apparently, meeting with Russian leader Vladimir Putin for several hours during the G-20 summit wasn t enough, because it s just been discovered that Trump and Putin had another secret meeting, which the Trump administration did not disclose to the public.Once the media reported the secret meeting (which was later confirmed by the White House), Trump went into one of his Twitter tantrums and cried  fake news . Trump claimed that other world leaders had been invited and that the media had been well aware of the meeting.Trump apparently still doesn t understand that now that he s President of the United States, nothing in his life is private anymore.", "As the name of the suspect, identified as 24-year-old James Holmes, first emerged Friday morning, Ross reported on ABC News that he d found a web page for a  Jim Holmes  on a Colorado Tea Party site.Here a transcript of the discussion on live television between George Stephanopoulos and ABC News  lyin  Brian Ross: GEORGE STEPHANOPOULOS: I want to go to Brian Ross here, because, Brian, you ve been looking- investigating the background of Jim Holmes here. You ve found something that might be significant.BRIAN ROSS: There is a Jim Holmes of Aurora, Colorado page on the Colorado Tea Party site as well.", "Forcing taxpaying Americans to fund liberal propaganda television and radio shows is similar to union bosses forcing conservative union members to contribute their hard earned dues to help candidates like Hillary Clinton or Barack Obama win elections. No American should have to pay for government funded media outlets who pass off biased opinions by liberal hosts as  news  or television shows that work to indoctrinate our youth.", "The media everywhere seems to be jumping on the new revelation of Hillary Clinton s emails without actually reading what was written by FBI Director James Comey.While Donald Trump, alongside pretty much every mainstream media branch, is saying that the FBI is  reopening  the investigation, that s not at all what was written.Comey, doing his due diligence and informing Congress that new emails had been discovered, sent the following letter: In previous congressional testimony, I referred to the fact that the Federal Bureau of Investigation (FBI) had completed its investigation of former Secretary Clinton s personal email server. Due to recent developments, I am writing to supplement my previous testimony.", "The Humane Society of the United States pretty much never weighs into politics, unless, of course, it s about an issue that directly affects animals. This is no normal election, though, and after a series of pictures in which Donald Trump s sons gleefully show their murdered animal  trophies,  and after seeing Trump s potential nominees, the animal rights group had to weigh in, calling Trump a  threat to animals everywhere.", "BIRDS OF A FEATHER FLOCK TOGETHER-Dirty politics follows Obama and Clinton so here s yet another example of these two scumbags doing underhanded deals and lying their way through every situation:  Obama s State Department is blocking correspondence from Hillary Clinton and her top State Department aides about a controversial 12-nation trade deal will not be available for public review   at least not until after the election. The Obama administration abruptly stopped the release of Clinton s State Department correspondence about the so-called Trans-Pacific Partnership (TPP), after first saying it expected to produce the emails this spring.The decision came in response to International Business Times  open records request for correspondence between Clinton s State Department office and the United States Trade Representative.", "Donald Trump said after his official meeting with Vladimir Putin at the G- 19  Summit that the two  get along very, very well. They got on so well, in fact, that Melania Trump was sent by staffers to break up the meeting (which ran almost two hours longer than normal) and failed miserably.After that meeting, Putin and Trump decided to make things a bit more intimate and met alone with only a translator   a Russian one, which is a gigantic violation of national security protocol.The second meeting reportedly lasted about an hour and was previously not mentioned at all by the administration.", "Tune in to the Alternate Current Radio Network (ACR) for another LIVE broadcast of  The Boiler Room  tonight 6:00 PM PST | 8:00 PM CST | 9:00 PM EST for this special broadcast. Join us for uncensored, uninterruptible talk radio, custom-made for bar fly philosophers, misguided moralists, masochists, street corner evangelists, media-maniacs, savants, political animals and otherwise lovable rascals.Join ACR hosts Hesher and Spore along side Andy Nowicki the Nameless One & the gang for the hundred and twenty eighth episode of BOILER ROOM.", "Establishment Republican pollster Frank Luntz looked more like a CNN host than a Republican pollster in a room full of committed Roy Moore voters. Luntz was obviously frustrated, as Alabama voters dug in their heels, and refused to back down on their support for Judge Roy Moore in today s Senate election to fill AG Jeff Sessions seat in Alabama.MONTGOMERY, Alabama   Frank Luntz, a GOP establishment messaging consultant, was visibly flabbergasted as every single one of his focus group participants in a Birmingham area Vice News-produced panel backed Judge Roy Moore for U.S. Senate.", "Starbucks has pledged to hire 10,000 refugees in response to President Donald Trump s controversial immigrant ban. CEO Howard Schultz said in a letter to employees Sunday the company would hire refugees from 75 different countries over a five-year period.", "He probably believes  pray the gay away  is the treatment, too.There is no law forcing straight people to seek such treatment, so this is clearly about stealthily trying to  cure  gay people when they do not need to be  cured  at all.But Minnesota GOP Rep. Glenn Gruenhagen thinks gay people have an  unhealthy sex addiction  that needs to be fixed.During an interview on WCCO Radio with Chad Hartman last week, Gruenhagen declared that gay people are mentally ill and should be forced to undergo treatment for their  unhealthy sexual addiction. Claiming that he has gay friends and friends who were former homosexuals, Gruenhagen fretted about the number of Americans who have an STD in this country, which the Centers for Disease Control says is about one-third of the population.Hartman then sought clarification.", "GCHQ director Robert Hannigan is stepping down after only two years as chief of the cyber spy agency for  personal reasons,  the intelligence service has announced. Recall also that Judge Napolitano said three sources told him the British spy agency had something to do with the witch hunt on Trump: JUDGE NAPOLITANO was on FOX & Friends discussing the Obama administration s efforts to spy on Donald Trump.", "A student at a Michigan high school stood up for his right to wear a Confederate flag shirt to school. There is not a rule against it but the principal felt it would interfere with learning.", "Over the last few months, Donald Trump has been able to garner enough votes to make him the presumptive Republican nominee for the presidency. Unfortunately, his message has been based on divisiveness, consistently attacking minorities as the cause of the country s woes.", "podcast play in new window  download  embed \ntoday james talks to nomi prins author of books like all the presidents bankers about her recent article the central bank power shift from west to east game of thrones style we talk about the changing economic and monetary landscape and how the locus of central bank power is shifting to the east with players like the peoples bank of china gaining in prominence and former useu lapdogs like the imf becoming brokers for these new power players in the new world financial order \nshow notes and mp httpswwwcorbettreportcomp \nwatch this video on youtube httpsyoutubeuklwihwk", "Perhaps Merkel should have considered the serious consequences of Germany s compassionate open border policy that allowed over 1 million (mostly) Muslim males to infiltrate their country. German officials essentially granted them permission to rape and sexually assault their women and children while they looked the other way.", "There s so much to this effort to close GITMO that it s hard to know where to begin. First of all, one of Obama s campaign promises was to close GITMO.", "A Muslim woman was criticised after she wore a burka emblazoned with weapons in a TV interview about the Manchester terror attackThe woman, named only as  Sid , was part of a group of Muslims interviewed by Channel 4 News journalist Krishnan Guru-Murthy in the Rusholme area of Manchester, which is home to the largest Libyan community in Europe.The group vehemently condemned the Manchester Arena attack by 22-year-old suicide bomber Salman Abedi, who is of Libyan descent.But some viewers criticised Sid over her decision to wear a burka printed with a pistol, grenade, knife and machine gun spelling the word  love .One wrote:  Channel 4 news contributor in full hijab, top to toe with comedy glasses, images of knife & hand grenade emblazoned across the front! Ffs.The interview with the Muslim woman named  Sid  begins at the 6:12 mark of the video.", "Republican members of Congress, who love claiming that they re the only party that stands for real Americans, are now terrified of their own constituents. This is happening for one simple reason   they never expected their own constituents to be angry with what they re doing on Capitol Hill.", "What do you think of these comments made by Donald in December, 2011? Does it even matter to Trump followers when these clips surface of Donald contradicting his current positions?", "Dr Can Erimtan 21st Century WireDid Donald J. Trump have any idea about the impact his words would have across the world?!? Did he have any idea that the whole wide world, including the United Nations, would turn against him?On Wednesday, 6 December 2017, in the White House s Diplomatic Reception Room the President of the United States proceeded to make history, or, proceeded to leave his personal mark on the flow of world events as his words set a whole chain of global events in motion: I have determined that it is time to officially recognize Jerusalem as the capital of Israel.", "Just when you thought support of Donald Trump would drop to zero it turns out there is still one group that backs him 100 percent. Despite claiming to be all about  family values  and biblical principles, conservative evangelical leaders still refuse to revoke their endorsement of the Republican nominee.In 1995, Trump made vulgar comments about women while bragging to Access Hollywood reporter Billy Bush that he can grope any woman he wants because he is famous.", "Walmart was apologizing on Monday after an appalling description of a product by a third-party vendor made its way onto the retail giant s website.The retailer was slammed early Monday after the color of a netting weave cap   used as a protective layer between a person s hair and sewn-in hair extensions   on its site was described as the color  N  Brown. Twitter user Kwani Luni tweeted a message about the wig color on WalMart s website, asking them  @Walmart what are you doing?", "Donald Trump just got fined $10,000 for improperly using the atrium of Trump Tower for campaign events, which violated an agreement between Trump and the city that is meant to preserve public space.The public atrium of Trump Tower was repeatedly closed for the Republican nominee s campaign events, which ultimately resulted in an investigation by the New York City Department of Buildings. In New York City, it is common for buildings to have public atriums.", "Up until recently, we ve all been witnessing Donald Trump speak freely with nothing really prepared except for the usual crumpled sheet of paper he d pull out of his coat pocket to read the latest poll numbers to tell us how wonderful he is. However, with clinching the Republican nomination getting closer and closer, he s trying (and failing) to be more refined.", "The hosts of Fox & Friends just got their asses handed to them by one of their own colleagues for protecting Donald Trump so much.For months, the FBI have been investigating Trump s Russia scandal. The scandal continues to grow every day and when Trump fired FBI Director James Comey last week it became and even bigger story.Trump literally fires the head of the agency that is investigating him, which means he interfered in a federal investigation and committed obstruction of justice.", "And the AFL-CIO is crying in their money pit wouldn t it be a great get to have college football players unionized? The players are students and not employees unless you want to bust this whole thing wide open and tell the truth about how players might be compensated.", "On December 1, 1955 in Montgomery, Alabama, Rosa Parks bravely defied a bus driver s orders to give her seat to a white person and move to the back of the bus. Parks  refusal is remembered as one of the greatest moments in civil rights history and, unfortunately, history has a way of repeating itself.", "Acting Attorney General Sally Yates refused to back Donald Trump and his bigoted Muslim Ban. In a move that will surprise no one ever, Trump flew into a rage and fired her.", "During an appearance on CNN on Tuesday, Republican presidential candidate Ben Carson wondered aloud if his presidential campaign is all a big scam.During the interview, a laughing Carson told CNN s Poppy Harlow that his campaign had employed people who didn t really seem to understand finances. A moment later, as if the possibility had just dawned on him for the very first time, Carson added,  or maybe they did maybe they were doing it on purpose.", "Rick Scott is an absolutely horrible governor and literally gives zero f*cks about the people of Florida   even babies. Governor Scott is being accused of eliminating health standards for children s heart surgery after a hospital donated $200,000 to Republicans, including his own political action committee.In 2015, CNN revealed that St. Mary s Medical Center in West Palm Beach had an extremely high mortality rate in their pediatric cardiology program.", "A longtime Republican Party donor based in Florida vowed not to contribute any more money to candidates or electioneering groups until they pass legislation banning the sale of assault weapons to civilians.Al Hoffman Jr., a real estate developer and former ambassador to Portugal, has donated millions to Republicans over the years. On Saturday he sent an email to a half-dozen Republican donors, encouraging them to boycott candidates who oppose new gun legislation, the New York Times reported.", "So much for that whole  dead broke  nonsense Hillary Clinton has vowed to be a champion for  everyday Americans. The former Secretary of State who once described herself and husband Bill Clinton as  dead broke kicked off her campaign on June 13 and in her 45-minute speech on New York City s Roosevelt Island, Clinton delivered a message similar to her initial presidential announcement.", "While on his radio show the other day, former Ku Klux Klan Grand Wizard David Duke doubled down on his support of Republican presidential front-runner Donald Trump, even appearing excited at the comparisons being made to Adolf Hitler.While he tried to preface his diatribe against the media by stating that everyone is just trying to demonize Trump by associating him with Hitler, he then goes on to say: The truth is, by the way, they might be rehabilitating that fellow with the mustache back there in Germany, because I saw a commercial against Donald Trump, a really vicious commercial, comparing what Donald Trump said about preserving America and making America great again to Hitler in Germany preserving Germany and making Germany great again and free again and not beholden to these Communists on one side, politically who were trying to destroy their land and their freedom, and the Jewish capitalists on the other, who were ripping off the nation through the banking system. We have the same thing going on here with Goldman Sachs.", "John Kasich is delusional! He s also full of himself!", "But wait  the  first female president oh never mind, the Democrat party s gonna go with  diversity  and pick the old white guy. Because in the end, the Democrats don t really give a hoot about  diversity it all comes down to voting for freebies.According to PBS, Bernie Sanders is  gaining against Clinton in early polls.", "This morning, President-elect made yet another disastrous announcement over Twitter, when he send out a tweet that called for the cancellation of the Air Force One contract. The contract, which was for an update on the presidential plane, was apparently too much money and Trump wants to do away with the deal.", "If it wasn t for people like Vietnam veteran William E. Staehle, who made the decision to publicly defend the character of Roy Moore in an op-ed, the only picture the American people might have of the former judge, is the one painted by the leftist media and the rabid Democrat Party, that struggles to identify a single legitimate reason for Alabama voters to  support their candidate Doug Jones.I served with Roy Moore in Vietnam in 1971-72, where I knew him to be an altogether honorable, decent, respectable, and patriotic commander and soldier. I have had no contact with him since.He and I were captains and company commanders in the 504th Military Police Battalion, stationed at the base camp called Camp Land, just west of Danang.I knew him well in my first four months in-country before I was re-assigned within the battalion to another location.", "It s over, folks. Shy a miracle, and despite probably losing the popular vote, Trump has won the election (and wrecked the world economy in the process).There s really not much to say about this other than  try not to kill yourself via alcohol poisoning.", "Watch:", "Donald Trump will explode when he reads this.Trump is a national embarrassment who never should have been allowed to run for the presidency to begin with. His antics during the campaign and after have divided the country and turned us into an laughingstock around the world.Throughout his campaign, Trump attacked Latinos, women, African-Americans, Muslims, and Jews.", "store guardian front page a yearold migrant cries this image of a yearold migrant crying  which is currently plastered on the front page of the guardian  is nothing short of laughable chris menahan  information liberation  october   comments \nwont you take pity on this poor innocent little child \nthis image of a yearold migrant crying  which is currently plastered on the front page of the guardian  is nothing short of laughable \na yearold from ethiopia cries while he awaits registration at a processing centre in the makeshift refugee camp near calais the photos caption reads the image is placed under a headline reading councils resist pressure to take children from calais \n\nthis crying child is supposed to make brits feel guilty and demand their government allow children like him into their nation \nthe image is not a fake nor is it being used satirically it comes from the associated press emilio morenatti  you can see four pictures of the man for sale on their website  \nthe child migrant is clearly in his s yet their editors evidently believe their readers are so incredibly stupid theyll actually believe theyre looking at a yearold boy \na look at emilios twitter shows one person appears to have actually bought the lie morenatti imposible no hacernos mirar y luego un nudo en la garganta pictwittercomazvzq \n luján artola paulos rowley_bel october   \nimpossible not make us look then a lump in the throat the tweet reads \nincidentally ethiopia is not even a war zone so im not sure how this yearold man can even be considered a refugee newsletter sign up", "Racists, homophobes, misogynists and other bigots are out in droves these days   and not just in America. Case in point   a rally held by Neo-Nazis in Madrid, Spain, where the hateful group was protesting immigrants.", "Last year, in an effort to demonize Hillary Clinton staffers, Trump ally Michael Flynn famously said that immunity means  you ve probably committed a crime    a quote that is now coming back to bite him in his ass now that he is begging for immunity from prosecution in exchange for testifying against Donald Trump.What Flynn did or the extent of his crimes is still a mystery as is what Flynn knows   but you don t ask for immunity unless you re ready to give up something big (like the President of the United States). Trump, still running scared, tweeted his support of Flynn in this  witch hunt.", "Bette Midler has made her distaste for the GOP s 2016 Clown Car perfectly clear, usually via her twitter account. On Monday morning, we woke up to the gross hashtag #CruzSexScandal trending on Twitter, and on Tuesday, the Divine Miss M made her thoughts on the matter perfectly clear in hilariously appropriate tweet.", "Following a leftist agenda is no longer optional. Follow their rules or be subject to fines The guide states,  The District uses the probable cause standard in determining whether the above constitute harassment or a hostile work environment.", "He s a Republican. He s anti-gay.", "keywords acupuncture  baby eczema  cure baby eczema  eczema cure  eczema treatment  heal eczema \nthere was a time when my sons eczema became so severe i was willing to try any natural healing method my baby was  months old when he developed eczema we tried the usual dose of steroids and overthecounter creams from our family doctor it got so bad that his scars were not healing he wasnt sleeping and i wasnt sleeping as a child my mother took me to an acupuncturist for migraines and the migraines stopped after a handful of visits i remember it being a pretty relaxing experience with the smell of incense and herbs and the quietness of the room so i took a leap of faith and booked us for an appointment with a traditional chinese doctor who specialized in skin disorders allergies and asthma why try acupuncture  traditional chinese medicine reason  acupuncture has been practiced for almost  years in china \nwith that much history its worth a try it is a method of relieving pain or curing an illness by placing needles in the patients body at precise points along the  meridians in the body meridians are energy pathways that are associated with different organs within the body the world health organization lists  ailments that are treatable by chinese medicine  acupuncture reason  acupuncture has helped children with eczema \nin a study of  children who were treated with chinese medicinal herbs the treatment reduced eczema symptoms by  in  of the children see sources although it was a small study size the benefits seem to far outweigh the risks when my son was a baby even a  improvement in his symptoms would have been amazing for us reason  acupuncture does not hurt babies \nmany people worry about the needles hurting but the needles that acupuncturists use are about  th of a syringe needle my son was a baby when we started the treatments and he never cried out when getting the needles in him reason  acupuncture relieved my babys eczema by  \nacupuncture healed the eczema to the point where we could figure out his triggers our doctor stabilized the eczema best of all flareups only occurred when my baby was teething his skin was softer than it had been in months acupuncture needs to be done on babies for a minimum of  months in order to see an improvement this is because the treatment is trying to alter the immune response which is a long process but sometimes babies will respond quicker than that we used a topical herb powder given to us by the doctor and applied it to his skin this topical mix had a similar effect as hydrocortisone cream if i applied it  times per day with a cotton ball reason  acupuncture is affordable \nthis is true especially if you go to a student clinic you can pay the affordable price and yet the students are supervised by very experienced doctors for child and baby treatments it is even more affordable it cost us about  per visit on average we tried a few different clinics some health plans will cover acupuncture so check with your health plan to see if yours covers it to keep it affordable i suggest trying to find a specialist in acupuncture  tcm traditional chinese medicine not a practitioner who does many different types of treatments tips for helping your child while getting acupuncture \nbring a favorite stuffed animal a book or some toys try nursing your baby while they are receiving acupuncture a baby only needs the needle in the acupressure point for a second and then they are pulled out adults typically have needles in for  minutes for each treatment because our bodies do not respond as quickly as babies bodies do check out my youtube video for more tips find an experienced  accredited acupuncturist \nmake sure to look for an accredited acupuncturist or tcm traditional chinese medicine doctor be sure the acupuncturist has some experience in your condition chat with the people in the waiting room and see if theyve had success with your doctor i met a few moms in the waiting room that swore by the chinese doctor we were going to see that made me feel more comfortable \nfind a tcm traditional chinese medicine doctor who offers certified organic chinese herbs certified organic means the herbs were never sprayed with toxic pesticides and herbicides as well there have been some reports of heavy metals residue in chinese herbs herbs are just as powerful as prescription medications and can have adverse effects if used improperly make sure to ask about the testing done on the herbs that you or your baby are prescribed every condition has different treatment needs \ncheck with your family doctor to be sure you dont have any conditions that would prevent you from using acupuncture or chinese medicine all the information in this article is provided for educational and informational purposes only and is not intended as a substitute for medical counseling \nrosemary hansen is a published author and devoted mama she is passionate about healing eczema naturally rosemary is a selftaught organic whole foods chef her lifelong dream is to have a flock of pet dairy goats get a copy of her free ebook  natural remedies for soft skin at wwwnaturaleczemamamacom \nsources", "A 14 year old girl yelled:  F*ck the pizza man  and this is what happened next:Why were they trying to kill you?I don t know. I don t do nothing.", "Donald Trump tried to take credit for Fiat Chrysler s announcement that they will be creating 2,000 jobs in the United States. Fiat Chrysler called out his bullshit.On Monday morning, Trump posted on Twitter that Fiat Chrysler announced the creation of 2,000 jobs and a $1 billion investment in new factories in Michigan and Ohio and appeared to suggest that he is responsible for making it happen.It s finally happening   Fiat Chrysler just announced plans to invest $1BILLION in Michigan and Ohio plants, adding 2000 jobs.", "With Donald Trump throwing yet another hissy fit on Twitter for how Saturday Night Live depicts him,  it has left many going after him for being such a whining baby about it all, and the ladies of The View are no different.The general consensus about Trump s Twitter tantrums is that instead of focusing on how a comedy show satirizes him, he should focus on the nation he was just elected to lead, albeit only through the Electoral college because he lost to Hillary Clinton by 2.6 million votes.Many on the panel noticed that Trump seems very insecure, probably because he won the election so narrowly and didn t get the popular vote, and now he s overcompensating with aggression on Twitter.Here s the thing, political satire is necessary, especially to keep people in power in check and make them see how ridiculous they can be sometimes. If Trump doesn t like a mirror being held up to how he behaves, maybe he should look at himself and not the people pointing it out.These opinions from The View panel are likely how most of America feels right now, so well done.Watch the ladies go after Trump here:.", "What the f*ck is wrong with our country? Republicans may say that racism ended with Rosa Parks (they actually say this), but a lot of people s words and actions seems weirdly racist given the complete lack of it in our society.An African-American man posted a video of an exchange he had with a white driver after he passed the apparently aggressive Caucasian man in traffic.", "One of the biggest mysteries in Constitutional Law is what the Framers meant when they said  natural born citizen. Section 1 of Article Two of the United States Constitution states the eligibility requirements for serving as president of the United States, and under clause 5 one would find the  natural born  requirement:No Person except a natural born Citizen, or a Citizen of the United States, at the time of the Adoption of this Constitution, shall be eligible to the Office of President; neither shall any Person be eligible to that Office who shall not have attained to the Age of thirty-five Years, and been fourteen Years a Resident within the United States.The Supreme Court will have the option to take up the case, if it so chooses, now that the lawsuit challenging Ted Cruz s eligibility to be President has been filed.Retired Utah lawyer Walter Wagner has led the  birther  movement against Ted Cruz, filing multiple lawsuits in federal court to block the Texas Republican from seeking the nomination.", "On Tuesday night, one lone city, Richmond, California, unanimously voted to impeach Donald Trump. They hope they are only the first.", "American citizens are eligible to apply for small business LOANS, but they are also responsible for paying them back with interest. Illegal aliens on the other hand, are getting FREE money from the American taxpayer to start a business with no obligation to pay us back.", "There s been news erupting all over the place regarding what guests Donald Trump will be inviting to the last presidential debate. So far, we know he s bringing in the mom of a Benghazi victim, and President Obama s half-brother.", "Rep. Debbie Wasserman Schultz dropped a big bomb during an interview on CNN today. She claimed that Jeh Johnson s  testimony about the DNC computer hack is  wrong in every respect  and  utterly misinformed.", "Ever since Donald Trump had the nerve to insult and attack the parents of a slain Muslim soldier who sacrificed his life for his country, he s been getting backlash from both Democrats and Republicans. And it turns out, it s getting difficult for even the most die-hard Trump fans to defend him.That s why when CNN contributor and Trump lover Scottie Nell Hughes was asked to defend the attacks Trump made on the Khan family, it didn t take long before she gave up and started complaining that there weren t enough Trump supporters to back her up on the panel.", "North Carolina Governor Pat McCrory (R) announced he would be suing the Obama administration for stopping his state s ability to discriminate against transgender people. Attorney General Loretta Lynch just hit him back.", "One of the emails contained in the Wikileaks  Podesta email release shows that Hillary Clinton had gun control supporters planted in a town hall audience in Manchester, New Hampshire.The town hall occurred on October 5, 2015; just four days after a man opened fire on Umpqua Community College campus in Oregon.In the email thread, dated October 4, 2015, a  speech draft  was passed around  on behalf of Megan Rooney. The email contained  talking points  for Clinton to use to discuss guns in Manchester.The first part of the email reminded other campaign staffers that the town hall had no specific focus, although gun control would be highlighted:Here are short TPs about guns for the NH community college town hall >>> tomorrow.", "The House of Representatives voted Tuesday to end fraud within the Department of Housing and Urban Development that has allowed millionaires to live in low-income housing for as low as $300 per month. Read more: WFBThe effort by the feds will put people in a pickle.", "21st Century Wire says President Donald J. Trump is leaving no stone unturned by asking the US Congress to investigate the alleged abuse of Executive powers by the Obama administration as part of the investigation into alleged Russian interference in the presidential election.The White House request was directed to  congressional intelligence committees  and asked them to  exercise their oversight authority to determine whether executive branch investigative powers were abused in 2016. More on this report from Russia Today  RT   The White House has asked the US Congress to investigate alleged abuse of executive power by the Obama administration as part of the investigation into alleged Russian interference in the Presidential Election.The White House request released on Sunday was directed to  congressional intelligence committees  and required them to  exercise their oversight authority to determine whether executive branch investigative powers were abused in 2016.", "High profile back stars from Will Smith and Jada Pinkett-Smith to Spike Lee will be boycotting this year s Oscar s ceremony in solidarity over the persistence of racism in Hollywood. But for one (white) nominee, this is all just a case of  racism against whites.", "This blogger s piece is a glimpse into the future of America. Unless we all find a way to stand together and stop Barack Obama and the Democrat party s fundamental transformation from happening we ll be looking for another country who cares more about its citizens than its immigrant population This is the last post on this blog.", "The U.N. voted against America moving our embassy to Jerusalem, raising the question of what we pay to those who voted against us. The grand total of all donations to countries around the world (using stats from 2016) is over $24 BILLION that s billion with a b!", "Peter Certo Other WordsEven in an election year as shot through with conspiracy theories as this one, it would have been hard to imagine a bigger bombshell than Russia intervening to help Donald Trump. But that s exactly what the CIA believes happened, or so unnamed  officials brief on the matter  told the Washington Post.While Russia had long been blamed for hacking email accounts linked to the Clinton campaign, its motives had been shrouded in mystery.", "The Golden State Warriors just clenched the 2017 NBA Champions against the Cleveland Cavaliers. They fought hard in the 4-1 series, winning the title Monday night in their home city of Oakland.", "Well, it s happened. In the manner of every other authoritarian douchebag since the invention of mass communications, Donald Trump is now experimenting with state-run television.Now, he is having his daughter-in-law Lara Trump host a  real news  program (as opposed to all the  FAKE NEWS  organizations who insist on telling the truth about him) directly on his Facebook page.", "GOP presidential nominee Donald Trump has taken a ridiculously hardline   and even bigoted   stance on immigration. He has promised to build a wall and force Mexico to pay for it, and he has said that he will erect  deportation forces  to root out and get rid of all people in the United States without proper documentation.", "Former Senator Jim DeMint speaks up in the WSJ about the obscene salaries the higher ups at PBS and NPR are getting:When presidents of government-funded broadcasting are making more than the president of the United States, it s time to get the government out of public broadcasting.While executives at the Public Broadcasting Service (PBS) and National Public Radio (NPR) are raking in massive salaries, the organizations are participating in an aggressive lobbying effort to prevent Congress from saving hundreds of millions of dollars each year by cutting their subsidies.The so-called commercial free public airwaves have been filled with pleas for taxpayer cash. The Association of Public Television Stations has hired lobbyists to fight the cuts.", "So far, the Supreme Court has not prevented one single unconstitutional act committed by Obama. Is there any reason to believe they will stop the invasion of illegals to save America and the American worker?The Supreme Court agreed Tuesday to review President Obama s plan to shield up to 5 million illegal immigrants from deportation, after lower courts blocked the president s sweeping executive actions from taking effect.The decision sets up an election-year clash over the controversial plan that many Republicans have likened to  amnesty.", "Here is a portion of the interview that was conducted by a group of journalists and Pope Frances today:Vatican Insider    I leaned out to greet the children and didn t see the glass, and  pum! The Pope with a smile and an obvious dark bruise framing his left cheek, answers the question on how he feels after the small accident that happened to him in Cartagena.", "HUGE NEWS: The head coach of the University of Michigan s football team just tweeted that the football team WILL watch  American Sniper. Coach Harbaugh made his remarks in defiance of the university and the Muslim Student Association   who canceled an upcoming screening of the film.", "A new poll of New Hampshire voters could show an alarming collapse for Senator Marco Rubio. The poll, conducted by a pro-John Kasich super PAC, may change the trajectory of the 2016 Republican presidential campaign.The poll, conducted by the pro-John Kasich New Day for America Super PAC, shows Rubio plummeting to fourth place in the primary here, with 10 percent of the vote.", "Never mind that almost every single aspect of the phony Mizzou controversy has been proven to be a hoax. For these entitled trophy kids, they will never have enough Campus activists in America showed their true faces during an international tragedy last night: they are the selfish, spoiled children we always knew they were.Black Lives Matter and Mizzou protesters responded to the murder of scores of people in Paris at the hands of Islamic extremists by complaining about losing the spotlight and saying their  struggles  were being  erased.", "Patrick Henningsen  21st Century WireWhat s up with the millennials? The Clinton campaign may have felt a jolt after seeing the front page headline from this morning s Wall Street Journal which read, Millennials Have Cooled on Hillary Clinton, Forcing a Campaign Reset.", "Via: TMZ", "For the first time since 1988, Latinos will be totally shut out from having any role in an administration.Despite the fact that Latinos make up 17 percent of the population in the United States, Trump apparently does not want them anywhere near him or his presidency, which makes it clear that he intends to treat them like second-class citizens over the next four years. We re extremely worried.", "We know where Obama s been and what he s doing for crying out loud BUT Jeh Johnson thinks Americans don t have TV s or computers to see the news. OBAMA HAS PLAYED GOLF EVERY DAY FOR 9 DAYS!", "TODAY IS  SCHEDULE YOUR MAMMOGRAM DAY  WITH PLANNED PARENTHOOD   PP LIES TO THE AMERICAN PEOPLE SO WE THINK IT S IMPORTANT TO CALL THEM OUT ON THE FACTS: They DO NOT perform mammograms!Please call your local Planned parenthood clinic and ask if you can schedule your mammogram with them   Do it today! A few years ago, Cecile Richards went on television and said that if Planned Parenthood was defunded, women would lose access to services  such as mammograms.", "Donald Trump doesn t have much foreign policy experience, but he loves his golf courses, especially the ones overseas. He s no longer associated with Miss Universe, but surely that prepared him for foreign policy and running a country, just as his golf courses in Scotland did.", "21st Century Wire says..With Christmas season right around the corner, millions retail consumers in North America and Western Europe will be taking on thousands of dollars in new credit card debt. Few have paused to ponder how it all started, and where the real breaking point lies  for both personal and social stability.", "Apparently being the daughter of the most corrupt political couple in America comes with some pretty significant financial benefits Politico reported last year:When Hillary Clinton s speaking fees proved too steep for one public university last year, school officials reached for a less expensive alternative: her daughter, Chelsea.According to a report from The Washington Post, representatives from the former secretary of state s office gave officials at the University of Missouri-Kansas City a $275,000 quote for a one-time speaking fee. Yikes!", "The word  crooked  doesn t only apply to Hillary. Sadly, America is finding out that there are very few people in positions of power who we can trust.", "Donald Trump is in bed with the Russians and he knows it. Why else would he hide his taxes and claim that he has never met Putin despite once claiming that he had?Earlier this week, reports began surfacing about the Republican nominee s various ties to Russian oligarchs who are aligned with Vladamir Putin, which only gained more credibility after experts found that the hackers who broke into the DNC and stole emails came from Russia.Many of Trump s own campaign advisers also have close ties to Russia and Putin has directed the state-owned media to support Trump s campaign.", "The entire Trump White House is all about cracking down on leaks that make them look bad, but perhaps Kellyanne Conway didn t get that memo. At a party on Friday night, Politico reports that she was overheard making a series of less-than-savory comments about a few things to reporters, including something Trump told her about James Comey and whether tapes of his conversations in the White House exist.", "It s becoming increasingly clear that when TLC decided to promote a story of the fundamentalist Christian Duggar family, they weren t just idolizing right-wing anti-gay bigots, they were legitimizing a toxic cult that for years had lived in the shadows and now   thanks to increasing exposure   has begun to fester and grow. Quiverfull,  the fundamentalist movement run by a man named Vaughn Ohlman, works to silence and control women in ways that wouldn t seem entirely out of place in regions controlled by the Taliban.", "MARK STEYN ON TRUMP S MOVE LAST NIGHT:   @MarkSteynOnline pic.twitter.com/CM21gVlFWW  FOX & friends (@foxandfriends) April 7, 2017Gen. Jack Keane said this is a  major setback  for Russia and Iran, close allies of the regime of Syrian President Bashar-al Assad.", "Just when you find yourself wondering if the world has gone completely mad you read a story like this that confirms that indeed, it has Gov. Jerry Brown is allowing parole for a transgender inmate who is trying to force California to become the first state to pay for sex reassignment surgery.A federal judge in April ordered the state to provide the surgery, which had been scheduled for July.", "Try telling a young black girl she can t wear dreadlocks to school  A Utah School has told a teenage student she can t wear dreadlocks to school, and now the mom is claiming discrimination. Except the student is lily-white.The Lincoln Academy in Pleasant Grove reprimanded eighth-grader Caycee Cunningham for wearing dreadlocks to school, saying it violates the school s dress code.", "Donald Trump is so far-out and detached from reality that even Fox News has had enough. After declaring, three months out, that the election will be rigged to favor  crooked  Hillary Clinton, the public knew exactly what was going on   Trump is already preparing for a loss.But even though Trump has shown he can t lose with grace, media outlets are not letting him get away with the insane assertion that an entire national election, which requires the participation of all 50 states to work, will somehow be  stolen  from him.And Fox News may have delivered the most brutal smackdown of this assertion.In a recent op-ed, Julie Roginsky, who runs a crisis management firm, slammed Trump for lacking the  patriotism to put his country and its institutions ahead of his own ego  and delegitimizing the American electoral process:Never in modern history has the loser of a presidential election challenged the legitimacy of our national elections.", "samstag  november  asterixcomics wegen verherrlichung von doping aus dem handel genommen berlin archiv  ist das das aus für die unbeugsamen gallier wie der ehapaverlag am mittwoch mitteilte werden alle bände der beliebten asterixreihe von autor rené goscinny und zeichner albert uderzo umgehend aus dem handel genommen damit reagiert der verlag auf eine untersuchung der nationalen antidoping agentur deutschland nada die jahrelanges flächendeckendes doping bei den beliebten comicfiguren nachweisen konnte bereits ende letzter woche hatte die nada entsprechende ergebnisse veröffentlicht demnach konnten die kontrolleure die verwendung einer euphemistisch als zaubertrank bezeichneten substanz in allen heften nachweisen mit hilfe des berüchtigten dopingarztes miraculix aka der druide sollen somit sämtliche der schlachten und prügelergebnisse der gallier gegen römische patrouillen feldlager und legionen ganz offenkundig und ungeniert manipuliert worden sein unsportlich von einem fairen wettkampf keine spur wir befürchten dass durch die verherrlichung des dopingmittels als zaubertrank ohne nebenwirkungen die hemmschwelle für den konsum leistungssteigernder substanzen sinkt heißt es in einer erklärung der agentur gerade jüngere leser seien gefährdet besonders erschütternd ein charakter soll gar als kind in das dopingmittel gefallen sein und seitdem über übermenschliche kräfte verfügen beim ehapaverlag gibt man sich derweil zerknirscht und lässt die zukunft der beliebten comics offen zwar sei ein cleaner neustart der reihe in planung so ein sprecher des verlages doch ob der neue band asterix und die zerstörung des kleinen dorfs durch selbstverständlich haushoch überlegene römer am ende tatsächlich den weg in deutsche buchhandlungen finde sei noch nicht sicher dan khi idee khi fotos ehapaverlag hinweis erstmals erschienen am  artikel teilen", "Bravo Sheriff Clarke! Registered Democrat Sheriff David Clarke is the only person in a position of authority in law enforcement who is brave enough to call the Black Lives Matter movement what it truly is.", "Well this is no surprise but it s still wrong. Targeting conservative Americans or ANY American should be a crime.Lois Lerner will not face criminal charges for targeting conservative and Tea Party groups during her time at the Internal Revenue Service, the Department of Justice said Friday.CNN reported that the Justice Department will not bring charges against Lerner, who served as the director of exempt organizations at the IRS, and will close its two-year investigation into the alleged improper targeting.The government agency said in a letter to Congress that investigators found  substantial evidence of mismanagement, poor judgment, and institutional inertia leading to the belief by many tax-exempt applicants that the IRS targeted them based on their political viewpoints.", "montag  november  autobahnprivatisierung linke spur bald nur noch für premiummautzahler berlin dpo  die bundesregierung plant die privatisierung deutscher autobahnen nun wurde bekannt dass großinvestoren wie versicherungen und banken bereits konkrete pläne haben wie deutschlands fernstraßen profitabler werden die spur ganz links darf bald nur noch von autofahrern genutzt werden die eine erhöhte pkwmautgebühr maut premium bezahlen für autobahnkunden die sich nur den günstigen mautbasictarif leisten wollen oder können ändert sich nicht viel erklärt sandra bauske die sprecherin des investorenkonsortiums das sich an der privaten autobahngesellschaft des bundes beteiligen will sie müssen lediglich auf die spur ganz links verzichten überholmanöver seien für sie weiterhin möglich sobald die autobahn über drei oder mehr spuren verfüge die nutzung der linken spur jedoch ist nach der privatisierung ausschließlich jenen autobahnkunden vorbehalten die bereit sind den fünfmal so teuren mautpremiumtarif zu bezahlen da sich vermutlich nur wenige pkwfahrer diesen exklusiven luxus leisten werden ist mit deutlich kürzerer reisezeit zu rechnen die investoren sprechen von einem königlichem überholvergnügen und kündigten bereits an straßenschäden auf der premiumspur besonders schnell auszubessern fahrer die nur maut basic gezahlt haben und trotzdem die spur ganz links nutzen müssen mit empfindlichen strafen rechnen überwacht wird das system durch ein netz aus überwachungskameras und sensoren die jedes unbefugte überfahren der premiumlinie registrieren ungeklärt ist noch wie an baustellen an denen sich die fahrbahn auf eine spur verengt verfahren wird derzeit prüfe man ob es legal ist basickunden in solchen fällen auf feld und waldwege neben der fahrbahn umzuleiten damit premiumzahler nicht unnötig ausgebremst werden ssi dan foto m shutterstock artikel teilen", "Shawn Helton 21st Century WireFor the second time this week, Las Vegas police officials and the FBI have revised significant timeline details associated with the Las Vegas mass shooting. What does this latest change mean?", "21st Century Wire says Our weekly documentary film curated by our editorial team at 21WIRE.Aside from the collapse of WTC Building 7, a major achilles heel in the official 9/11 version of events is tale of a passenger airliner hitting the Pentagon. The following independent investigative documentary may offer some key insight into this incident, and depending on whether you believe its findings are credible   may even prove beyond a doubt that no Boeing passenger airliner struck the Pentagon on September 11, 2001.To date, it remains one of the most compelling presentations illustrating what happened, or more precisely   what did not happen on 9/11.", "What kind of monsters teach their children to behave like this? Young illegal  dreamers  and their parents flip off Trump supporters while yelling expletives you would expect to hear in a prison, and not from young boys who look to be between the ages of 8 and 12.", "George Zimmerman, the infamous neighborhood watchman/violent wannabe cop who murdered unarmed black teen Trayvon Martin is in the news again, and as usual, it is for nothing good. Showing once more that he has absolutely zero remorse regarding the fact that he killed an unarmed teenage boy who was carrying nothing but Skittles and a can of iced tea, Zimmerman is now auctioning off the gun he used to kill Martin for more fame and money.However, Zimmerman s efforts to sell the murder weapon have been quite rocky.", "Last December a report surfaced that Barack Obama intercepted communications between Israeli Prime Minister Benjamin Netanyahu and US lawmakers. The Obama White House targeted Netanyahu because he opposed their insane nuclear deal with the Iranian regime.Last October Obama ordered Secretary of State John Kerry and UN Ambassador Samantha Power to snub Netanyahu at the UN.Lower level US State Department officials attended the Israeli Prime Minister s speech at the UN.The Obama administration spent $350,000 trying to oust Israeli Prime Minister Benjamin Netanyahu from office.In May 2011 Barack Obama urged Israel to hand over half of Jerusalem, the Wailing Wall, The Temple Mount, Old Jerusalem, and the tomb of Jesus Christ to the Hamas-Fatah terrorist organizations.In his deluded mind, handing over ancient Christian and Jewish holy sites to violent Islamists will bring peace to the region.In December 2013, Barack Obama again urged Israel to hand over ancient Christian and Jewish holy sites to Islamist terrorists.", "Corey Lewandowski got some good news last week when the state s attorney for Palm Beach, Florida announced that he was dropping the charges against him and is now saying he is ready to move on. But don t expect Trump s abusive campaign manager to admit he did something wrong or apologize for it.Lewandowski appeared on Fox News Sunday, and Chris Wallace asked if he had any intention of apologizing to Michelle Fields: In the interest of avoiding unnecessary litigation, which I know Republicans don t like, are you prepared here and now to apologize to Ms. Fields for touching her and for saying that she was delusioned?", "Donald Trump s White House mouthpiece just desecrated an American civil rights icon to defend a racist.Back in 1986, Coretta Scott King wrote a letter in opposition to Ronald Reagan s nomination of Jeff Sessions to a federal judgeship. The widow of Martin Luther King Jr. condemned Sessions for his track record on voting rights and implored Republicans to reject him.", "Donald Trump thinks if he rage-tweets about NFL players who choose to kneel instead of stand during the national anthem as a form of silent protest against racial injustice and police brutality, it will all go away but by doing that, he inadvertently highlights that there is a problem. The former reality show star dropped a racial slur yesterday in front of Native American heroes, then today, he jumped on Twitter to yell at black people.", "Normally, the thought of listening to Coldplay is the stuff of nightmares, just behind spooning with Sarah Palin and spending more than 20 seconds staring at Ted Cruz s face. But something is happening that, for a few seconds, might just make what would normally be an act of self-torture tolerable: Coldplay has announced that the President s moving rendition of  Amazing Grace  will be included on their next album.The band s frontman, Chris Martin, says the singing voice of President Barack Obama will make an appearance on upcoming album,  A Head Full of Dreams,  which is due to be released next month.", "Former Republican presidential candidate Jeb Bush has been forced to deny a claim that he ordered the outlandish  dirty dossier  on President-elect Donald Trump.The BBC initially named Bush, one of Trump s opponent in the 2016 Republican primary, as having enlisted the services of Washington-based political research firm FusionGPS to look into Trump s business dealings.FusionGPS later hired ex-MI6 spy Christopher Steele to dig further into Trump s connections with Russia. He (Steele) was compiling this report on behalf of initially Trump s opponent Jeb Bush,  the BBC said on Wednesday.", "Months into his presidency, Donald Trump seems to have finally realized that it was probably not the greatest idea to install a prominent white supremacist media guy on the National Security Council. According to Bloomberg White House reporter Jennifer Jacobs, The Donald made a few changes to the Council   most notably Bannon s removal:NEW: Trump National Security Council reorganization:-removed Bannon-downgraded Bossert-elevated Coats and Dunford-McMaster sets agenda.", "Sean Hannity told a massive lie to make Donald Trump look like a hero and he got busted for it by real journalists.In May, the Fox News host published an article on his website claiming that the Republican nominee sent his planes to give transportation home to 200 United States Marines who were stranded at Camp Lejeune in North Carolina in 1991 after they returned from the Gulf War. Trump even touted the story of his supposed generosity and heroics.", "Donald Trump is all about free speech, as long as it means that he can verbally abuse anyone who gets in his way without having to pay consequences. Unfortunately, for Trump, though, the media, whose job it is to vet presidential candidates, isn t always sympathetic to his verbal tirades and his twitterrhea.", "You can t have people walking around with guns says the husband of the woman who wants to be your next president Sunday on CNN s  State of the Union,  former President Bill Clinton told CNN s Jake Tapper that the Baltimore and Ferguson civil unrest is a result of too many,  people walking around with guns  combined with a lack community trust.Clinton said,  The Baltimore thing came on the heels of what happened in Ferguson, what happened in New York City and all these other places. And their is a big national movement about whether the lives of young African-American men count.", "DEMOCRAT GOVERNOR Andrew Cuomo just pardoned 18 illegals who were facing immigration enforcement actions because of prior criminal charges. He says his pardon was based on their rehabilitation efforts.", "Bernie Sanders supporters have been in an uproar about the Democratic National Committee s rules for primaries, specifically the use of  superdelegates. A superdelegate is someone chosen by the party to represent their interests in a given state.", "Twenty-year-old Palestinian Mohammad  Abu Khalaf was shot multiple times by Israeli occupation police in Occupied East Jerusalem on Friday, in what witnesses and a video from the incident show was an execution of the young man.Watch Video Here:https://www.facebook.com/aljazeerachannel/videos/10154110984474893/An Al-Jazeera crew said that Abu Khalaf had tried to stab an occupation policeman when soldiers shot him with two rounds. Abu Khalaf then fell to the ground and was incapacitated and bleeding.", "On Monday, what has unfortunately become a routinely occurrence at Donald Trump rallies has happened yet again: a black protester was violently attacked by one of the Republican front runner s insane racist fans.The incident happened at a rally in Albany, NY and was posted to social media by The Daily Gazette s Kate Seckinger. In the short clip, a group of protesters were being confronted by several of Trump s loyal fans when things suddenly got out of hand and took a turn for the worst.", "It s no secret that people are furious over the fact that CNN hired Donald Trump s former campaign manager, Corey Lewandowski, just three days after he was fired from his position in Trump s presidential campaign. CNN felt the full force of the outrage during a panel discussion on CNN s Reliable Sources.Before the panel discussion began, host Brian Stelter launched into the controversy surrounding Lewandowski s hiring.", "A  We The People  petition was started on July 6TH, asking the government to  formally designate Black Lives Matter as a terrorist organization . The White House requires that the person or group who initiates a petition on their  We The People  petition page must gather at least 100,000 signatures in 30 days.", "Sarah Sanders hit back at Senator Corker today:  Imagine progress that could be made if Corker cooperated instead of grandstanded This isn t the first time Sanders has admonished Senator Corker. In August of this year, Sanders responded to comments against President Trump by Corker: White House press secretary Sarah Huckabee Sanders ripped Republican Tennessee Sen. Bob Corker s questioning of Trump s  stability  and  competence  on Thursday, calling Corker s claim  ridiculous and outrageous.", "Once again President-elect Donald Trump has dominated the media by doing something incredibly dumb. After whining about the recount effort by Green Party candidate Jill Stein on Twitter, Trump kept the pity party going by whining about how he lost the popular vote.But of course, Trump is so delirious that he had to come up with an excuse for why he d lost by over 2 million votes.", "While in Virginia, GOP presidential nominee Donald Trump looked at the crowd in Loudoun County and told them how economically devastated the area was. Donald was going to be their savior and heal the apocalyptic economy in Loudoun County.", "President Obama on ISIS: They re  a bunch of killers with good social media. They are dangerous and they ve caused great hardship to   an overwhelming majority of people.", "This maniac wants  The Handmaid s Tale  to become reality.Abortion is protected by the constitution in this country. But a Wisconsin lawmaker thinks that women should be forced to get pregnant and give birth.Wisconsin state GOP Rep. Scott Allen made the horrendous remarks while criticizing a bill that would block state employees from covering abortion with their health insurance.Because he doesn t think the bill goes far enough.Seriously.Allen pitched his idea to force women to give birth, and tried to justify his idea by claiming that forcing women to give birth will somehow help the economy.", "This literally made me scream at my television in rage.If there is one person who has been more hypocritical than Donald Trump throughout this election year, it s Kellyanne Conway.Time and time again, she has defended Trump s claims that the election is rigged and supported him when he incited his protesters to threaten violence when he refused to say that he would concede the election if the results didn t go his way.But there Conway was on Fox News on Sunday morning whining to Chris Wallace about anti-Trump protesters and painting Trump as an example of unity.After being asked about outgoing Senator Harry Reid s message that the responsibility for healing the nation rests at Donald Trump s feet because he divided the nation for a year and a half with bigoted and hateful rhetoric, Conway reacted like the total hypocritical bitch she is. I find Harry Reid s public comments and insults about Donald Trump and other Republicans to be beyond the pale.", "Is there some reason that the media feels the need to keep talking to Kellyanne Conway? One would think her time on the news shows was over when she called lies  alternative facts,  but no.", "Liberals on Twitter accused President Donald Trump s son Eric of sporting a  Nazi haircut  when he debuted a new hairdo Sunday.Eric Trump sported a new hairstyle with the side of his head shaved in an interview with Fox News. Trump s trendy new style is far from unusual: celebrities like Macklemore, David Beckham, Brad Pitt, and Adam Levine have all sported the same look.But in recent years, members of the alt-right, including white supremacist Richard Spencer, have also started wearing their hair the same way.", "Something was bothering Donald Trump as he made his victory speech after the election. The newly minted president-elect took the stage with at least 40 of his closest aides and allies, but according to a high-level campaign source familiar with Trump s thinking, New Jersey Gov.", "Isn t it unbelievable that these so-called experts get to spout off their hatred towards President Trump on a regular basis via MSNBC? This village idiot connects Mosque burnings to Trump when anyone with half a brain knows the Muslims are vandalizing their own Mosques (see below)!", "Donald Trump is truly pathetic.Trump has reportedly not been able to contact Steve Bannon since signing off on his firing on Friday.Calls for Bannon s removal only increased after Trump s refusal to condemn Nazis in the wake of the violence in Charlottesville, Virginia.So, Trump decided to reach out to Bannon on Twitter and thanked his top white supremacist deputy for his service. But Trump did more than just thank Bannon.Trump also insulted Hillary Clinton in a clear demonstration that he does not care about the civility associated with the office of the presidency.I want to thank Steve Bannon for his service.", "Donald Trump recently came out with his proposal for a new tax plan. Every politician comes out with his own plans and proposals, but Jimmy wondered if voters pay any attention to the specifics.", "Sarah Silverman and Bill Maher destroyed the so-called Fox Republican debates in what Maher described as  completely fact free. They both wondered why Hillary and Bernie couldn t debate the Republican candidates right now.", "Radio stations in multiple states have been playing YG s  Fuck Donald Trump  song ever since the man-baby s inauguration because of a hacker. Trolling level: expert.", "A Donald Trump supporter came up with the worst idea ever when he got it into his head that it would be a good idea to try to heckle Bernie Sanders at a Massachusetts campaign rally. Clearly he did not know what he was getting himself into.The heckler was wearing a Trump shirt, and holding a sign that said  Obama is as Christian as Bruce Jenner is a woman.", "Yes, this is real These Hillary supporters are officially a cult!Those looking to celebrate  Resist-mas  now have the perfect accessory: a Hillary Clinton tree topper.The newly-released 3D-sculpted ornament features the former first lady  in her iconic power suit with angelic wings. The tree topper sells for $107 for a standard-size tree and more than $900 for a tree taller than 10 feet.U.K.-based Women to Look Up To is selling the item, along with similar ones to honor Beyonce and Serena Williams:Celebrating Women On TopThe Christmas Angel, Fairy, Tree Topper, by whatever name you call her, is a woman from a bygone era; a woman made of no more than plastic and glitter.", "So let it be said so let it be done.I don t remember anyone asking if Americans were okay with the month of June being dedicated to homosexuality. How quickly we mere citizens have morphed into nothing more than serfs in King Hussein-Obama s kingdom LESBIAN, GAY, BISEXUAL, AND TRANSGENDER PRIDE MONTH, 2016BY THE PRESIDENT OF THE UNITED STATES OF AMERICAA PROCLAMATIONSince our founding, America has advanced on an unending path toward becoming a more perfect Union.", "We have to agree that this one is actually pretty good a rare bright spot on SNL!"]