["The minute hand on the alarm clock reached the number twelve and, at that precise moment, the street-lamp outside the window went out. Harry awoke as though the sudden darkness were an alarm. Hastily straightening his glasses and unsticking his cheek from the glass, he pressed his nose against the window instead and squinted down at the pavement.", "Merope was so white Harry felt sure she was going to faint. \"What's that?\" said Gaunt sharply, also in Parseltongue, looking from his son to his daughter.", ". in which case, I might well be safer a little closer to Albus. .", "Harry thought he saw it drop by a fraction - \nBut suddenly footsteps were thundering up the stairs and a second later Malfoy was buffeted out of the way as four people in black robes burst through the door on to the ram-parts. Still paralysed, his eyes staring unblinkingly, Harry gazed in terror upon four strangers: it seemed the Death Eaters had won the fight below. A lumpy-looking man with an odd lopsided leer gave a wheezy giggle.", ". But why have you not returned to Divination? For you, of all people, the subject is of the utmost importance!\"", "\"My God, what an eyesore!\" rang out a girl's voice, as clearly au-dible through the open window as if she had stood in the room be-side them. \"Couldn't your father have that hovel cleared away, Tom?\"", "\"I must say, I didn't approve at first, but they do seem to have a bit of a flair for business! Come on, dear, your trunks already up there.\" \"'Night, Mr. Weasley,\" said Harry, pushing back his chair.", "We've had time, haven't we?' 'We're with you whatever happens,' said Ron. 'But, mate, you're going to have to come round my mum and dad's house before we do anything else, even Godric's Hollow.'", "Narcissa looked up at him, her face eloquent with despair. \"Yes, Severus. I — I think you are the only one who can help me, I have nowhere else to turn.", "He was actually smiling now, and when the crowd greeted a particularly good save with a \nrousing chorus of the old favorite \"Weasley Is Our King,\" he pre-tended to conduct them from on high. \"Thinks he's something special today, doesn't he?\" said a snide voice, and Harry was nearly knocked off his broom as Harper collided with him hard and deliberately.", "How come? You left here early enough.\" \"Oh .", "\"Hepzibah Smith died two days after that little scene,\" said Dumbledore, resuming his seat and indicating that Harry should do the same. \"Hokey the house-elf was convicted by the Ministry of poisoning her mistress's evening cocoa by accident.\" \"No way!\"", "\"She could have got food and everything for herself by magic, couldn't she?\" \"Ah,\" said Dumbledore, \"perhaps she could. But it is my belief—I am guessing again, but I am sure I am right ?that when her husband abandoned her, Merope stopped using magic.", "\"I shouldn't think so, no,\" said Dumbledore quietly. \"But I'm jiggered if I know how he got up there to do it. All I know is he and Billy had argued the day before.", "Hoping to see you this Friday,\nI am, yours most sincerely,\nAlbus Dumbledore\nThough he already knew it by heart, Harry had been stealing glances at this missive every few minutes since seven o'clock that evening, when he had first taken up his position beside his bedroom window, which had a reasonable view of both ends of Privet Drive. He knew it was pointless to keep rereading Dumbledore's words; Harry had sent back his \"yes\" with the delivering owl, as requested, and all he could do now was wait: Either Dumbledore was going to come, or he was not. But Harry had not packed.", "\". . .", "\"But Ollivander was the best, and if the other side have got him it's not so good for us.\" The day after this rather gloomy birthday tea, their letters and booklists arrived from Hogwarts. Harry's included a surprise: he had been made Quidditch Captain.", "she said in an extra-refined voice. \"Thank you very much,\" said Dumbledore, beaming. It soon became clear that Mrs. Cole was no novice when it came to gin drinking.", "\"Slytherin's mark,\" he said quietly, as the light played upon an ornate, serpentine S. \n  \n\"That's right!\" said Hepzibah, delighted, apparently, at the sight of Voldemort gazing at her locket, transfixed. \"I had to pay an arm and a leg for it, but I couldn't let it pass, not a real treasure like that, had to have it for my collection.", "After a moment or two, the door was opened by a scruffy girl wearing an apron. \"Good afternoon. I have an appointment with a Mrs. Cole, who, I believe, is the matron here?\"", "I mean, I'm not saying that spell you used on Malfoy was great -' \n'Nor am I,' said Harry quickly. 'But he healed all right, didn't he? Back on his feet in no time.'", "Slughorn moved slowly among the tables, peering into cauldrons. He made no comment, but occasionally gave the potions a stir or a sniff. At last he reached the table where Harry, Ron, Hermione, and Ernie were sitting.", ". . kept for anyone?\"", "For a brief moment he allowed himself the impossible hope that nobody would answer him. However, a voice responded at once, a crisp, decisive voice that sounded as though it were reading a prepared statement. It was coming -- as the Prime Minister had known at the first cough -- from the froglike little man wearing a long silver wig who was depicted in a small, dirty oil painting in the far corner of the room.", "Do people usually give their house-elves Christmas presents?\" asked Harry, prodding the parcel cautiously. \"Hermione would,\" said Ron.", "As they vanished through the door, Harry realized he could move again. What was now holding him paralyzed against the wall was not magic, but horror and shock. He threw the Invisibility Cloak aside as the brutal-faced Death Eater, last to leave the tower top, was disappearing through the door.", ". . If she, with all her Ministry contacts and protection .", "\"But I still don't know why she'd be bursting into the castle to see Dumbledore, if that's re-ally why she was here.\" \"Goes back to what I said, doesn't it?\" said Ron, who was now shoveling mashed potato into his mouth.", ".\" The whistle sounded, Harry and the others kicked off hard from the frozen ground, and they were away. Harry soared around the perimeter of the grounds, looking around for the Snitch and keeping one eye on Harper, who was zigzagging far below him.", ". .\" \"Correct,\" said Dumbledore, now turning up a steep side street.", "Black's a known Muggle killer and may be planning to rejoin You-Know-Who.... But of course, you don't even know who You-Know-Who is!\" He had gazed hopelessly at the Prime Minister for a moment, then said, \"Well, sit down, sit down, I'd better fill you in... Have a whiskey...\"\nThe Prime Minister rather resented being told to sit down in his own office, let alone offered his own whiskey, but he sat nevertheless.", "Harry was thinking about Sirius, and how he had hated those silver goblets anyway. Hermione drummed her fingers on the table, her eyes flickering between Ron and the bar. The moment Harry drained the last drops in his bot-tle she said, \"Shall we call it a day and go back to school, then?\"", "\"Oh yes, I think so. Voldemort needed to create a means to cross the lake without attracting the wrath of those creatures he had placed within it in case he ever wanted to visit or remove his Horcrux.\" \"So the things in the water won't do anything to us if we cross in Voldemort's boat?\"", "You don't care whether I live or die, but you do care that I help you convince everyone you're winning the war against Voldemort. I haven't forgotten, Minister....\" \nHe raised his right fist. There, shining white on the back of his cold hand, were the scars which Dolores Umbridge had forced him to carve into his own flesh: I must not tell lies.", "Well, that just shows you, even Slughorn makes mistakes. I don't know whether Ron's told you in any of his letters ?it's only just happened ?but Arthur's been promoted!\" It could not have been clearer that Mrs. Weasley had been bursting to say this.", "You would succeed, of course you would, and he would reward you beyond all of us —\"\nSnape caught hold of her wrists and removed her clutching hands. Looking down into her tearstained face, he said slowly, \"He intends me to do it in the end, I think. But he is determined that Draco should try first.", "A little puzzled, Harry followed Dumbledore through the creaking door into a space a little smaller than the average cupboard. Dumbledore illuminated the tip of his wand, so that it glowed like a torch, and smiled down at Harry. \"I hope you will forgive me for mentioning it, Harry, but I am pleased and a little proud at how well you seem to be coping after everything that happened at the Ministry.", "Some people, perhaps, would say that there was little to choose between the two ways, but Dumble-dore knew — and so do I, thought Harry, with a rush of fierce pride, and so did my parents — that there was all the difference in the world. Chapter 24: Sectumsempra\nExhausted but delighted with his night's work, Harry told Ron and Hermione everything that had happened during next morning's Charms lesson (having first cast the Muffliato spell upon those nearest them). They were both satisfyingly impressed by the way he had wheedled the memory out of Slughorn and positively awed when he told them about Voldemort's Horcruxes and Dumbledore's promise to take Harry along, should he find another one.", "\"That's quite enough!\" said Madam Malkin sharply, looking over her shoulder for support. \"Madam — please —\" \n  \nNarcissa Malfoy strolled out from behind the clothes rack.", "\"...and evasive enchantments generally,\" concluded Hermione. \"Well, at least you know one lesson you'll be having this year, that's one more than Ron and me. I wonder when our OWL results will come?\"", ". he's a - a bit of a mess, that's all. Greyback attacked him.", "I've made my decision. Leave me alone!\" The woman named Narcissa gained the top of the bank, where a line of old railings separated the river from a narrow, cobbled street.", "Righ'.\" He stomped around, brewing up tea in his enormous copper kettle, muttering all the while. Finally he slammed down three bucket-sized mugs of mahogany-brown tea in front of them and a plate of his rock cakes.", "I did not know, for a very long time, the identity of the werewolf who had attacked me; I even felt pity for him, thinking that he had had no control, know-ing by then how it felt to transform. But Greyback is not like that. At the full moon, he positions himself close to victims, ensuring that he is near enough to strike.", "He didn't say. ...\" \n  \n\"Oh, he definitely wanted the Defense Against the Dark Arts job,\" said Dumbledore. \"The aftermath of our little meeting proved that.", "Lestrange, I want your essay by tomorrow or it's detention. Same goes for you, Avery.\" Slughorn pulled himself out of his armchair and carried his empty glass over to his desk as the boys filed out.", "\"Mr. Gaunt,\" said Ogden doggedly, \"I am afraid that neither your ancestors nor mine have anything to do with the matter in hand. I am here because of Morfin, Morfin and the Muggle he ac-costed late last night. Our information\" — he glanced down at his scroll of parchment — \"is that Morfin performed a jinx or hex on the said Muggle, causing him to erupt in highly painful hives.\"", "\"Dead,\" said the other. \"Died years ago, didn't he?\" Riddle frowned.", "If Dumbledore was right - and I'm sure he was -there are still four of them out there. I've got to find them and destroy them and then I've got to go after the seventh bit of Voldemort's soul, the bit that's still in his body, and I'm the one who's going to kill him. And if I meet Severus Snape \nalong the way,' he added, 'so much trie better tor me, so mucn the worse for him.'", "I was curious, 1 admit it, and not at all inclined to murder him the moment he set fool in the castle. \"Of course, it became apparent to me very quickly that he had no extraordinary talent at all. He has fought his way out of a number of tight corners by a simple combination of sheer luck and more talented friends.", "'It is my mercy, and not yours, that matters now.' Malfoy did not speak. His mouth was open, his wand hand still trembling.", "\"Just a laugh, Hermione, that's all!\" \"Dangling people upside down by the ankle?\" said Hermi-one.", "\"Is that like 'doctor'? What are you here for? Did she get you in to have a look at me?\"", "Hermione bade him good night and set off for the girls' dormitory. Harry, however, remained behind, taking a seat beside the fire and looking down into the dying embers. So Dumbledore had argued with Snape.", "curses flying everywhere . . .", "Apparently the Prince, like Hermione, had had no difficulty understanding it. 'Nothing,' said Harry gloomily. Hermione was now waving her wand enthusiastically over her cauldron.", "advising us all to unite in the face enemies, you know.\" “Dumbledore mentioned Voldemort at all?\" Not yet, but he always saves his proper speech for after the the feast doesn't he?", "The beautiful weather seemed to mock them; Harry could imagine how it would have been if Durnbledore had not died, and they had had this time together at the very end of the year, Ginny's examinations finished, the pressure of homework lifted ... and hour by hour, he put off saying the thing that he knew he must say, doing what he knew it was right to do, because it was too hard to forgo his best source of comfort. They visited the hospital wing twice a day: Neville had been discharged, but Bill remained under Madam Pomfrey's care. His scars were as bad as ever; in truth, he now bore a distinct resemblance to Mad-Eye Moody, though thankfully with both eyes and legs, but in personality he seemed jusi the same as ever.", "Ernie was looking rather grumpy; determined to outshine Harry for once, he had most rashly invented his own potion, which had curdled and formed a kind of purple dumpling at the bottom of his cauldron. Malfoy was already packing up, sour-faced; Slughorn had pronounced his Hiccuping Solution merely \"passable.\" ..;.", "\"Fantastic,\" said Harry bitterly, looking around at the hard floor. \"Really brilliant. Yeah, I would go and take it up with Dumbledore if he was here, because he's the one who wanted me to —\" \n  \n\"He is here,\" said a voice behind Harry.", "And speaking of getting shot of people,\" Harry added, getting to his feet and picking up his Firebolt, \"will you stop pretending to be asleep when Lavender comes to see you? She's driving me mad as well.\" \"Oh,\" said Ron, looking sheepish.", "\"And now for the very last recollection I have to show you, at least until you manage to retrieve Professor Slughorn's memory for us. Ten years separates Hokey’s memory and this one, ten years during which we can only guess at what Lord Voldemort was doing. .", ". . too dangerous.", "\"Nothing,\" said Ron, hastily looking away from the bar, but Harry knew he was trying to catch the eye of the curvy and attractive bar-maid, Madam Rosmerta, for whom he had long nursed a soft spot. \"I expect 'nothing's' in the back getting more firewhisky,\" said Hermione waspishly. Ron ignored this jibe, sipping his drink in what he evidently considered to be a dignified silence.", "barked the Prime Minister, now positively stamping up and down. \"Trees uprooted, roofs ripped off, lampposts bent, horrible injuries--\"\n\"It was the Death Eaters,\" said Fudge. \"He-Who-Must-Not-Be-Named's followers.", "\"Hi, Harry,\" said Parvati who, like Harry, looked faintly embarrassed and bored by the behavior of their two friends. \"Hi,\" said Harry, \"How're you? You're staying at Hogwarts, then?", "'Dumbledore wandless, Dumbledore alone! Well done, Draco, well done!' 'Good evening, Amycus,' said Dumbledore calmly, as though welcoming the man to a tea party.", "\"No, sir, of course not,\" said Riddle quickly. \"I'm sorry ... I didn't mean to offend .", "\"I dunno,\" said Fred, \"but there must be loads of people who'd like to poison Harry, mustn't there? 'The Chosen One' and all that?\" \"So you think Slughorn's a Death Eater?\"", ". .\" Harry woke with a start to find a bulging stocking lying over the end of his bed.", "I need a place to hide my book. ... \nThree times he walked up and down in front of the stretch of blank wall. When he opened his eyes, there it was at last: the door to the Room of Requirement.", ". . He thought fleetingly of trying to set something up with the D.A., but there again was the problem that people would be missed from lessons; most of them, after all, still had full schedules.", "\"What sort of time do you call this?\" \"I'm really sorry — I had to go out for something important —\" \n  \n\"Well, the password changed at midnight, so you'll just have to sleep in the corridor, won't you?\" \"You're joking!\"", "said Lupin incredulously. \"Dumbledore believed Snape was sorry James was dead? Snape hated James.", "But Voldemort continues to set store by the prophecy. He will continue to hunt you . .", "\"And guess who I ran into up there? Tonks!\" \"Tonks?\"", "asked Harry flatly. Scrimgeour looked annoyed but, as before, hastily modified his expression to one of sorrowful understanding. 'You are, of course, devastated,' he said.", "said Slughorn. 'And an extra ten points to Gryffindor for sheer cheek!' Still chuckling, he waddled back to his desk at the front of the dungeon.", "\"I know what yeh're like abou' Snape, Harry, an' I don' want yeh ter go readin' more inter this than there is.\" \"Look out,\" said Hermione tersely. They turned just in time to see the shadow of Argus Filch looming over the wall behind them before the man himself turned the corner, hunchbacked, his jowls aquiver.", "\"Well — you don't mind it's over, do you? \", \"No,\" Ron admitted. \"It was pretty bad while she was yelling, but at least I didn't have to finish it.\"", "You could just use your wand and then we'll be free \ntoo!\" \"No, I don't think we can do that,\" said Fred seriously. \"It's very character-building stuff, learning to peel sprouts without magic, makes you appreciate how difficult it is for Muggles and Squibs —\" \"— and if you want people to help you, Ron,\" added George, throwing the paper airplane at him, \"I wouldn't chuck knives at them.", "\"Nearly time/' said Harry blithely. The frosty grass crunched underfoot as they strode down to the stadium. \"Pretty lucky the weathers this good, eh?\"", "Harry, Hermione, and Ginny were sitting around him; they had spent all day waiting outside the double doors, trying to see inside whenever somebody went in or out. Madam Pomfrey had only let them enter at eight o'clock. Fred and George had arrived at ten past.", "He thought, like you, that I had turned from faithful Death Eater to Dumbledore's stooge. He was in a pitiable condition, very weak, sharing the body of a mediocre wizard. He did not dare reveal himself to a former ally if that ally might turn him over to Dumbledore or the Ministry.", "He knew it had worked before he opened his eyes: the smell of salt, the sea breeze had gone. He and Dumbledore were shivering and dripping in the middle of the dark High Street in Hogsmeade. For one horrible moment Harry's imagination showed him more Inferi creeping towards him around the sides of shops, but he blinked and saw that noth-ing was stirring; all was still, the darkness complete but for a few streetlamps and lit upper windows.", "\"Well,\" said Slughorn uncomfortably, \"you must understand that the soul is supposed to remain intact and whole. Splitting n it I an act of violation, it is against nature.\" \"But how do you do it?\"", "\"Maybe he preferred the Inquisitorial Squad,\" said Hermione. \"Maybe being a prefect seems a bit tame after that.\" \"I don't think so,\" said Harry.", "\"What is it, Professor?\" \"I rather think,\" said Dumbledore, putting his uninjured hand inside his robes and drawing out a short silver knife of the kind Harry used to chop potion ingredients, \"that we are required to make payment to pass.\" \"Payment?\"", "\"Dunno,\" said Harry, lying back on his bed fully clothed and staring blankly upwards. He felt no curiosity at all about R.A.B. : He doubted that he would ever feel curious again.", "Harry merely looked at Slughorn. Slughorn's watery eyes slid over Harry's scar, this time taking in the rest of his face. \"You look very like your father.\"", "You see -'\n'Dumbledore put you up to this,' whispered Slughorn. His voice had changed completely. It was not genial any more, but shocked, terrified.", "\"I think I know what the sixth Horcrux is. I wonder what you will say when I confess that I have been curious for a while about the behavior of the snake, Nagini?' \"The snake?\"", ". . .\"", "He pushed his trolley directly at the solid barrier, ignoring his silent companion, and found himself, a second later, standing on platform nine and three-quarters, where the scarlet Hogwarts Express stood belching steam over the crowd. Hermione and the Weasleys joined him within seconds. Without waiting to consult his grim-faced Auror, Harry motioned to Ron and Hermione to follow him up the platform, looking for an empty compartment.", "She had a sharp-featured face that appeared more anxious than unkind, and she was talking over her shoulder to another aproned helper as she walked toward Dumbledore. \". .", "Mrs. Cole's eyes slid out of focus and back again as she gazed intently at the blank paper for a moment. \"That seems perfectly in order,\" she said placidly, handing it back. Then her eyes fell upon a bottle of gin and two glasses that had certainly not been present a few seconds before.", "\"So Voldemort went off to Borgin and Burkes, and all the staff who had admired him said what a waste it was, a brilliant young wizard like that, working in a shop. However, Voldemort was no mere assistant. Polite and handsome and clever, he was soon given particular jobs of the type that only exist in a place like Borgin and Burkes, which specializes, as you know, Harry, in objects with unusual and powerful properties.", "\"The point is, Filch is being fooled isn't he? These girls are getting stuff into the school disguised as something else! So why couldn't Malfoy have brought the necklace into the school --?\"", ". .\" They were nearing a small, neat stone house set in its own garden.", "Harry pulled off his cloak, stuffed it into his pocket, and followed. The water was icy; Harry's waterlogged clothes billowed around him and weighed him down. Taking deep breaths that filled his nostrils with the tang of salt and seaweed, he struck out for the shimmering, shrinking light now moving deeper into the cliff.", "Cost: 12 Galleons. Harry and Ron joined the crowd that was jostling around the notice and taking it in turns to write their names at the bottom. Ron was just taking out his quill to sign after Hermione when Lavender crept up behind him, slipped her hands over his eyes, and trilled, \"Guess who, Won-Won?\"", "\"Oppugno!\" came a shriek from the doorway. Harry spun around to see Hermione pointing her wand at Ron, her expression wild: The little flock of birds was speeding like a hail of fat golden bullets toward Ron, who yelped and covered his face with his hands, but the birds attacked, pecking and clawing at every bit of flesh they could reach.", "\"I shall tell you, Harry, when you have retrieved that memory from Professor Slughorn,\" said Dumbledore. \"When you have that last piece of the jigsaw, everything will, I hope, be clear ... to both of us.\" Harry was still burning with curiosity and even though Dumbledore had walked to the door and was holding it open for him, he did not move at once.", "\"Cruc - \"\nBut Snape parried the curse, knocking Harry backward off his feet before he could complete it; Harry rolled over and scrambled back up again as the huge Death Eater behind him yelled, \"Incendio!\" Harry heard an explosive bang and a dancing orange light spilled over all of them: Hagrid's house was on fire. \"Fang's in there, yer evil - !\"", "\"No, I am a teacher,\" said Dumbledore. \"I have come to offer Tom a place at my school.\" \"What school's this, then?\"", "Fudge subsided into what was clearly an aggrieved silence, but it was broken almost immediately by the portrait, which suddenly spoke in its crisp, official voice. \"To the Prime Minister of Muggles. Requesting a meeting.", "\"I remember dear Gwenog telling me (Gwenog Jones, I mean, of course, Captain of the Holyhead Harpies) ?quot;\nHe meandered off into a long-winded reminiscence, but Harry had the distinct impression that Slughorn had not finished with him, and that he had not been convinced by Neville and Ginny. The afternoon wore on with more anecdotes about illustrious wizards Slughorn had taught, all of whom had been delighted to join what he called the \"Slug Club\" at Hogwarts. Harry could not wait to leave, but couldn't see how to do so politely.", "He moved forward and gave it an experimental push. The stone remained solid and unyielding. \"Okay,\" said Harry aloud.", "\"No, I was merely reading the Muggle magazines,\" said Dumbledore. \"I do love knitting patterns. Well, Harry, we have trespassed upon Horace's hospitality quite long enough; I think it is time for us to leave.\"", "He's already used you as bait once, and that was just because you're my best friend's sister. Think how much danger you'll be in if we keep this up. He'll know, he'll find out.", "Hagrid, becoming expan-sive under the influence of the drink and Slughorn's flattering in-terest, stopped mopping his eyes and entered happily into a long explanation of bowtruckle husbandry. The Felix Felicis gave Harry a little nudge at this point, and he noticed that the supply of drink that Slughorn had brought was running out fast. Harry had not yet managed to bring off the Re-filling Charm without saying the incantation aloud, but the idea that he might not be able to do it tonight was laughable: Indeed, Harry grinned to himself as, unnoticed by either Hagrid or Slug-liorn (now swapping tales of the illegal trade in dragon eggs) he pointed his wand under the table at the emptying bottles and they immediately began to refill.", "\"I don't want to find my own sister snogging people in public!\" \"This was a deserted corridor till you came butting in!\" said Ginny.", "\"What involvement?\" Fudge grimaced. \"He used giants last time, when he wanted to go for the grand effect,\" he said.", "I shall see you at Hogwarts.\" \"I think that will do,\" said the white-haired Dumbledore at Harry's side, and seconds later, they were soaring weightlessly through darkness once more, before landing squarely in the present-day office. \"Sit down,\" said Dumbledore, landing beside Harry.", ". not even 'the Chosen One.'\" \"That was brilliant, Harry!\"", "\"Hermione, if you can ask 0111 McLaggen —\" \n  \n\"There's a difference,\" said Hermione with dignity. \"I've got no plans to tell Ron anything about what might, or might not, have happened at Keeper tryouts.\" \"Good,\" said Harry fervently.", "McLaggen had been shouting criticism at Ginny for allowing the Quaffle out of her possession, with the result that he had not noticed the large red ball soaring past his right ear. \"McLaggen, will you pay attention to what you're supposed to be doing and leave everyone else alone!\" bellowed Harry, wheeling around to face his Keeper.", "There had to be an explanation for Malfoy's periodic disappearances, but he simply could not think what it could be. The best way of finding out would be to tail him, bur even with the Invisibility Cloak this was an impractical idea; he had lessons, Quidditch practice, homework and Apparition; he could not follow Malfoy around school all day wilhout his absence being remarked upon, \n'Ready?' he said to Ron.", "He clambered up them, water streaming from his soaking clothes, and emerged, shivering uncontrollably, into the still and freezing air. Dumbledore was standing in the middle of the cave, his wand held high as he turned slowly on the spot, examining the walls and ceiling. \"Yes, this is the place,\" said Dumbledore.", "He could not stop himself dwelling upon Dumbledore's inexcusable trust in Snape ... but as Hermione had just inadvertently reminded him, he, Harry, had been taken in just the same ... in spite of the increasing nastiness of those scribbled spells, he had refused to believe ill of the boy who had been so clever, who had helped him so much ... Helped him ... it was an almost unendurable thought, now ... \n'I still don't get why he didn't turn you in for using that book,' said Ron. 'He must've known where you were getting it ali from.'", "\"Kreacher,\" finished Dumbledore. \"Kreacher wont, Kreacher won't, Kreacher wont!\" croaked the house-elf, quite as loudly as Uncle Vernon, stamping his long, gnarled feet and pulling his ears.", "\"Really brilliant. Yeah, I would go and take it up with Dumbledore if he was here, because he's the one who wanted me to —\" \n  \n\"He is here,\" said a voice behind Harry. \"Professor Dumbledore returned to the school an hour ago.\"", "\"Did you see him lumbering off in the wrong direc-tion on his fifth? Looked like he'd been Confunded. ...\" \nTo Harry's surprise, Hermione turned a very deep shade of pink at these words.", "'Step three,' called Twycross, 'and only when 1 give the com-mand ... lum on the spot, feeiing your way into nothingness, moving with deliberation 1. On my command, now ... one- 1 \nHarry glanced around again; lots of people were looking positively alarmed at being asked to Apparate so quickly. Harry tried to fix his thoughts on his hoop again; he had already forgotten what the three Ds stood for.", "'Got there at last, have you?' Malfoy taunted. There was another yell from below, rather louder than the last.", "\"He was talking about my mum and dad dying.\" \"Oh,\" said Slughorn, repressing a large belch. \"Oh dear.", "They turned out of the gates into the twilit, deserted lane to Hogsmeade. Darkness descended fast as they walked and by the time they reached the High Street night was falling in earnest. Lights twinkled from windows over shops and as they neared the Three Broomsticks they heard raucous shouting.", "A great contentment stole over him; he grinned across at Ron, who grinned back lazily. \"Now then, now then, now then,\" said Slughorn, whose massive outline was quivering through the many shimmering vapors. \"Scales out, everyone, and potion kits, and don't forget your copies\nof Advanced Potion-Making.", "\"What did Ginny and Dean row about, Hermione?\" \"Oh, Dean was laughing about McLaggen hitting that Bludgu at you,\" said Hermione. \"It must've looked funny,\" said Ron reasonably.", "Hadn't he once, long ago, heard of bezoars? Hadn't Snape mentioned them in their first ever Potions lesson? 'A stone taken from the stomach of a goat, which will protect from most poisons.'", "\"Oh. Okay.\" And she withdrew, sliding the door closed behind her.", "\"Excellent on everything from boils to blackheads, but don't change the subject. Are you or are you not currently going out with a boy called Dean Thomas?\" \"Yes, I am,\" said Ginny.", ". .\" said Harry, as the scene in his mind's eye imploded.", "\"I don't really know what you mean, Minister.\" \"Well, of course, to you it will matter enormously,\" said Scrim-geour with a laugh. \"But to the Wizarding community at large .", ".\" \"That's right, Smith, he is,\" muttered Harry, grinning to him-self, as he dived amongst the Chasers with his eyes searching all around for some hint of the elusive Snitch. With half an hour of the game gone, Gryffindor were leading sixty points to zero, Ron having made some truly spectacular saves, some by the very tips of his gloves, and Ginny having scored four of Gryffindor's six goals.", "after all... well-designed,\" said Dum-bledore faintly. \"One alone could not have done it. ... You did well, very well, Harry.", "\"I am very touched, Harry.\" \"Scrimgeour wanted to know where you go when you're not at Hogwarts,\" said Harry, still looking fixedly at his knees. \"Yes, he is very nosy about that,\" said Dumbledore, now sounding cheerful, and Harry thought it safe to look up again.", "\"In other words, it doesn't matter to him if Draco is killed!\" \"The Dark Lord is very angry,\" repeated Snape quietly. \"He failed to hear the prophecy.", "\"That is--I don't know--is a man alive if he can't be killed? I don't really understand it, and Dumbledore won't explain properly--but anyway, he's certainly got a body and is walking and talking and killing, so I suppose, for the purposes of our discussion, yes, he's alive.\" The Prime Minister did not know what to say to this, but a persistent habit of wishing to appear well-informed on any subject that came up made him cast around for any details he could remember of their previous conversations.", "Shop's empty. No sign of a struggle. No one knows whether he left voluntarily or was kidnapped.\"", ". . .\"", "Maybe he's going a bit senile. Shame, my father always said he was a good wizard in his day. My father used to be a bit of a favorite of his.", "\"Go back, Bella!\" \"You must listen to me!\" \"I've listened already.", "His eyes were small and dark and stared in opposite directions. He might have looked comical, but he did not; the effect was frighten-ing, and Harry could not blame Ogden for backing away several more paces before he spoke. \"Er — good morning.", "\"We did like you told us: We checked the Marauder's Map and we couldn't see Malfoy on it, so we thought he must be in the Room of Requirement, so me, Ginny, and Neville went to keep watch on it... but Malfoy got past us.\" \"He came out of the room about an hour after we started keeping watch,\" said Ginny. \"He was on his own, clutching that awful shriveled arm -\"\n\"His Hand of Glory,\" said Ron.", "\"Sit down,\" said Dumbledore, landing beside Harry. Harry obeyed, his mind still full of what he had just seen. \"He believed it much quicker than I did ?I mean, when you told him he was a wizard,\" said Harry.", "When he opened his eyes, there it was at last: the door to the Room of Requirement. Harry wrenched it open, flung him self inside, and slammed it shut. He gasped.", "\"Very good. Personally, I am inclined to think that she used a love potion. I am sure it would have seemed more romantic to her, and I do not think it would have been very difficult, some hot day, when Riddle was riding alone, to persuade him to take a drink of water.", ". . .\"", ". . but no purpose can be served .", "\"I'm going to tell anyone who can put a stop to it, and Dumbledore’s top of the list. I might have another word with your dad too.\" \"Pity you didn't hear what Malfoy’s actually doing, though.\"", "How on earth was his government supposed to have stopped that bridge collapsing? It was outrageous for anybody to suggest that they were not spending enough on bridges. The bridge was fewer than ten years old, and the best experts were at a loss to explain why it had snapped cleanly in two, sending a dozen cars into the watery depths of the river below.", "He groped inside it and pulled out a sticky purple-and-orange sweet, which he recognized as a Puking Pastille. Smiling to himself, he rolled over and was instantly asleep. Seconds later, or so it seemed to Harry, he was awakened by what sounded like cannon fire as the door burst open.", ". . Of course, I wouldn't want to do anything insensitive if Hagrid is upset.", "\"Just one last thing, then.\" And he turned to speak to the Dursleys once more. \"As you will no doubt be aware, Harry comes of age in a years time —\"\n\"No,\" said Aunt Petunia, speaking for the first time since Dumbledore's arrival.", "\"There we were in Hogsmeade, waiting to surprise him —\" said George. \"You were in Hogsmeade?\" asked Ginny, looking up.", "\"But I thought I you might have the mouth organ or something.\" Dumbledore beamed at him, peering over the top of his hall' moon spectacles. \"Very astute, Harry, but the mouth organ was only ever a mouth organ.\"", "'Calamity. Disaster. Coming nearer all the time ...' \n'Right,' said Harry again.", ". ?\" Slughorn seemed agitated.", "You've got —-\"\n\"My mother's eyes, yeah.\" Harry had heard it so often he found it a bit wearing. \"Hmpf.", "\"Definitely not.\" \"Oh.\" Harry stared into the fire.", "\"We'll have them rounded up in no time--just thought you ought to know!\" And before the Prime Minister could shout, \"Now, wait just one moment!\" Fudge had vanished in a shower of green sparks.", ". . with Snapes history ... of course people were bound to wonder.", ". Loser's Lurgy ...\"\nBut Harry was still too angry to see much humor in the situation, and after a while Ron's snorts subsided. \"Ginny came in to visit while you were unconscious,\" he said, after a long pause, and Harry's imagination zoomed into overdrive, rapidly constructing a scene in which Ginny, weeping over his lifeless form, confessed her feelings of deep attraction to him while Ron gave them his blessing.", "one . . .\"", "Harry was too busy digesting the horrible idea of Inferi to have much attention left for anything else, but as they reached the front gate, Dumbledore stopped dead and Harry walked into him. \"Oh dear. Oh dear, dear, dear.\"", "\"Hi,\" said Ron nervously. \"C'mon,\" Harry muttered to Hermione, and they sped past, though not before they had heard Lavender say, \"Why didn't you tell me you were getting out today? And why was she with you?\"", "He could not have been here for only half an hour ... an hour ... an hour and a half. . .", "\"You are the Chosen One?\" . .", ". .\" The three of them made their way over to the other side of the room, scooping up goblets of mead on the way, realizing too late that Professor Trelawney was standing there alone.", ".\" \"You think he is mistaken? Or that I have somehow hoodwinked him?", "What's that you're holding, Potter?\" \"It's the thing she touched,\" said Harry. \"Good lord,\" said Professor McGonagall, looking alarmed as she took the necklace from Harry.", "Gaunt imitated Ogdens voice, making it pompous and singsong. Morfin cackled again. \"He taught a filthy Muggle a lesson, that's illegal now, is it?\"", "The exception sits before me,\" Dumbledore added, with a nod to Harry's scar. \"The Ministry, on the other hand, knew at once that this was a wizard's murder. They also knew that a convicted Muggle-hater lived across the valley from the Riddle house, a Muggle-hater who had already been imprisoned once for attacking one of the murdered people.", "\"The Dark Lord's initial displeasure at my lateness vanished entirely, 1 assure you, when I explained that 1 remained faithful, although Dumbledore thought I was his man. Yes, the Dark Lord thought that I had left him forever, but he was wrong.\" \"But what use have you been?\"", "\"I am weak...\" he said. \"Don't worry, sir,\" said Harry at once, anxious about Dumbledore's extreme pallor and by his air of exhaustion. \"Don't worry, I'll get us back.", ". .\" She reached out to take the locket back.", "Harry and the older Dumbledore followed. Before the front door had closed behind them, a skinny, harassed-looking woman came scurrying toward them. She had a sharp-featured face that appeared more anxious than unkind, and she was talking over her shoulder to another aproned helper as she walked toward Dumbledore.", "\" If you tell me what you are trying to do, I can assist you ...\" \n  \n\"I have all the assistance I need, thanks, I'm not alone!\" \"You were certainly alone tonight, which was foolish in the ex-treme, wandering the corridors without lookouts or backup, these are elementary mistakes —\" \n  \n\"I would've had Crabbe and Goyle with me if you hadn't put them in detention!\" \"Keep your voice down!\"", "He looked unnerved. \"Is there anything in that box that you ought not to have?\" asked Dumbledore.", "\"But of course.\" He stood back to allow her to pass him into the house. Her still-hooded sister followed without invitation.", "\"He appeared, according to the Baron, to be in good spirits, though a little tired, of course.\" \"Where is he?\" said Harry, his heart leaping,” \n  \n\"Oh, groaning and clanking up on the Astronomy Tower, it's a, favorite pastime of his —\" \n  \n\"Not the Bloody Baron — Dumbledore!\"", "Slughorn said nothing; he looked terrified. \"Be brave like my mother, Professor. .", ". kept for anyone?\" Mr. Borgin squinted at her.", "Mrs. Weasley turned away before she answered. \"No, he's busy, I expect, at the Ministry.\" \"Or he's the world's biggest prat,\" said Fred, as Mrs. Weasley left the kitchen.", "\"Well, Harry . . .", "No, listen to me!\" he hissed angrily, as both Ron and Hermione showed every sign of interrupting. 'I know it was Malfoy celebrating in the Room of Requirement.", "\"Stop! STOP!\" There was a loud bang and the bin behind Harry exploded; Harry attempted a Leg-Locker Curse that backfired off the wall be-hind Malfoy's ear and smashed the cistern beneath Moaning Myr-tle, who screamed loudly; water poured everywhere and Harry slipped as Malfoy, his face contorted, cried, \"Cruci —\" \n\"SECTUMSEMPRA!\"", "\"I expect Potter will be reunited with dear Sirius before I am reunited with Lucius.\" ' \n  \nHarry raised his wand higher. \"Harry, no!\"", "\"Cheer up, Ron!\" called Lavender. \"I know you'll be brilliant!\"", "\"Well, it was a bad night for romance all around. Ginny and Dean split up too, Harry.\" Harry thought there was a rather knowing look in her eye as she told him that, but she could not possibly know that his insides were suddenly dancing the conga.", "\"Very good, very good!\" said Slughorn happily. \"Now,\" he continued, pointing at the cauldron nearest the Ravenclaw table, \"this one here is pretty well known.", ".\" Hating himself, repulsed by what he was doing, Harry forced the goblet back toward Dumbledore's mouth and tipped it, so that Dumbledore drank the remainder of the potion inside. \"No ...\" he groaned, as Harry lowered the goblet back into the basin and refilled it for him.", "Certainly when Slughorn, who had been busy with decanters and glasses, turned to face the room again, his eyes fell immediately upon Harry. \"Hmpf,\" he said, looking away quickly as though frightened of hurting his eyes. \"Here —\" He gave a drink to Dumbledore, who had sat down without invitation, thrust the tray at Harry, and then sank into the cushions of the repaired sofa and a disgruntled silence.", "T should've shown the book to Dumbledore,' said Harry. 'All that lime he was showing me how Voldemort was evil even when he was at school, and 1 had proof Snape was, too -' \n'\"Evil\" is a strong word,' said Hermione quietly. 'You were the one who kept telling me the book was dangerous!'", ". . well...\" \n  \nHagrid's face darkened and Harry knew why: Tom Riddle had contrived to have Hagrid thrown out of school, blamed for opening the Chamber of Secrets.", "The glass of mead was now knocking quite insistently on the side of Vernon’s head; he attempted to beat it away. \"He's dead? His godfather?\"", "Do noth- ing else, speak to nobody else and do not remove your Cloak. I shall wait here.' 'But -' \n'You swore to obey me, Harry - go!'", "said Hermione, looking worried. \"Gotta see it from their point o' view,\" said Hagrid heavily. \"I mean, it's always bin a bit of a risk sendin a kid ter Hogwarts, hasn’ it?", "Wondered where you'd got to!\" Hermione slid off the desk. The little flock of golden birds con-tinued to twitter in circles around her head so that she looked like a strange, feathery model of the solar system.", "said Harry in frustration. \"I mean, where's he going when he disappears off the map?\" \"I dunno .", "Harry stared at her. With a sinking feeling, he too remembered the behavior of the Death Eaters at the Quidditch World Cup. Ron came to his aid.", "Harry, Ron, and Hermione exchanged looks, but before they could disabuse Hagrid of this comfortable notion, Mr. and Mrs. Weasley and Ginny appeared, all clutching heavy packages of books. \"Everyone all right?\" said Mrs. Weasley.", "\"They could be oh, in tin cans or, I dunno, empty potion bottles. . .", "Harry's heart was hammering so hard it seemed impossible that nobody could hear him standing there, imprisoned by Dumbledore's spell -if he could only move, he could aim a curse from under the Cloak - \n'Draco, do it, or stand aside so one of us -' screeched the woman, but at that precise moment the door to the ramparts burst open once more and there stood Snape, his wand clutched in his hand as his black eyes swept the scene, from Dumbledore slumped against the wall, to the four Death Eaters, including the enraged werewolf, and Malfoy. 'We've got a problem, Snape,' said the lumpy Amycus, whose eyes and wand were fixed alike upon Dumbledore, 'the boy doesn't seem able -' \nBut somebody else had spoken Snape's name, quite softly. 'Severus ...' \nThe sound frightened Harry beyond anything he had experienced all evening.", "\"What's this? Feelin' sorry for me? Reckon I'm lonely or summat?\"", "said Harry, aiming a hex from the floor at the enormous blond Death Eater who was causing most of the chaos. The man gave a howl of pain as the spell hit him in the face: He wheeled around, staggered, and then pounded away after the brother and sister. Harry scrambled up from the floor and began to sprint along the corridor, ignoring the bangs issuing from behind him, the yells of the others to come back, and the mute call of the figures on the ground whose fate he did not yet know.", "Scrimgeour glared at him for another moment, then turned and limped away without another word. Harry could see Percy and the rest of the Ministry delegation waiting for him, casting nervous glances at the sobbing Hagrid and Grawp, who were still in their seats. Ron and Hermione were hurry-ing towards Harry, passing Scrimgeour going in the opposite direction; Harry turned and walked slowly on, waiting for them to catch up, which they finally did in the shade of a beech tree under which they had sat in happier times.", "\"He's at perfect liberty to kiss whomever he likes,\" said Hermione, while the librarian , Madam Pince, prowled the shelves behind them. \"I really couldn't care less.\" She raised her quill and dotted an 'i' so ferociously that she punctured a hole in her parchment.", "want to rip Dean limb from limb for kissing her... No ... he would have to control that particular brotherly feeling. . .", "\"Hang on,\" said Harry, as another part of last night's conversation came back to him. \"I think Dumbledore said our OWL results would be arriving today!\" \"Today?\"", "he asked Ron through clenched teeth. \"Well, yeah I do,\" said Ron apologetically. \"Final score was three hundred and twenty to sixty.\"", "New Year's Eve and bitter cold, snowing, you know. Nasty night. And this girl, not much older than I was myself at the time, came staggering up the front steps.", "\"Well, all I can say is that it was a lucky clay for the Weasleys when Ron decided to sit in your compartment on the Hogwarts Expirv., Harry.\" Harry could not think of any reply to this and was almost gl.i?l when Madam Pomfrey reminded them that there were only supposed to be six visitors around Ron's bed; he and Hermione rose .h once to leave and Hagrid decided to go with them, leaving Ron with his family. \"It's terrible,\" growled Hagrid into his beard, as the three ol them walked back along the corridor to the marble staircase.", "\"I didn't know that could happen,\" said Harry. \"Nor did I,\" said Hermione, \"but I suppose if you're really depressed ...\"\nThe door opened again and Mrs. Weasley popped her head in. \"Ginny,\" she whispered, \"come downstairs and help me with the lunch.\"", ". . terrible,\" Hagrid grunted, and his great shaggy head rolled sideways onto his arms and he fell asleep, snoring deeply.", "\"Malfoy? He's sixteen, Harry! You think You-Know-Who would let Malfoy join?\"", ".\" \"And then Snape was there,\" said Tonks, \"and then he wasn't -\"\n\"I saw him running toward us, but that huge Death Eaters jinx just missed me right afterward and I ducked and lost track of things,\" said Ginny. \"I saw him run straight through the cursed barrier as though it wasn't there,\" said Lupin.", "\"Another ten points from Gryffindor,\" said Snape. \"I would ex-pect nothing more sophisticated from you, Ronald Weasley, the boy so solid he cannot Apparate half an inch across a room.\" \"No!\"", "He was just wondering whether there was any chance that she had not noticed Ron, that she had merely left the room because the party was a little too rowdy, when she said, in an unnaturally high-pitched voice, \"Ron seems to be enjoying the celebrations.\" \"Er . .", "\"My dad used it,\" said Harry. \"I saw him in the Pensieve, he used it on Snape.\" He tried to sound casual, as though this was a throwaway com-ment of no real importance, but he was not sure he had achieved the right effect; Lupins smile was a little too understanding.", "Erm . ..\n\"Doubtful that I would turn up?\" Dumbledore suggested shrewdly.", "For a split second, Harry hoped that he would not be able to touch the potion with the gob-let, but the crystal sank into the surface as nothing else had; when the glass was full to the brim, Dumbledore lifted it to his mouth. \"Your good health, Harry.\" And he drained the goblet.", "\"Fortescue and Ollivander went on holiday, did they?\" said Mrs. Weasley, firing up at once. \"If you think security's a laughing matter you can stay behind and I'll get your things myself—\" \n  \n\"No, I wanna come, I want to see Fred and George's shop!\"", "said Hermione, sounding startled. \"And so have you, Harry!\" \"When, History of Magic?", "\"Ah,\" said Harry. \"Well — you don't mind it's over, do you? \", \"No,\" Ron admitted.", "It leapt from its hiding place and up the bank. There was a flash of green light, a yelp, and the fox fell back to the ground, dead. The second figure turned over the animal with its toe.", "\"Yes, sir,\" said Riddle again. It was impossible to tell what he was thinking; his face remained quite blank as he put the little cache of stolen objects back into the cardboard box. When he had finished, he turned to Dumbledore and said baldly, \"I haven't got any money.\"", "And turning his back on the Minister of Magic, he strode back toward the house. Chapter 17: A sluggish memory\n\n\nLate in the afternoon, a few days after New Year, Harry, Ron, and Ginny lined up beside the kitchen fire to return to Hogwarts. The Ministry had arranged this one-off connection to the Floo Network to return students quickly and safely to the school.", "He met an invisible barrier that prevented him coming within an inch of it. No matter how hard he pushed, his fingers encountered nothing but what seemed to be solid and flexible air. \"Out of the way, please, Harry,\" said Dumbledore.", "It might paralyze me, cause me to forget what I am here for, create so much pain I am dis-tracted, or render me incapable in some other way. This being the case, Harry, it will be your job to make sure I keep drinking, even if you have to tip the potion into my protesting mouth. You understand?\"", "'Yes,' said Harry, 'but I haven't got a licence.' He felt it best to be honest; what if he spoiled everything by turning up a hundred miles from where he was supposed to go? 'No matter,' said Dumbledore, 'I can assist you again.'", "'I'm not scared!' said Harry at once, and it was perfectly \n  \ntrue; fear was one emotion he was not feeling at all. 'Which Horcrux is it?", "Harry thought there was a rather knowing look in her eye as she told him that, but she could not possibly know that his insides were suddenly dancing the conga. Keeping his face as immobile and his voice as indifferent as he could, he asked, \"How come?\" \"Oh, something really silly .", "When Ginny had arrived, all three of them trooped out of McGonagall's office and off toward Gryffindor Tower. Harry glanced out of the corridor windows as they passed; the sun was already sinking over grounds carpeted in deeper snow than had lain over the Burrow garden. In the distance, he could see Hagrid feeding Buckbeak in front of his cabin.", "By the time they had got dressed, padding themselves out with several of Mrs. Weasleys hand-knitted sweaters and carrying, cloaks, scarves, and gloves, Ron's shock had subsided and he had decided that Harry's new spell was highly amusing; so amusing, in fact, that he lost no time in regaling Hermione with the story as they sat down for breakfast. \"... and then there was another flash, of light and I landed on the bed again!\" Ron grinned, helping himself to sausages.", "He sounded a little bitter, and perhaps realized it, for he smiled more warmly as he went on, \"I am not complaining; it is necessary work and who can do it better than I? However, it has been difficult gaining their trust. I bear the unmistakable signs of having tried to live among wizards, you see, whereas they have shunned normal society and live on the margins, stealing — and sometimes killing — to eat.\"", "And a Death Eater's dead, he got hit by a Killing Curse that huge blond one was firing off everywhere - Harry, if we hadn't had your Felix potion, I think we'd all have been killed, but everything seemed to just miss us -\"\nThey had reached the hospital wing. Pushing open the doors, Harry saw Neville lying, apparently asleep, in a bed near the door. Ron, Hermione, Luna, Tonks, and Lupin were gathered around another bed near the far end of the ward.", "... Dumbledore could not have died. ... He leapt the last ten steps of the spiral staircase and stopped where he landed, his wand raised.", "Why did you stop the Dark Lord procuring the Sorcerer's Stone? Why did you not return at once when the Dark Lord was reborn? Where were you a few weeks ago when we battled to retrieve the prophecy for the Dark Lord?", "They had drawn level with the only shop in Knockturn Alley that Harry had ever visited, Borgin and Burkes, which sold a wide variety of sinister objects. There in the midst of the cases full of skulls and old bottles stood Draco Malfoy with his back to them, just visible beyond the very same large black cabinet in which Harry had once hidden to avoid Malfoy and his father. Judging by the movements of Malfoy's hands, he was talking animatedly.", "The Fat Lady was snoozing and not pleased to be woken, but swung forward grumpily to allow them to clamber into the mercifully peaceful and empty common room. It did not seem that people knew about Ron yet; Harry was very relieved: He had been interrogated enough that day. Hermione bade him good night and set off for the girls' dormitory.", "\"No, Professor, he told Borgin to keep it in the shop for him —\" \n\"But Harry,\" Hermione interrupted, \"Borgin asked him if he wanted to take it with him, and Malfoy said no —\" \n\"Because he didn't want to touch it, obviously!\" said Harry angrily. \"What he actually said was, 'How would I look carrying that down the street?'\"", "I didn't. . .\"", ". yes. ..\" said Madam Pomfrey, who seemed to have been counting Hagrid as several people due to his vastness.", "\"Help yourself, Tom,\" said Hepzibah, \"I know how you love my cakes. Now, how are you? You look pale.", "Two days ago Arkie Philpott had a Probity Probe stuck up his ... Well, trust me, this way's easier.\" \"Thanks, Bill,\" said Harry, pocketing his gold. '\"E is always so thoughtful,\" purred Fleur adoringly, stroking Bill's nose.", "Did she get you in to have a look at me?\" He was pointing at the door through which Mrs. Cole had just left. \"No, no,\" said Dumbledore, smiling.", "I don't think he's in his bed ...' \nRon did not answer; he was too busy unwrapping presents, every now and then letting out an exclamation of pleasure. 'Seriously good haul this year!' he announced, holding up a heavy gold watch with odd symbols around the edge and tiny moving stars instead of hands.", "\"Yes,\" came Mr. Weasley's weary voice. \"But I would say that even if I were a Death Eater, dear. Ask the question!\"", "\"Tonight,\" he told Ron and Hermione, once he had unrolled it. \"Nice commentary last match!\" said Ron to Luna as she took back the green onion, the toadstool, and the cat litter.", "\"The idea, as I am sure you will have gathered, is that your enemy must weaken him- or herself to enter. Once again, Lord Voldemort fails to grasp that there are much more terrible things than physical injury.\" \"Yeah, but still, if you can avoid it .", "He would not risk his friendship with Ron for anything. He punched his pillow into a more comfortable shape and waited for sleep to come, trying his utmost not to allow his thoughts to stray anywhere near Ginny. Harry awoke next morning feeling slightly dazed and confused by a series of dreams in which Ron had chased him with a Beater’s bat, but by midday he would have happily exchanged the dream Ron for the real one, who was not only cold-shouldering Ginny and Dean, but also treating a hurt and bewildered Hermione with an icy, sneering indifference.", "New pictures adorned the walls, many of them showing people who appeared to be in pain, sporting grisly injuries or strangely contorted body parts. Nobody spoke as they settled down, looking around at the shadowy, gruesome pictures. \"I have not asked you to take out your books,\" said Snape, closing the door and moving to face the class from behind his desk; Hermione hastily dropped her copy of Confronting the Faceless back into her bag and stowed it under her chair.", "\"And what will become of those whom you command? What will happen to those who call themselves — or so rumor has it — the Death Eaters?\" Harry could tell that Voldemort had not expected Dumbledore to know this name; he saw Voldemort’s eyes flash red again and the slitlike nostrils flare.", "asked Dumbledore. \"I think he must be,\" said Mrs. Cole, frowning slightly, \"but it's very hard to catch him at it. There have been incidents.", "\"I hope you will forgive me for mentioning it, Harry, but I am pleased and a little proud at how well you seem to be coping after everything that happened at the Ministry. Permit me to say that I think Sirius would have been proud of you.\" Harry swallowed; his voice seemed to have deserted him.", "\"The Imperius Curse?\" Harry suggested. \"Or a love potion?\"", "Lavender was waiting beside the portrait hole, a complication Harry had not foreseen. 'You're lace, Won-Won!' she pouted.", "Harry crushed his bean with the flat side of the dagger. To his astonishment, it immediately exuded so much juice he was amazed the shriveled bean could have held it all. Hastily scooping it all into the cauldron he saw, to his surprise, that the potion immediately turned exactly the shade of lilac described by the textbook.", "\"I meant Hagrid to get the message,\" said Tonks, frowning. \"Hagrid was late for the start-of-term feast, just like Potter here, so I took it instead. And incidentally,\" said Snape, standing back to allow Harry to pass him, \"I was interested to see your new Patronus.\"", ". and didn't that girl say Katie got it in the girls' bathroom?\" \"She said she came back from the bathroom with it, she didn't necessarily get it in the bathroom itself—\" \n\"McGonagall!\"", "\"Slytherins!\" yelled Gaunt. \"Salazar Slytherin's!", "Squeezing herself in between Harry and Ron, Lavender flung her arms around Ron's neck. \"Hi, Harry,\" said Parvati who, like Harry, looked faintly embarrassed and bored by the behavior of their two friends. \"Hi,\" said Harry, \"How're you?", ". . Will you speak to him, persuade him — ?\"", "He did not seem to be at the Slytherin table in the Great Hall, eating breakfast ... he was nowhere near Snape, who was sitting in his study ... he wasn't in any of the bathrooms or in the hospital wing ... \n'Want one? 1 said Ron thickly, holding out a box of Chocolate Cauldrons. 'No thanks,' said Harry, looking up.", "He shrugged and spread his hands wide, as though to say that age had its compensations, and Harry noticed a ring on his uninjured hand that he had never seen Dumbledore wear before: It was large, rather clumsily made of what looked like gold, and was set with a heavy black stone that had cracked down the middle. Slughorn's eyes lingered for a moment on the ring too, and Harry saw a tiny frown momentarily crease his wide forehead. \"So, all these precautions against intruders, Horace ... are they for the Death Eaters' benefit, or mine?\"", ". .\" His eyes lingered for a moment upon Harry's trainers.", "They're the Chocolate Cauldrons Romilda gave me before Christmas and they're all spiked with love potion!' But only one word of this seemed to have registered with Ron. 'Romilda?'", "Harry hurried after her into the corridor. She pulled open the train door and leapt onto the platform, which seemed to be sliding underneath them as the train gathered momentum. He followed her, staggered a little on landing, then straightened up in time to see the gleaming scarlet steam engine pick up speed, round the corner, and disappear from view.", "\"Fudge told you everything?\" he asked, striding over to the door and tapping the keyhole with his wand. The Prime Minister heard the lock click.", "\"I might have ?er ?moved on to bigger and better things.\" Crouched in the luggage rack under his cloak, Harry's heart began to race. What would Ron and Hermione say about this?", "\"Is it true?\" said Gaunt in a deadly voice, advancing a step or two toward the terrified girl. \"My daughter—pure-blooded descendant of Salazar Slytherin — hankering after a filthy, dirt-veined Muggle?\"", "There were other reasons, I think. ... I hope to be able to demonstrate them to you in due course.", "Leaving Sloper in mid-sentence, he hurried away with Ron and Hermione, unrolling the parchment as he went. Dear Harry,\nI would like to start our private lessons this Saturday. Kindly come along to my office at 8 P.M.", "\"No, no, no! Haven't I just said your mother was one of my all-time favorite students? And there was Dirk Cresswell in the year after her too — now Head of the Goblin Liaison Office, of course — another Muggle-born, a very gifted student, and still gives me excellent inside information on the goings-on at Gringotts!\"", "said Hermione. \"We've risked a lot to help Hagrid out, but after all — Aragog's dead. If it were a question of saving him —\" \n  \n\"— I'd want to go even less,\" said Ron firmly.", "Instead they low-ered her to the ground where she thrashed and screamed, appar-ently unable to recognize any of them. Harry looked around; the landscape seemed deserted. \"Stay there!\"", "\"Oh, now,\" he went on quickly, seeing the expression on Harry's face and wagging a stubby ringer at him, \"don't go holding that against me! You'll be Gryffindor like her, I suppose? Yes, it usually goes in families.", "He swore they'd just gone exploring, but something happened in there, I'm sure of it. And, well, there have been a lot of things, funny things. .", "\"Well, quite,\" said Dumbledore, with a faint smile. \"And now it is time to hear from Hokey the house-elf, who worked for a very old, very rich witch by the name of Hepzibah Smith.\" Dumbledore tapped a bottle with his wand, the cork flew out, and he tipped the swirling memory into the Pensieve, saying as he did so, \"After you, Harry.\"", ". . Hogsmeade?\"", "Sometimes Bill and Mr. Weasley brought home news before it even reached the paper. To Mrs. Weasley’s displeasure, Harry's sixteenth birthday celebrations were marred by grisly tidings brought to the party by Remus Lupin, who was looking gaunt and grim, his brown hair streaked liberally with gray, his clothes more ragged and patched than ever. \"There have been another couple of dementor attacks,\" he announced, as Mrs. Weasley passed him a large slice of birthday cake.", "\"I've told you a million times. . .", "The match must have finished hours ago ... as had any hope of cornering Malfoy. Harry's head felt strangely heavy; he raised a hand and felt a stiff turban of bandages. \"What happened?\"", "\"Harry, this is so cool, you're my Captain — if you let me back on the team, I suppose, ha ha. . .", "Slowly, uncertainly, dressing-gowned people were creeping down the steps, looking around nervously for some sign of the Death Eaters who had fled into the night. Harry's eyes, however, were fixed upon the ground at the foot of the tallest tower. He imagined that he could see a black, huddled mass lying in the grass there, though he was really too far away to see anything of the sort.", "It was not an answer to the Golpalott problem, and had Snape still been their teacher, Harry would not have dared do it, but this was a moment for desperate measures. He hastened towards the store cupboard and rummaged within it, pushing aside unicorn horns and tangles of dried herbs until he found, at the very back, a small card box on which had been scribbled the word 'Bezoars'. He opened the box just as Slughorn called, Two minutes left, everyone!'", "barked Professor McGonagall. Everybody looked round. Malfoy had flushed a dull pink; he looked furious as he stepped away from Crabbe, with whom he appeared to have been having a whispered argu-ment.", "\"Yes, I think so.\" Harry did not say anything. His thoughts were all of water mon-sters, of giant serpents, of demons, kelpies, and sprites.", "You're staying at Hogwarts, then? I heard your parents wanted you to leave.\" \"I managed to talk them out o f it for the time being,\" said Parvati.", ". He pelted toward a shortcut, hoping to overtake the brother and sister and close in on Snape and Malfoy, who must surely have reached the grounds by now. Remembering to leap the vanishing step halfway down the concealed staircase, he burst through a tapestry at the bottom and out into a corridor where a number of bewildered and pajama-clad Hufflepuffs stood.", "\"Yes, of course,\" said Harry, slightly nonplussed. \"Why can't Ogden — ?\" But as his eyes found the dead snake on the door again, he sud-denly understood.", "said Harry, whose voice was shaking with the effort of keeping it steady. 'And isn't Voldemort convinced that Snape's on his side, even now? Professor ... how can you be sure Snape's on our side?'", "Harry could not bear to hear these things, nor did he think his resolution would hold if he remained sitting beside her. Ron, he saw, was now holding Hermione and stroking her hair while she sobbed into his shoulder, tears dripping from the end of his own long nose. With a miserable gesture, Harry got up, turned his back on Ginny and on Dumbledore's tomb and walked away around the lake.", "It spoke very clearly of loss and of despair. As he looked down into the wild faces of the singers he had the feeling that they, at least, were sorry for Dumbledore's passing. Then Ginny nudged him again and he looked round.", "\"Well. . .", "\"Billy Stubbs's rabbit. . .", "\"Yeah,\" said Harry, \"We're supposed to bring guests, so I thought you might like.. I mean...\" He was keen to make his intentions perfectly clear. \" I mean, just as friends, you know.", "An hour later they reluctantly left the sunlit common room for the Defense Against the Dark Arts classroom four floors below. Hermione was already queuing outside, carrying an armful of heavy books and looking put-upon. \"We got so much homework for Runes,\" she said anxiously when Harry and Ron joined her.", "'Ron? Breakfast.' 'I'm not hungry,' \nHarry stared ai him.", "A warmth was spreading through him that had nothing to do with the sunlight; a tight obstruction in his chest seemed to be dissolving. He knew that Ron and Hermione were more shocked than they were letting on, but the mere fact that they were still there on either side of him, speaking bracing words of comfort, not shrinking from him as though he were contaminated or dangerous, was worth more than he could ever tell them. \"...and evasive enchantments generally,\" concluded Hermione.", "he said. \"And Ron?\" \"He — he just failed,\" whispered Hermione, as Ron came slouching into the room looking most morose.", "Looking Slughorn straight in the eye, Harry leaned forward a little. \"I am the Chosen One. I have to kill him.", "For a time, he had tried to convince himself that Fudge had indeed been a hallucination brought on by lack of sleep during his grueling election campaign. In a vain attempt to rid himself of all reminders of this uncomfortable encounter, he had given the gerbil to his delighted niece and instructed his private secretary to take down the portrait of the ugly little man who had announced Fudge's arrival. To the Prime Minister's dismay, however, the portrait had proved impossible to remove.", "Nobody paid her any attention except Ginny, who whispered, \"Shh! Listen!\" Gulping, Madam Pomfrey pressed her fingers to her mouth, her eyes wide.", "Ginny's voice trembled a little. \"We don't really know what the aftereffects will be - I mean, Greyback being a werewolf, but not transformed at the time.\" \"But the others .", ". . Try and soften Slughorn up a bit then!\"", "\"Sir,\" Harry began, but Slughorn immediately glanced over his shoulder; when he saw that the room was empty but for himself and Harry, he hurried away as fast as he could. \"Professor — Professor, don't you want to taste my po — ?\" called Harry desperately.", "\"Step two,' said Twycross, 'focus your determination to occupy the visualised space! Let your yearning to enter it flood from your mind to every particle of your body!' Harry glanced around surreptitiously.", "He looked wary. \"Is that like 'doctor'? What are you here for?", "Four hundred and fifty to a hundred and forty! We won!\" Harry looked around; there was Ginny running toward him; she had a hard, blazing look in her face as she threw her arms around him.", "A ston room? A workshop? Harrys mind worked feverishly and his dreams, when he finally fell asleep, were broken and disturbed by images of Malfoy, who turned into Slughorn, who turned into Snape… \n  \nHarry was in a state of great anticipation over breakfast the following morning; he had a free period before Defense Against the Dark Arts and was determined to spend it trying to get into the Room of Requirement.", "Dumbledore had said to do it. ... Why not now? He fixed his eyes on his fork, which was gleaming in the sunlight streaming into his lap, and said, \"I don't know exactly why he's going to be giving me lessons, but I think it must be because of the prophecy.\"", "\"Are you telling me,\" said Hermione, \"that you're going to go back — ?\" \"And get the book? Yeah, I am,\" said Harry forcefully.", "Hastily straightening his glasses and unsticking his cheek from the glass, he pressed his nose against the window instead and squinted down at the pavement. A tall figure in a long, billowing cloak was walking up the garden path. Harry jumped up as though he had received an electric shock, knocked over his chair, and started snatching anything and everything within reach from the floor and throwing it into the trunk.", "One of the reasons why Harry would have pre-ferred not to have to ask Dean to play was that he knew Seamus would not like it. On the other hand, he had to do what was best for the team, and Dean had outflown Seamus at the tryouts. \"Well then, you're in,\" said Harry.", "Well, it appears that Rufus found a way to corner you at last.\" \"He accused me of being 'Dumbledore's man through and through.'\" \"How very rude of him.\"", "The Beaters, Peakes and Coote, were getting better all the time. The only problem was Ron. Harry had known all along that Ron was an inconsistent player who suffered from nerves and a lack of confidence, and unfortu-nately, the looming prospect of the opening game of the season seemed to have brought out all his old insecurities.", "\"Oh, something really silly . . .", "Dad and Dumbledore and all of them? They'll say Snape isn't really trying to help Malfoy, he was just trying to find out what Malfoy's up to.\" \"They didn't hear him,\" said Harry flatly.", "Hermione drummed her fingers on the table, her eyes flickering between Ron and the bar. The moment Harry drained the last drops in his bot-tle she said, \"Shall we call it a day and go back to school, then?\" The other two nodded; it had not been a fun trip and the weather was getting worse the longer they stayed.", "The crash, however, appeared to have awoken Ron and Hermione to Harry's presence. Hermione looked flustered and immediately started fussing about for her copy of “Flesh-Eating Trees of the World” to find out the correct way to juice Snargaluff pods; Ron, on the other hand, looked sheepish but also rather pleased with himself. \"Hand that over, Harry,\" said Hermione hurriedly.", "Harry shook his head again. Exactly what Hagrid would say when he realized his three favorite students had given up his subject, he did not like to think. Chapter 9: The Half-Blood Prince\n\n\nHarry and Ron met Hermione in the common room before breakfast next morning.", "Blood trickled down his chin and he licked his lips slowly, obscenely. 'But you know how much I like kids, Dumbledore.' 'Am I to take it that you are attacking even without the full moon now?", "\"No, 1 wouldn't,\" said Harry. \"Well, then, I shall have to see whether I can't find out by other means.\" \"You can try,\" said Harry indifferently.", "said Dumbledore, walking forward and holding out his hand. The boy hesitated, then took it, and they shook hands. Dumbledore drew up the hard wooden chair beside Riddle, so that the pair of them looked rather like a hospital patient and visitor.", ". Apparently she was now headmistress ... so the room behind the gargoyle was now hers. In silence they ascended the moving spiral staircase and entered the circular office.", ". . .\"", "Malfoy sat up very suddenly, knocking Pansy's hand aside. \"He invited Longbottom?.\" \"Well, I assume so, as Longbottom was there,\" said Zabini indifferently.", "And he knew, without knowing how he knew it, that ilie phoenix had gone, had left Hogwarts for good, just as Dumbledore had left the school, had left the world . . .", "Guess what?\" he added, turning to Harry. \"Malfoy s not doing prefect duty.", "He looked at Ron. \"You saved everything because you felt lucky. You did it all yourself.\"", ". . It's not r-really important.", "Dumbledore was humming quietly, apparently quite at his ease, but the atmosphere was thicker than cold custard, and Harry did not dare look at the Dursleys as he said, \"Professor — I'm ready now.\" \"Good,\" said Dumbledore. \"Just one last thing, then.\"", "Now listen to me! You are being incautious, wandering around at night, getting yourself caught, and if you are placing your reliance in assistants like Crabbe and Goyle —\" \n  \n\"They're not the only ones, I've got other people on my side, better people!\" \"Then why not confide in me, and I can —\" \n  \n\"I know what you're up to!", "What's wrong with him?\" \"No idea, but it's great for us,\" said Ginny brightly. \"They're playing Harper instead; he's in my year and he's an idiot.\"", "Where was Malfoy? He did not seem to be at the Slytherin table in the Great Hall, eating breakfast ... he was nowhere near Snape, who was sitting in his study ... he wasn't in any of the bathrooms or in the hospital wing ... \n'Want one? 1 said Ron thickly, holding out a box of Chocolate Cauldrons.", "Our information\" — he glanced down at his scroll of parchment — \"is that Morfin performed a jinx or hex on the said Muggle, causing him to erupt in highly painful hives.\" Morfin giggled. \"Be quiet, boy,\" snarled Gaunt in Parseltongue, and Morfin fell silent again.", "'Nobility of spirit' ... 'intel-lectual contribution' ... 'greatness of heart' ... it did not mean very much. It had little to do with Dumbledore as Harry had known him. He suddenly remembered Dumbledore's idea of a few words: 'nitwit', 'oddment', 'blubber' and 'tweak 1, and again, had to suppress a grin ... what was the matter with him?", "said Harry in relief, turning to see a round-faced boy struggling toward him. \"Hello, Harry,\" said a girl with long hair and large misty eyes, who was just behind Neville. \"Luna, hi, how are you?\"", "Pick it up, have a good look!\" whispered Hepzibah, and Voldemort stretched out a long-fingered hand and lifted the cup by one handle out of its snug silken wrappings. Harry thought he saw a red gleam in his dark eyes.", "\"My drink ... my pumpkin juice ... you didn't...?\" Harry raised his eyebrows, but said nothing except, \"We'll be starting in about five minutes, you'd better get your boots on.\" They walked out onto the pitch to tumultuous roars and boos.", "\"Because it would be quite as rude as kicking down the front door,\" said Dumbledore. \"Courtesy dictates that we offer fellow wizards the opportunity of denying us entry. In any case, most Wizarding dwellings are magically protected from unwanted Apparators.", "...\" \nAs they came into the castle they spotted Cormac McLaggen en-tering the Great Hall. It took him two attempts to get through the doors; he ricocheted off the frame on the first attempt. Ron merely guffawed gloatingly and strode off into the Hall after him, but Harry caught Hermione's arm and held her back.", "I am here because of Morfin, Morfin and the Muggle he ac-costed late last night. Our information\" — he glanced down at his scroll of parchment — \"is that Morfin performed a jinx or hex on the said Muggle, causing him to erupt in highly painful hives.\" Morfin giggled.", "'She keeps snogging you, doesn't she?' Ron blinked. 'Who are you talking about?'", ". nothing mattered except the end, the end of their pointless adventure, the end of Dumbledore's life. .", "\"I knew it — the maniac who likes attacking kids, the one Lupin told me about!\" said Harry angrily. Hermione looked at him bleakly.", "said Ron warningly. Harry looked up. Sure enough, Professor McGonagall was hur-rying down the stone steps through swirling sleet to meet them.", "\"Shall we assume that you have invited me into your sitting room?\" Dudley scrambled out of the way as Dumbledore passed him. Harry, still clutching the telescope and trainers, jumped the last few stairs and followed Dumbledore, who had settled himself in the armchair nearest the fire and was taking in the surroundings with an expression of benign interest.", "yelled Harry, who had found hint self trapped in the midst of a mass midair hug with the rest of tin1 team, but Ginny sped right on past them until, with an almighty crash, she collided with the commentators podium. As the crowd shrieked and laughed, the Gryffindor team landed beside the wreckage of wood under which Zacharias was feebly stirring,: Harry heard Ginny saying blithely to an irate Professor McGonagall, \"Forgot to brake, Professor, sorry.\" Laughing, Harry broke free of the rest of the team and hugged Ginny, but let go very quickly.", "Dear Harry,\nIf it is convenient to you, I shall call at number four, Privet Drive this coming Friday at eleven p.m. to escort you to the Burrow, where you have been invited to spend the remainder of your school holidays. If you are agreeable, I should also be glad of your assistance in a matter to which I hope to attend on the way to the . Burrow.", "He knew what he had to do; he had become most accomplished at it last year. Concentrating with all his might he thought, “I need to see what Malfoy's doing in here... I need to see what Malfoy's doing in here...", "Ron, whose hands and forearms still bore scratches and cuts from Hermione's bird attack, was taking a defensive and resentful tone. \"She can't complain,\" he told Harry. \"She snogged Krum.", "The common room was very crowded, as most people had finished dinner by now, but they managed to find a free table and sat down; Ron, who had been in a bad mood ever since the encounter with Slughorn, folded his arms and frowned at the ceiling. Hermione reached out for a copy of the Evening Prophet, which somebody had left abandoned on a chair. \"Anything new?\"", "\"Bed,\" said an undeceived Mrs. Weasley at once. \"I've got Fred and George's room all ready for you, you'll have it to yourself.\" \"Why, where are they?\"", ". \"But you didn't really trust him, sir, did you? He told me .", "\"The aftermath of our little meeting proved that. You see, we have never been able to keep a Defense Against the Dark Arts teacher for longer than a year since I refused the post to Lord Voldemort.\" Chapter 21: The Unknowable Room\nHarry wracked his brains over the next week as to how he was to persuade Slughorn to hand over the true memory, but nothing in the nature of a brain wave occurred and he was reduced to doing what he did increasingly these days when at a loss: poring over his Potions book, hoping that the Prince would have scribbled something useful in a margin, as he had done so many times before.", "His voice was light and conversational, but Harry saw him slip an inch lower down the wall as he said it. 'Yeah, I got the idea from them,' said Malfoy, with a twisted smile. 'I got the idea of poisoning the mead from the Mudblood Granger, as well, I heard her talking in the library about Filch not recognising potions ...' \n\n\n'Please do not use that offensive word in front of me,' said Dumbledore.", "'Everything went pitch black and the next thing I knew, I was being hurled headfirst out of the Room!' 'And you didn't see that coming?' said Harry, unable to help himself.", "\"Malfoy took something to Borgin and Burkes for repair?\" \"No, Professor, he just wanted Borgin to tell him how to mend something, he didn't have it with him. But that's not the point, the thing is that he bought something at the same time, and I think it was that necklace —\" \n\"You saw Malfoy leaving the shop with a similar package?\"", ". .\" And he walked away.", ". .\" \"Yes, sir,\" said Riddle.", "And I can't help but feel that, once you realize this, you might consider it, well, almost a duty, to stand alongside the Ministry, and give everyone a boost.\" The gnome had just managed to get hold of a worm. It was now tugging very hard on it, trying to get it out of the frozen ground.", "\"This was an unprovoked attack on a defenseless —\" \n\"Ar, I had you marked out as a Muggle-lover the moment I saw you,\" sneered Gaunt, and he spat on the floor again. \"This discussion is getting us nowhere,\" said Ogden firmly. \"It is clear from your son's attitude that he feels no remorse for his ac-tions.\"", "Before any of , them could say anything, before Mr. and Mrs. Weasley could do : more than exchange stunned looks, the back door opened and there stood Percy. There was a moment's painful silence. Then Percy said rather stiffly, \"Merry Christmas, Mother.\"", "\"She remembered putting something in her mistress's cocoa that turned out not to be sugar, but a lethal and little-known poison, said Dumbledore. \"It was concluded that she had not meant to do it, but being old and confused —\" \n  \n\"Voldemort modified her memory, just like he did with Morfin!\" \"Yes, that is my conclusion too,\" said Dumbledore.", "What is it you're after, Tom? Why not try an open request for once?\" Voldemort sneered.", "It was a command, and it sounded as though he had given it many times before. His eyes had widened and he was glaring at Dumbledore, who made no response except to continue smiling pleasantly. After a few seconds Riddle stopped glaring, though he looked, if anything, warier still.", "Nobody else was looking. Harry bent low to retrieve the book, and as he did so, he saw something scribbled along the bottom of the back cover in the same small, cramped handwriting as the instructions that had won him his bottle of Felix Felicis, now safely hidden inside a pair of socks in his trunk upstairs. This book is the property of the Half Blood Prince.", "\"Harry,\" said Hermione, \"how can you still stick up for that book when that spell —\" \n\"Will you stop harping on about the book!\" snapped Harry. \"The Prince only copied it out!", ". .\" \"Oh, come on,\" said Harry in exasperation, \"you can't get round this one!\"", "\"There's only one way to force someone to do what you want, and that's the Imperius Curse, which is illegal —\" \n  \n\"Yeah, I know that, thanks,\" said Harry, not looking up from the book. \"That's why I'm looking for something different. Dumbledorf says Veritaserum won't do it, but there might be something else, a potion or a spell.", "Sitting on one of the little spindle-legged tables that supported so many frail-looking silver instruments, was an ugly gold ring set with a large, cracked, black stone. \"Sir,\" said Harry, staring at it. \"That ring—\" \n\"Yes?\"", "Rumors continue to fly about the mysterious recent disturbance at the Ministry of Magic, during which He-Who-Must-Not-Be-Named was sighted once more. \"We're not allowed to talk about it, don't ask me anything\" said one agitated Obliviator, who refused to give his name as he left the Ministry last night. Nevertheless, highly placed sources within the Ministry have confirmed that the disturbance centered on the fabled Hall of Prophecy.", "\"But what does he want me for?\" asked Neville nervously, as though he was expecting detention. \"No idea,\" said Harry, which was not entirely true, though he had no proof yet that his hunch was correct.", "\"Hermione!\" shouted Harry and Ron; the breakfast tray slid to the floor with a crash. Hermione emerged, coughing, out of the smoke, clutching the telescope and sporting a brilliantly purple black eye.", "Scrimgeour turned slowly on the spot and exchanged an incredulous look with Fudge, who really did manage a smile this time as he said kindly, \"The trouble is, the other side can do magic too, Prime Minister.\" And with that, the two wizards stepped one after the other into the bright green fire and vanished. Chapter 2: Spinner's End\n\n\nMany miles away the chilly mist that had pressed against the Prime Minister's windows drifted over a dirty river that wound between overgrown, rubbish-strewn banks.", "\"Who wants eggnog?\" \"What have you been up to lately?\" Harry asked Lupin, as Mr, Weasley bustled off to fetch the eggnog, and everybody else stretched and broke into conversation.", "\"Oh yes,\" said Dumbledore, smiling slightly. \"I think you have earned that right.\" Harry felt his heart lift.", "'1 expect your trainers are too small, Won-Won,' said a voice behind them, and Hermione stalked past, smirking. '1 didn't feel anything,' said Harry, ignoring this inter-ruption. \"But 1 don't care about that now-' \n'What d'you mean, you don't care ... don't you want to leam to Apparate?'", ". Now, you first this time, and be careful not to touch the water.\" Dumbledore stood aside and Harry climbed carefully into the boat.", "\"You're actually disappointed, aren't you?\" Hermione shook her head, but Harry laughed. \"Well, we're N.E.W.T.", "\"Ask away, then, m'boy, ask away....\"\n\"Sir, I wondered what you know about. . .", "\"Brilliant,\" said Harry savagely. \"Really brilliant! When I get hold of McLaggen —\"\n\"You don't want to get hold of him, he's the size of a troll,\" said\nRon reasonably.", "I beg you. .. . You are the Dark Lord's favorite, his most trusted advisor.", "He's older'n you, now I think on it. ...\" \nMorfin looked slightly dazed and swayed a little, still clutching the edge of the table for support. \"He come back, see,\" he added stupidly.", "\"Come to think of it, it would be good to have both of you,\" said Harry. \"Okay then ... I want you to tail Draco Malfoy.\"", "His light gray eyes narrowed. \"If you're wondering what the smell is, Mother, a Mudblood just walked in,\" said Draco Malfoy. \"I don't think there's any need for language like that!\"", "\"Because he was doing detention with me. He has now failed to complete his Transfiguration homework twice in a row. So, thank you for telling me your suspicions, Potter,\" she said as she marched past them, \"but I need to go up to the hospital wing now to check on Katie Bell.", ". .\" he waited until the rest of the team were out of earshot before saying it, \"you're my best mate, but carry on treating the rest of them like this and I'm going to kick you off the team.\"", "Neville turned very pink and blinked confusedly; Professor McGonagall had never paid him a compliment before. \"I'm sorry, Longbottom, but I cannot let you into my N.E.W.T. class.", "\"Goes back to what I said, doesn't it?\" said Ron, who was now shoveling mashed potato into his mouth. \"She's gone a bit funny.", "As it was, I saw only greedy and unworthy Quirrell attempting to steal the stone and, I admit, I did all I could to thwart him.\" Bellatrix's mouth twisted as though she had taken an unpleasant dose of medicine. \"But you didn't return when he came back, you didn't fly back to him at once when you felt the Dark Mark burn —\"\n\"Correct.", "\"My answer has not changed.\" \"I should think not,\" said a snide voice; Phineas Nigellus was evidently only pretending to be asleep. Dumbledore ignored him.", "Harry bellowed. 'You insulted her, Harry! You said it was a joke!'", "\"Fifty-seventh time lucky, you think?\" said Harry bitterly. \"Lucky,\" said Ron suddenly.", "said a loud voice. Hagrid had come striding around the corner of his cabin wearing a large flowery apron and carrying a sack of potatoes. His enormous boarhound, Fang, was at his heels; Fang gave a booming bark and bounded forward.", "'As though it was celebrating?' 'Most definitely.' 'And then -?'", "\"If you need it to be unplottable, it will be.\" \"Dobby, have you managed to get in to have a look at what Malfoy's doing?\" said Harry eagerly.", "The police are baffled, you see.\" Fudge sighed. \"Well, of course they are,\" he said.", ". . and then I tried to grab it from her .", "\"I doubt very much that there is only one of them. Shall we walk on?\" \"Professor?\"", "does he?\" said Harry. \"Don't pretend you didn't see him,\" said Hermione.", "\"You will now divide,\" Snape went on, \"into pairs. One partner will attempt jinx the other without speaking. The other will attempt to repel the jinx in equal silence.", "\"Do you know what I think, Potter?\" said Snape, very quietly. \"I think that you are a liar and a cheat and that you deserve detention with me every Saturday until the end of term.", "And he turned to speak to the Dursleys once more. \"As you will no doubt be aware, Harry comes of age in a years time —\"\n\"No,\" said Aunt Petunia, speaking for the first time since Dumbledore's arrival. \"I'm sorry?\"", "\"Who was Bob Ogden?\" \"He was employed by the Department of Magical Law Enforce-ment,\" said Dumbledore. \"He died some time ago, but not before I had tracked him down and persuaded him to confide these recol-lections to me.", "\"That's my final decision and if you don't get out of the way of the Keepers I'll hex you,\" he bellowed. Neither of his chosen Beaters had the old brilliance of Fred and George, but he was still reasonably pleased with them: Jimmy Peakes, a short but broad-chested third-year boy who had managed to raise a lump the size of an egg on the back of Harry's head with a ferociously hit Bludger, and Ritchie Coote, who looked weedy but aimed well. They now joined Katie, Demelza, and Ginny in the stands to watch the selection of their last team member.", ". . .\"", ". . .", "Harry groaned. Meanwhile, Ron, who was attempting to burst the pod in the bowl by putting both hands on it, standing up, and squashing it as hard as he could, said angrily, \"And this is another party just for Slughorn's favorites, is it?\" \"Just for the Slug Club, yes,\" said Hermione.", "There was nothing, either broken or whole, that shouldn't have been there.\" \"Yeah, I know, I saw in the Prophet that you'd looked . .", "Yes, the Dark Lord is angry, Narcissa, very angry indeed.\" \"Then I am right, he has chosen Draco in revenge!\" choked Narcissa.", "Undoubtedly, Harry thought, watching him over the top of his own book, Malfoy was begrudging the time he could otherwise be spending in the Room of Requirement. Was it his imagination, or did Malfoy, like Tonks, look thinner! Certainly he looked paler; his skin still had that grayish tinge, probably because he so rarely saw daylight these days.", "\"He used giants last time, when he wanted to go for the grand effect,\" he said. \"The Office of Misinformation has been working around the clock, we've had teams of Obliviators out trying to modify the memories of all the Muggles who saw what really happened, we've got most of the Department for the Regulation and Control of Magical Creatures running around Somerset, but we can't find the giant--it's been a disaster.\" \"You don't say!\"", "'Look, hurry up, will you, there's something I want to do ...' \nPerplexed, Ron followed Harry back to Gryffindor Tower at a run. They were temporarily detained by Peeves, who had jammed a door on the fourth floor shut and was refusing to let anyone pass until they set fire to their own pants, but Harry and Ron simply turned back and took one of their trusted short cuts. Within five minutes, they were climbing through the portrait hole.", ". .\" In his mind's eye, he watched a parade of Crabbes and Goyles prance past, all transformed into girls.", "Chapter 7: The Slug Club\n\n\nHarry spent a lot of the last week of the holidays pondering the meaning of Malfoy's behavior in Knockturn Alley. What disturbed him most was the satisfied look on Malfoy's face as he had left the shop. Nothing that made Malfoy look that happy could be good news.", "Chapter 8:  Victorious Snape\n\nHarry could not move a muscle. He lay there beneath the _ Invisibility Cloak feeling the blood from his nose flow, hot and wet, over his face, listening to the voices and footsteps in the corridor beyond. His immediate thought was that someone, would surely, would check the compartments before the train departed again.", "The usual empty words, the usual slithering out of action . . .", "Next moment, they were both soaring weightlessly through darkness, until they landed squarely on their feet, back in Dumbledore's now twilit office. \"What happened to the girl in the cottage?\" said Harry at once, as Dumbledore lit extra lamps with a flick of his wand.", "People seemed to think that it might have been an accident, given that he had been in the Potions master's room at the time, and that as he had been given an antidote immediately there was no real harm done. In fact, the Gryffindors were generally much more interested in the upcoming Quidditch match against Hufflepuff, for many of them wanted to see Zacharias Smith, who played Chaser on the Hufflepuff team, punished soundly for his commentary during the opening match against Slytherin. Harry, however, had never been less interested in Quidditch; he was rapidly becoming obsessed with Draco Malfoy.", "What can he do about it?\" \"That's my point, I don't know!\" said Harry, frustrated.", "Did you do the necklace, that was stupid, it could have blown everything -\" But I haven't told him what I've been doing in the Room of Requirement, he's going to wake up tomorrow and it'll all be over and he won't be the Dark Lord's favourite any more, he'll be nothing compared to me, nothing!' 'Very gratifying,' said Dumbledore mildly. 'We all like* appreciation for our own hard work, of course ... but you must have had an accomplice, all the same ... someone in Hogsmeade, someone who was able to slip Katie the - the - aaaah \nDumbledore closed his eyes again and nodded, as though he was about to fall asleep.", "The great black lake, teeming with the dead ... It seemed hours and hours ago that he had met Professor Trelawney, that he had given Ron and Hermione Felix Felicis. .", "But even from above there was no mistaking that long, dirty-blonde hair, nor the necklace of butterbeer corks. . .", "said Pansy indignantly, ceasing grooming Malfoy at once. \"Well, you never know,\" said Malfoy with the ghost of a smirk. \"I might have ?er ?moved on to bigger and better things.\"", ". that had to mean \"nonverbal.\" Harry rather doubted he would be able to bring off this particular spell; he was still having difficulty with nonverbal spells, something Snape had been quick to comment on in every D.A.D.A.", "'Right,' he murmured, taking it back to bed with him, tap-ping it quietly and murmuring, 'I solemnly swear that I am up to no good,' so that Neville, who was passing the foot of his bed at the time, would not hear. 'Nice one, Harry!' said Ron enthusiastically, waving the new pair of Quidditch Keeper's gloves Harry had given him.", "\"I was very lucky to collect this,\" he said, as he poured the gleaming mass into the Pensieve. \"As you will understand when we have experienced it. Shall we?\"", "Now Harry came to think of it, he had not seen Dumbledore since their private lesson a week ago. \"I think he's left the school to do something with the Order,\" said Hermione in a low voice. \"I mean .", "it's not that easy, is it?\" said Ron. He paused.", ". . and so was Mrs. Weasley, who could cook better than anyone he knew.", "\"Is Mr. Weasley still at work?\" Harry asked. \"Yes, he is.", ". Especially what happened at : the Ministry ...\": \nHe waited for Harry to say something, but Harry did not oblige, : so he went on, \"I have been hoping for an occasion to talk to you ever since I gained office, but Dumbledore has — most under-standably, as I say — prevented this.\" Still, Harry said nothing, waiting.", "asked Ron, looking stunned. \"Yeah,\" said Harry, pulling his Invisibility Cloak out of his bag. \"I feel like it's the place to be tonight, you know what I mean?\"", "\"Oh, hi, Luna.\" - \"I went to the hospital wing to find you,\" said Luna, rummaging in her bag. \"But they said you'd left...\" \nShe thrust what appeared to be a green onion, a large spotted toadstool, and a considerable amount of what looked like cat litter into Ron's hands, finally pulling out a rather grubby scroll of parchment that she handed to Harry.", "said Hepzibah, waving a little hand. \"I've something to show you that I've never shown Mr. Burke! Can you keep a secret, Tom?", "\"Now you can give that graffitied copy back.\" \"Are you mad?\" said Harry.", "\"Well, yes, I'm sure,\" said Mrs. Weasley, \"but I thought perhaps - given how - how he -\"\n\"You thought I would not weesh to marry him? Or per'aps, you hoped?\" said Fleur, her nostrils flaring.", "Crabbe and Goyle were both sitting with their mouths open like gargoyles. Pansy was gazing down at Malfoy as though she had never seen anything so awe-inspiring. \"I can see Hogwarts,\" said Malfoy, clearly relishing the effect he had created as he pointed out of the blackened window.", "They turned just in time to see the shadow of Argus Filch looming over the wall behind them before the man himself turned the corner, hunchbacked, his jowls aquiver. \"Oho!\" he wheezed.", "He glanced up at Dumbledore and saw that he was wearing a satisfied expression. \"I, on the other hand, thought otherwise,\" said Dumbledore. \"Lord Voldemort has finally realized the dangerous access to his thoughts and feelings you have been enjoying.", ". . my dear boy .", "said Harry, tugging it out of her grip. She looked as though she might have a seizure; Hermione, who had hastily packed her things, grabbed Harry by the arm and frogmarched him away. \"She'll ban you from the library if you're not careful.", "\"Harry Potter!\" said Professor Trelawney in deep, vibrant tones, noticing him for the first time. \"Oh, hello,\" said Harry unenthusiastically.", ". . Dumbledore had told us that he would be leaving the school for a few hours and that we were to patrol the corridors just in case .", "Nobody answered. Harry looked over Hermione's shoulder and saw an unrecognizable face lying on Bill's pillow, so badly slashed and ripped that he looked grotesque. Madam Pomfrey was dabbing at his wounds with some harsh-smelling green ointment.", "The Ministry wasn't so keen to be pals last year.\" They stood in silence as icy as the ground beneath their feet. The gnome had finally managed to extricate his worm and was now sucking on it happily, leaning against the bottommost branches of the rhododendron bush.", "\"You did?\" said Harry, amused. \"Yeah .", "Bearing in mind that he has lived at the headquarters of the Order of the Phoenix for the past year?\" \"Won't, won't, won’t, won't —\"\nHarry stared at Dumbledore. He knew that Kreacher could not be permitted to go and live with Bellatrix Lestrange, but the idea of owning him, of having responsibility for the creature that had betrayed Sirius, was repugnant.", "I am yours to command.\" Dumbledore raised his eyebrows. \"And what will become of those whom you command?", "You know how these spells come and go. , . .\"", "'You are afraid to act until they join\nyou.'? 'I'm not afraid!' snarled Malfoy, though he still made no move to hurt Dumbledore.", "\"But they could be anywhere in the world — hidden — buried or invisible —\" \n  \n\"I am glad to see you appreciate the magnitude of the problem,\" said Dumbledore calmly. \"But firstly, no, Harry, not seven Hor-cruxes: six. The seventh part of his soul, however maimed, resides inside his regenerated body.", "\"D'you reckon this is safe to open?\" he asked. \"Can't be anything dangerous, all our mail's still being searched at the Ministry,\" replied Ron, though he was eyeing the parcel suspiciously.", "\"Ml this new security, an kids are still gettin' hurt. . .", "\"That's right,\" said Hermione. \"Personally, I thought she was a bit full of herself, but —\" \n\"Quite enough chat over here!\" said Professor Sprout briskly, bustling over and looking stern.", "Are you or are you not currently going out with a boy called Dean Thomas?\" \"Yes, I am,\" said Ginny. \"And last time I looked, he was definitely one boy, not five.", "Malfoy shot at him, oblivious to Harry standing right behind him. 'It's taking longer than I thought it would.' Crabbe opened his mouth, but Malfoy appeared to second-guess what he was going to say.", "\"The wandmaker?\" said Ginny, looking startled. \"That's the one.", "Pansy resumed the slow stroking of Malfoy s hair, looking dumbfounded. \"Do you mean —“\nMalfoy shrugged. \"Mother wants me to complete my education, but personally, I don't see it as that important these days.", "“That job's jinxed. No ones lasted more than a year. .", "Well, by turning to page ten of Advanced Potion Making. We have a little over an hour left to us, which should be time for you to make a decent attempt at the Draught of Living Death. I know it is more complex than anything you have attempted before, and I do not expect a perfect potion from anybody.", "I am pleased to say, however, that Dumbledore is growing old. The duel with the Dark Lord last month shook him. He has since sustained a serious injury because his reactions are slower than they once were.", ". Across the table, Ron was cursing fluently under his breath; his potion looked like liquid licorice. Harry glanced around.", "\"To know what really happened at the Ministry.\" said Harry. \"Him and everyone else here,\" sniffed Hermione.", "\"Oh, I've just escaped — I mean, I've just left Cormac,\" she said. \"Under the mistletoe,\" she added in explanation, as Harry continued to look questioningly at her. \"Serves you right for coming with him,\" he told her severely.", "\"I had no idea, Wormtail, that you were craving more dangerous assignments,\" said Snape silkily. \"This can be easily arranged: I shall speak to the Dark Lord--\"\n\"I can speak to him myself if I want to!\" \"Of course you can,\" said Snape, sneering.", "I mean,\" he added defensively, spinning the bowler hat still faster, \"all the evidence pointed--we had more than fifty eyewitnesses--but anyway, as I say, he's dead. Murdered, as a matter of fact. On Ministry of Magic premises.", "\"Who suspects me?\" said Malfoy angrily. \"For the last time, I didn't do it, okay?", "But would Lord Voldemort use tin cans or old potion bottles to guard his own precious soul? You are forgetting what I have showed you. Lord Voldemort liked to collect trophies, and he preferred objects with a powerful magical history His pride, his belief in his own superiority, his determination to carve for himself a startling place in magical history; these things, suggest to me that Voldemort would have chosen his Horcruxr with some care, favoring objects worthy of the honor.\"", "\"Loads of people go \nto Borgin and Burkes . . .", "All that day she seemed to be in a particularly good mood, and that evening in the common room she even consented to look over (in other words, finish writing) Harry's Herbology essay, something she had been resolutely refusing to do up to this point, because she had known that Harry would then let Ron copy his work. \"Thanks a lot, Hermione,\" said Harry, giving her a hasty pat on the back as he checked his watch and saw that it was nearly eight o'clock. \"Listen, I’ve got to hurry or I'll be late for Dumbledore.", "I am not proud of it, I was wrong, but there it is. ... If he had not forgiven we who lost faith at that time, he would have very few followers left.\"", ". . .", "she said stiffly. \"He only followed different instructions to ours,\" said Ron, \"Could've been a catastrophe, couldn't it? But he took a risk and it paid off.\"", ". . .", "\"Well, yeah,\" said Ron. He hesitated a moment, then said, \"Is Hermione really going out with McLaggen?\" \"I dunno,\" said Harry.", "'Prince, Hermione, Prince!' 'Right!' said Hermione, red patches blazing in her cheeks as she pulled a very old piece of newsprint out of her pocket and slammed it down on the table in front of Harry.", "\"We wanted to see you.\" \"We've missed you!\" said Hermione tremulously.", "\"Oh, yeah, that was fun, that was,\" said McLaggen. \"We went with Bertie Higgs and Rufus Scrimgeour ?this was before he became Minister, obviously ?quot;\n\"Ah, you know Bertie and Rufus too?\" beamed Slughorn, now offering around a small tray of pies; somehow, Belby was missed out.", "Harry frowned at her. \"Always jump to the worst conclusion, don't you?\" \"Was it?\"", "\"We all know you can't get enough of her.\" This seemed an odd comment to make about Ron's mother. Starting to feel that he was missing something, Harry said, \"Who are you ?", "\"I mean . . .", "Ron seemed to be positively lighthearted about the end of his relationship with Lavender, and Hermione seemed cheery too, though when asked what she was grinning about she simply said, \"It's a nice day.\" Neither of them seemed to have noticed that a fierce battle was raging inside Harry's brain: \n  \nShe's Rons sister. But she's ditched Dean!", "\"Sir, I wanted to ask you something.\" -' \"Ask away, then, m'boy, ask away. .", "Ron asked Hermione, who was perusing the Evening Prophet. Hermione winced at the forced toughness in his voice. 'No,' she said reprovingly, folding up ihe newspaper.", "But that's not the point, the thing is that he bought something at the same time, and I think it was that necklace —\" \n\"You saw Malfoy leaving the shop with a similar package?\" \"No, Professor, he told Borgin to keep it in the shop for him —\" \n\"But Harry,\" Hermione interrupted, \"Borgin asked him if he wanted to take it with him, and Malfoy said no —\" \n\"Because he didn't want to touch it, obviously!\" said Harry angrily.", ". . .", "\"Someone couldn’ have a grudge against the Gryfinndor Quidditch team, could they?\" said Hagrid anxiously. \"Firs' Katie, now Ron .", "\"Of course you can,\" said Snape, sneering. \"But in the meantime, bring us drinks. Some of the elf-made wine will do.\"", "Harry yelled, and lunging forward, he tipped the water clumsily over Dumbledores face. It was the best he could do, for the icy feeling on his arm not holding the cup was not the lingering chill of the water. A slimy white hand had gripped his wrist, and the creature to whom it be-longed was pulling him, slowly, backward across the rock.", "well, Harry thought wryly, he had still endured worse mutterings. . .", "\"Follow me, ladies. . .", "\"Let us say that I did not take it for granted that he was trustworthy,\" said Dumbledore. \"I had, as I have already indicated, resolved to keep a close eye upon him, and so I did. I cannot pretend that I gleaned a great deal from my observations at first.", "Nobody spoke as they settled down, looking around at the shadowy, gruesome pictures. \"I have not asked you to take out your books,\" said Snape, closing the door and moving to face the class from behind his desk; Hermione hastily dropped her copy of Confronting the Faceless back into her bag and stowed it under her chair. \"I wish to speak to you, and I want your fullest attention.\"", "spat Snape, for Malfoy ' s voice had risen excitedly. \"If your friends Crabbe and Goyle intend to pass their Defense Against the Dark Arts OWL this time around, they will need to work a little harder than they are doing at pres —\" \n  \n\"What does it matter?\" said Malfoy.", "\"It was, but you told me I had to get an 'Outstanding' in my O.W.L., Professor.\" \"And so you did when Professor Snape was teaching the subject. Professor Slughorn, however, is perfectly happy to accept N.E.W.T.", "\"We were thinking of buying Zonko's,\" said Fred gloomily. \"A Hogsmeade branch, you know, but a fat lot of good it'll do us if you lot aren't allowed out at weekends to buy our stuff anymon ... But never mind that now.\"", "\"I can love!\" It was only with difficulty that he stopped himself adding, \"Big deal!\" \"Yes, Harry, you can love,\" said Dumbledore, who looked as though he knew perfectly well what Harry had just refrained from saying.", "\"What's chat?\" asked Harry. ' \"Its from Lavender,\" said Ron, sounding revolted^ \"She earn \nhonestly think I'd wear ...\" \nHarry looked more closely and let out a shout of laughter, Dan \ngling from the chain in large gold letters were the words: \n  \n“My sweetheart” \n  \n\"Nice,\" he said.", "\"And when has anyone ever paid attention to what Filch has banned?\" asked Hermione, still concentrating on her essay. \"But I thought all the owls were being searched.", "\"Lean in a little, dear boy, so you can see. . .", ".\" Slughorn said, sounding a little disappointed. \"I remember dear Gwenog telling me (Gwenog Jones, I mean, of course, Captain of the Holyhead Harpies) ?quot;\nHe meandered off into a long-winded reminiscence, but Harry had the distinct impression that Slughorn had not finished with him, and that he had not been convinced by Neville and Ginny.", "As I doubt the Half-blood prince\" she gave the book another scornful look \"could dream up an antidote for a dozen different love potions at once, I'd just invite someone to go with you, that'll stop all the others thinking they've still got a chance. It's tomor r ow night, they're getting desperate.\" \"There isn't anyone I want to invite,\" mumbled Harry, who was still not trying to think about Ginny any more than he could help, despite the fact the fact that she kept cropping up in his dreams in ways that made him devoutly thankful that Ron could not perform Legilimency.", "\"My last bottle, and prices are sky-high at the moment. Still, it might be reusable.\" He stumped over to a small crystal bottle standing on top of a sideboard and held it up to the light, examining the thick liquid within.", "Within five minutes, they were climbing through the portrait hole. 'Are you going to tell me what we're doing, then?' asked Ron, panting slightly.", ". You are Lucius's old friend. ...", "Ron saved five. Ron's Keeper, he won it fair and square. Get out of my way.\"", "Hagrid raised his pink umbrella and rapped a certain brick in the wall, which opened at once to form an archway onto a winding cobbled street. They stepped through the entrance and paused, looking around. Diagon Alley had changed.", "Harry was so used to him bald that he found the sight of Slughorn with thick, shiny, straw-colored hair quite disconcerting; it looked as though he had had his head thatched, though there was already a shiny Galleon-sized bald patch on his crown. His mustache, less massive than it was these days, was gingery-blond. He was not quite as rotund as the Slughorn Harry knew, though the golden buttons on his richly embroidered waistcoat were taking a fair amount of strain.", "\"Oho,\" said Dumbledore happily, seconds later. His hand had closed in midair upon something Harry could not see. Dumble-dore moved closer to the water; Harry watched nervously as the tips of Dumbledore's buckled shoes found the utmost edge of the rock rim."]