[
    {
        "text": "Mercedes-Benz Fashion Week is an annual fashion industry event held in Sydney, Australia. The event is a part of Australian Fashion Week and has taken place at Carriageworks for two consecutive years. The 2014 event was held from 6–10 April. The event focuses on providing Australian designers a platform to connect with a global audience of fashion buyers, press and consumers.The industry-only event showcased over 70 designers, including 25 designers from Sydney, four from Melbourne, four from Perth, two from Brisbane and one from Adelaide. There was also one designer from Bali and China. The 2014 designer showcase featured mostly start-up labels fresh from fashion school. Lan Yu became the first Chinese designer to showcase at Mercedes-Benz Fashion Week Australia. In 2013, Mercedes-Benz Fashion Week Sydney generated an"
    },
    {
        "text": "The Istanbul mayoral elections of 2014 were held on 30 March 2014, as part of the local elections taking place throughout Turkey on the same day. The Metropolitan Mayor of Istanbul as well as the district mayors of the 39 districts of Istanbul were elected, along with municipal councillors for each district municipality. The metropolitan municipality race was one of the most high-profile and"
    },
    {
        "text": "The 2014 Nippon Professional Baseball (NPB) Draft was held on October 23, 2014, for the 50th time at the Grand Prince Hotel Takanawa to assign amateur baseball players to the NPB. It"
    },
    {
        "text": "The 67th British Academy Film Awards, more commonly known as the BAFTAs, were held on 16 February 2014 at the Royal Opera House in London, honouring the best national and foreign films"
    },
    {
        "text": "William Tyrrell (born 26 June 2011) is an Australian boy who disappeared at the age of three from Kendall, New South Wales, on 12 September 2014. He had been playing at his"
    },
    {
        "text": "Around midday on October 22, 2014, a passing motorist saw an Asian woman walking north along the Ingraham Trail on the outskirts of Yellowknife in the Northwest Territories, Canada. Several days later, after seeing stories in the local media that 45-year old Atsumi Yoshikubo (吉窪昌美) who had been visiting the city from her home in southern Japan, had gone missing, she reported the sighting. It was the last time she was seen alive. Yoshikubo's absence was first noted five days after that sighting, when staff at her hotel noticed she had not checked out two days after her stay was due to have ended. In her room they found her luggage, still packed; she had apparently never boarded her flight home. Footage from the hotel's security camera showed her leaving shortly before she was last seen along the road. When that sighting was reported in the news, it suggested to many residents that she might have gotten lost in the vast expanse of taiga surrounding the city, and they augmented official search efforts with their own ventures into the bush.The case attracted considerable media interest not only across Canada but also in Japan, where Yellowknife is a popular destination for those seeking to view the northern lights. A week after Yoshikubo's disappearance, the Royal Canadian Mounted Police (RCMP) announced that they were calling off the search, as their investigation, in cooperation with Japanese police, had led them to believe that she had intended to take her own life. Her family, from whom she had been estranged"
    },
    {
        "text": "Eleanor Poppy Miranda de Freitas (26 June 1990 – 4 April 2014) was an English woman who committed suicide three days before the commencement of her trial for perverting the course of justice for allegedly making a false accusation of rape. Her death prompted a debate over whether prosecuting people accused of making a false accusation of rape could deter rape victims from reporting"
    },
    {
        "text": "General elections were due to be held in Sark on 10 December 2014. However, only 16 candidates nominated for the 16 seats in the Chief Pleas, meaning that all were elected unopposed,"
    },
    {
        "text": "Conference of Western Balkan States was a 28 August 2014 conference of heads of states and governments of Western Balkans region initiated by German chancellor Angela Merkel. An idea for organization of conference came in light of the celebration of the 100th anniversary of the beginning of World War I. It is the first conference in this framework and organizers expressed their desire to continue it in future with Vienna and Paris mentioned as a potential next hosts after Berlin (so called Berlin Process). Günther Oettinger confirmed at conference that event will be organised annually with Vienna as a host city in 2015 and Paris in 2016.The German chancellor announced intention to organize a conference on 7 June 2014. Invitation for participation was sent to all the countries"
    },
    {
        "text": "The third edition of the Champs-Élysées Film Festival was held from 11 to 17 June 2014, with actors Jacqueline Bisset and Bertrand Tavernier as Honorary Presidents and Keanu Reeves, Agnès Varda, Whit Stillman and Mike Figgis as Guests of Honor. More than 120,000 people attended the Festival, with more than 110 films screened. Ronit Elkabetz and Shlomi Elkabetz's Gett: The Trial of Viviane Amsalem was shown at the Closing Ceremony. Along with its competitive Official Selections for American feature-length films, American Shorts and French Shorts, the Festival presented a wide selection of important American and French movie premieres, the TCM Cinema Essentials, a thirteen-film selection of American classics, and the Great French Classics, a five-film selection. Both Honorary Presidents held masterclasses, and the Guests of Honor presented each"
    },
    {
        "text": "The March 2014 nor'easter was an extremely powerful extratropical cyclone that affected much of U.S. Gulf Coast, the eastern United States, eastern Canada, and Greenland. It was the most powerful winter storm"
    },
    {
        "text": "The 2014 Gorni Lom explosions were a series of explosions that began on the afternoon of October 1, 2014, at 16:59 pm local time at the former Midzhur Ammo Plant in the"
    },
    {
        "text": "Presidential elections were held in Colombia on 25 May 2014. Since no candidate received 50% of the vote in the first round, a run-off between the two candidates with the most votes took place three weeks later on 15 June 2014. According to the official figures released by the National Registry office (Registraduría Nacional), as of 22 May 2014 (the cut-off date to register) 32,975,158 Colombians were registered and entitled to vote in the 2014 presidential election, including 545,976 Colombians resident abroad. Incumbent president Juan Manuel Santos was allowed to run for a second consecutive term. In the first round, Santos and Óscar Iván Zuluaga of the Democratic Center (Centro Democrático) were the two highest-polling candidates and were the contestants in the 15 June run-off. In the second"
    },
    {
        "text": "Queen + Adam Lambert Rock Big Ben Live was a concert on New Year's Eve 2014 and New Years Day 2015 performed by Queen + Adam Lambert to celebrate the New Year"
    },
    {
        "text": "Global Wars was a professional wrestling supershow co-produced by the American Ring of Honor (ROH) and Japanese New Japan Pro-Wrestling (NJPW) promotions. The event took place on May 10, 2014, at the"
    },
    {
        "text": "China–Brazil Earth Resources Satellite 4 (CBERS-4), also known as Ziyuan I-04 or Ziyuan 1E, is a remote sensing satellite intended for operation as part of the China–Brazil Earth Resources Satellite program between"
    },
    {
        "text": "The 2014 G20 Brisbane summit was the ninth meeting of the G20 heads of government/heads of state. It was held in Brisbane, the capital city of Queensland, Australia, on 15–16 November 2014."
    },
    {
        "text": "The third competition weekend of the 2014–15 ISU Speed Skating World Cup will be held in Sportforum Hohenschönhausen in Berlin, Germany, from Friday, 5 December, until Sunday, 7 December 2014.Artur Waś of Poland both men's 500 m races. In the women's competitions, Ireen Wüst of the Netherlands won three gold medals; in the 1500 m and 3000 m races, as well as in the team pursuit. Lee Sang-hwa of South Korea won both 500 m races. Heather Richardson of the United States managed to take no less than four silver medals; in both 500 m races, as well as the 1000 m and 1500 m races.No world records were set during the weekend, but Christian Oberbichler of Switzerland set a new national record on in the B division"
    },
    {
        "text": "Concluding observations on the second periodic report of the Holy See was a 2014 report issued by the Office of the United Nations High Commissioner for Human Rights, regarding the handling by"
    },
    {
        "text": "The Great Fire of Valparaíso (Spanish: Gran Incendio de Valparaíso) started on 12 April 2014 at 16:40 local time (19:40 UTC), in the hills of the city of Valparaíso, Chile. The wildfire"
    },
    {
        "text": "The Battle of Shuja'iyya occurred between the Israel Defense Forces and the Izz ad-Din al-Qassam Brigades on 20 July 2014 during 2014 Israel–Gaza conflict in the Shuja'iyya neighborhood of Gaza City, in the Gaza Strip.: 71 Shuja'iyya, with 92,000 people in 6 sq-kilometres, is one of the most densely populated areas of the Gaza Strip. According to the IDF, it had become a \"terrorist"
    },
    {
        "text": "General elections were held in Costa Rica on Sunday, 2 February 2014 to elect a new president, two vice presidents, and 57 Legislative Assembly lawmakers. In accordance with Article 132 of the constitution, incumbent President Laura Chinchilla Miranda was ineligible to run for a second consecutive term.The ruling National Liberation Party put forward San José Mayor Johnny Araya Monge as its presidential candidate; the"
    },
    {
        "text": "The Muslim Youth uprising is the official name given to an unsuccessful \"Islamic revolution\" that was set to take place in Egypt on November 28, 2014. The Salafist Front, an Islamist organization which is part of the now banned Muslim Brotherhood-led Anti-Coup Alliance, had initially planned for the uprising earlier in November. The protests' main goal was to establish the \"Islamic identity\" in Egypt,"
    },
    {
        "text": "Water supply problems in Caleta Olivia occurred on 2014 (called the Thirst Days) and culminated in a series of protests about the lack of water produced by the rupture of the aqueduct Jorge Carstens. The Sarmiento, Comodoro Rivadavia and Rada Tilly areas of Argentina were affected. The water shortage began on the 10th of February with a rupture near ti Cerro Dragón (Dragon Hill)."
    },
    {
        "text": "The 14th Cook Islands Parliament is the previous term of the Parliament of the Cook Islands. Its composition was determined by the 2014 elections on 9 July 2014.Due to an election-night tie the seat of Mitiaro was initially left vacant. The tie was later resolved by a judicial recount, and Tangata Vavia was declared elected.The Parliament sat for the first time on 8 October"
    },
    {
        "text": "Lars Joachim Mittank (born February 9, 1986) is a German man who disappeared on July 8, 2014, near Varna Airport in Varna, Bulgaria. Mittank was vacationing at the Golden Sands resort, where"
    },
    {
        "text": "During the ongoing Russo-Ukrainian War between the Ukrainian government forces and pro-Russian separatists in the Donbas region of Ukraine that began in April 2014, many international organisations and states noted a deteriorating"
    },
    {
        "text": "Miss Teen USA 2014, the 32nd Miss Teen USA pageant. It was held at the Atlantis Paradise Island Resort in Nassau, Bahamas on August 2, 2014 and was hosted by Australian journalist"
    },
    {
        "text": "The 2014 Nuclear Security Summit was a summit held in The Hague, the Netherlands, on March 24 and 25, 2014. It was the third edition of the conference, succeeding the 2012 Nuclear Security Summit. The 2014 summit was attended by 58 world leaders (5 of which from observing international organizations), some 5,000 delegates and some 3,000 journalists. The representatives attending the summit included US President Barack Obama and Chinese President Xi Jinping. The main goal of the conference was generally to improve international cooperation and more specifically to assess which of the objectives that were set at the previous summits in Washington, D.C., and Seoul had not been accomplished in the previous four years and proposing ways of achieving them.The Nuclear Security Summit aimed to prevent nuclear terrorism"
    },
    {
        "text": "Oslo is a discothèque, bar and food venue located in Hackney Central, East London. It is the first club to open in that area of Hackney. Notable musicians that played in it"
    },
    {
        "text": "International reactions to the annexation of Crimea by the Russian Federation have largely been condemnatory of Russia's actions, supportive of Ukraine's sovereignty and territorial integrity, and supportive of finding a quick end"
    },
    {
        "text": "The 2013–14 North American winter was one of the most significant for the United States, due in part to the breakdown of the polar vortex in November 2013, which allowed very cold air to travel down into the United States, leading to an extended period of very cold temperatures. The pattern continued mostly uninterrupted throughout the winter and numerous significant winter storms affected the"
    },
    {
        "text": "General elections were held in the Cook Islands on 9 July 2014, determining the membership of the 14th Cook Islands Parliament. The Cook Islands Party (CIP) initially appeared to have retained its majority, winning 13 seats, while the Democratic Party won eight and the new One Cook Islands Movement won two, with one seat tied. However, the result in one constituency the CIP had"
    },
    {
        "text": "The 2014–2015 eruption of Fogo began on 23 November 2014, continuing until 8 February 2015. It was the first eruption of Pico do Fogo in 19 years, and the longest since its"
    },
    {
        "text": "Election to the 6th convocation of the Moscow City Duma took place on the United Voting Day on September 14, 2014. The elections were held in full by the majority system, 45"
    },
    {
        "text": "A photograph of then-Labour Party leader Ed Miliband eating a bacon sandwich became a source of sustained commentary and the subject of an internet meme in 2014 and 2015. Taken for the London Evening Standard newspaper while Miliband was campaigning for local elections in May 2014, the image became well known following the popular perception of it as making Miliband appear awkward, error-prone and incapable of performing simple tasks. The image sparked several internet memes, both supportive and mocking, and fuelled a debate about the lengths to which politicians attempt to control their public image, as well as drawing criticism that the focus placed on the image and its resulting memes was motivated by antisemitism. Miliband dismissed the debate as unimportant. Others, including opponents, described the media focus"
    },
    {
        "text": "The Kasta Tomb (Greek: Τύμβος Καστά), also known as the Amphipolis Tomb (Greek: Τάφος της Αμφίπολης), is the largest ancient tumulus (burial mound) ever discovered in Greece, and by comparison dwarfs that of Philip II of Macedon, father of Alexander the Great, in Vergina.It is an ancient Macedonian tomb of the last quarter of the 4th c. BC, and is enclosed in the Kasta"
    },
    {
        "text": "The Report of the Commission of Inquiry on Human Rights in the Democratic People's Republic of Korea is the landmark document resulting from the investigations on human rights in North Korea commissioned by the United Nations Human Rights Council in 2013 and concluded in 2014.The report unequivocally concluded that the North Korean government systematically violated human rights including freedom of thought, expression and religion;"
    },
    {
        "text": "On February 3, 2014, 15-year-old high school student Sergey Gordeyev (Russian: Сергей Гордеев; also spelled Sergei Gordeev) opened fire at School No. 263 in Otradnoye District, Moscow, Russia, killing a teacher. Gordeyev"
    },
    {
        "text": "Patagotitan is a genus of titanosaurian sauropod dinosaur from the Cerro Barcino Formation in Chubut Province, Patagonia, Argentina. The genus contains a single species known from at least six young adult individuals, Patagotitan mayorum, which was first announced in 2014 and then validly named in 2017 by José Carballido and colleagues. Preliminary studies and press releases suggested that Patagotitan was the largest known titanosaur"
    },
    {
        "text": "Hamas, the governing authority in the Gaza Strip, has constructed a sophisticated network of military tunnels since it seized control of the Strip in 2007. The tunnel system branches beneath many Gazan towns and cities, such as Khan Yunis, Jabalia and the Shati refugee camp. The internal tunnels, running some dozens of kilometres within the Gaza Strip, have several functions. Hamas uses the tunnels to hide its arsenal of rocketry underground, to facilitate communication, to permit munition stocks to be hidden, and to conceal militants, making detection from the air difficult. Hamas leader Khalid Meshal said in an interview with Vanity Fair that the tunnel system is a defensive structure, designed to place obstacles against Israel's powerful military arsenal and engage in counter-strikes behind the lines of the"
    },
    {
        "text": "The Apollo of Gaza is a rare bronze sculpture of the Ancient Greek god Apollo found in the Gaza Strip in 2013. It was put for sale on eBay, and subsequently withdrawn"
    },
    {
        "text": "The Aswan tribal clashes were a series of clashes east of Egypt's southern city of Aswan between two local ethnic tribes: the Arab Al-Halayel (Beni Helal) clan and the Nubian Al-Dabodeya family. Shootings and stabbing occurred throughout the city following verbal insults between students from both sides at a local school on Wednesday, two days before the violence. Cars were torched and homes were"
    },
    {
        "text": "The 2014 World Team Table Tennis Championships were held in Tokyo from 28 April to 5 May 2014. The Championships was staged in Japan for the seventh time and was the 52nd edition of the team competition. The decision was announced by ITTF in May 2011, after several sporting events including the 2011 World Figure Skating Championships were shifted from Japan due to the"
    },
    {
        "text": "March in March refers to a series of marches which were held around Australia on 15–16 March 2014, and in Canberra, the national capital, on 17 March 2014, a parliamentary sitting day."
    },
    {
        "text": "The Vienna Summer of Logic was a scientific event in the summer of 2014, combining 12 major conferences and several workshops from the fields of mathematical logic, logic in computer science, and"
    },
    {
        "text": "Dzhumaya Mosque (Bulgarian: Джумая джамия) is located in Plovdiv, Plovdiv Province, Bulgaria. Its Turkish name is Hüdavendigâr Camii or Cuma Camii. The mosque is located in the centre of Plovdiv and was built in 1363–1364 on the site of the Sveta Petka Tarnovska Cathedral Church after the conquest of Plovdiv by the Ottoman army. During the reign of Sultan Murad I in the 15th"
    },
    {
        "text": "The 2014 Tokyo gubernatorial election took place on February 9, 2014 to replace outgoing Governor Naoki Inose, who resigned effective December 24, 2013. Yōichi Masuzoe was declared the winner in exit polling,"
    },
    {
        "text": "The Trojan Horse scandal, also known as \"Operation Trojan Horse\" or the Trojan Horse affair, involves claims of an alleged conspiracy to introduce an \"Islamist\" or \"Salafist\" ethos into several schools in Birmingham, England. The name, based on the Greek legend, comes from an anonymous letter sent to Birmingham City Council in late 2013, alleged to be from Birmingham \"Islamists\" detailing how to wrest"
    },
    {
        "text": "Miss Belgium 2014 was the 46th edition of the Miss Belgium held on January 11, 2014 at the Plopsaland Theater in De Panne, Belgium. The winner, Laurence Langen from Limburg, was crowned"
    },
    {
        "text": "Karen Petrosyan v. Azerbaijan was an international human rights case regarding the rights of Artush Petrosyan and his son Karen Petrosyan – an Armenian national from Chinari village, Tavush province of Armenia, who died while in captivity in Azerbaijan in 2014. The judgment of the European Court of Human Rights on the case originated in an application (no. 32427/16) against the Republic of Azerbaijan"
    },
    {
        "text": "The 2014–15 North American winter was frigid and prolifically wintry, especially across the eastern half of North America in the months of January–March. The season began early, with many places in North America experiencing their first wintry weather during mid-November. A period of below-average temperatures affected much of the contiguous United States, and several records were broken. An early trace of snowfall was recorded in Arkansas. There were greater accumulations of snow across parts of Oklahoma as well. A quasi-permanent phenomenon referred to as the polar vortex may have been partly responsible for the cold weather. Temperatures in much of the United States dropped 15 to 35 °F (8.3 to 19 °C) below average by November 19, following a southward \"dip\" of the polar vortex into the eastern two-thirds of the country. The effects of this dip were widespread, bringing about temperatures as low as 28 °F (−2 °C) in Pensacola, Florida. Following a significant snowstorm there, Buffalo, New York received several feet of snow from November 17–21. In addition, significant winter weather occurred throughout the season, including a major blizzard that struck the Northeastern United States at the end of January, another blizzard that affected much of the Northern United States days later in early February, and several significant snow events paired with very frigid temperatures for much of February. Many records for snowfall and temperature were broken, many for the month of February, with every state east of the Mississippi River being colder than average, some for the entire winter. However, this meteorological winter"
    },
    {
        "text": "The Estación Polar Científica Conjunta Glaciar Unión (or Union Glacier Joint Scientific Polar Station) or Union Glacier Station is a summer Antarctic base of Chile, situated on Union Glacier in the Ellsworth"
    },
    {
        "text": "The 2014 Australian federal budget was the federal budget to fund government services and operations for the 2014/15 financial year. The 2014 budget was the first delivered by the Abbott government, since the Coalition's victory in the 2013 Australian federal election. Treasurer Joe Hockey presented the budget to the House of Representatives on 13 May 2014.The budget featured significant changes to address a perceived deficit crisis. This included a proposed dramatic downsizing of government bureaucracy, and contained significant changes to welfare, new initiatives for a medical research fund and spending on roads. A budget surplus exceeding 1% of GDP was not expected until 2023.The austere budget faced widespread criticism and was overwhelmingly rejected by the Australian public as reflected in all opinion polls after its release. Opposition to \"unfair\" budget measures came from the opposition and cross-bench, pensioners, economists, the union movement, students and welfare, community and disability groups with some taking to the streets in protest. The budget included changes which were contrary to pre-election commitments and promises made by the Liberals in opposition. Critics argue that every one of the following pre-election commitments made by Tony Abbott were broken in the first budget: \"No cuts to education, no cuts to health, no change to pensions, no change to the GST and no cuts to the ABC or SBS.\" Echos of the \"dead and buried\" Fightback! policy package from the 1993 election occurred with proposals to defer unemployment benefits for six months for under 30s and the removal of GP bulk billing. Most proposals have"
    },
    {
        "text": "Hurricane Ana was the second tropical cyclone in 2014 to threaten the U.S. state of Hawaii with a direct hit, after Iselle in August. The twenty-first named storm and fifteenth hurricane of the 2014 Pacific hurricane season, Ana formed from a disturbance that formed in the Central Pacific in mid-October. It rapidly consolidated, and a tropical depression developed by October 13. Aided by favorable conditions, Ana gradually strengthened while moving westward, threatening to pass over the island chain of Hawaii once or several times as indicated by early forecasts. By October 17, it had strengthened to a hurricane south of Hawaii and reached its peak intensity shortly afterwards while also making its closest approach. Afterwards, Ana weakened and began to fluctuate in intensity as it turned to the"
    },
    {
        "text": "Blood Swept Lands and Seas of Red was a public art installation created in the moat of the Tower of London, England, between July and November 2014. It commemorated the centenary of"
    },
    {
        "text": "The 2014 European Individual Chess Championship took place from 2 to 15 March in Yerevan. 263 players took part. Although sometimes described as the men's championship, several women took part, including Judit Polgár and Antoaneta Stefanova. The top 23 players qualified for the Chess World Cup 2015, which took place in Baku, Azerbaijan from 10 September to 5 October 2015 and was won by"
    },
    {
        "text": "The 40th G7 summit was held 4–5 June, 2014 in Brussels, Belgium. It was originally scheduled to be held as the “40th G8 summit” and be hosted by Russia in the Black Sea resort of Sochi. However, the other seven countries decided on 24 March that the summit would be instead held without Russia in Brussels.Following the 2014 Crimean crisis and the accompanying Russian"
    },
    {
        "text": "On the morning of 18 November 2014, two Palestinian men from Jerusalem entered Kehilat Bnei Torah synagogue, in the Har Nof neighborhood of Jerusalem, and attacked the praying congregants with axes, knives, and a gun. They killed four dual-nationality worshippers, and critically wounded a responding Druze Israeli police officer, who later died of his wounds. They also injured seven male worshippers, one of whom never woke up from a coma and died 11 months later. The two attackers were then shot dead by the police. Several initial reports claimed that the Popular Front for the Liberation of Palestine (PFLP) had declared responsibility for the attack; Other sources say declarations by PFLP militants were either confused or that the group itself disclaimed responsibility. Israeli authorities stated that 'it seemed"
    },
    {
        "text": "The General Debate of the sixty-ninth session of the United Nations General Assembly commenced on 24 September 2014 and ended on 1 October 2014. Leaders from a number of member states addressed"
    },
    {
        "text": "The 2014 unrest in Bosnia and Herzegovina was a series of demonstrations and riots that began in the northern town of Tuzla on 4 February 2014 but quickly spread to multiple cities in Bosnia and Herzegovina, including Sarajevo, Zenica, Mostar, Jajce, and Brčko, among others, for social reasons and with the aim of overthrowing the government. The riots were the most violent scenes the"
    },
    {
        "text": "The 2014 Channel O Music Video Awards took place on 29 November 2014 at the Nasrec Expo Centre in Soweto. Nominees were announced on 4 September. Cassper Nyovest, K.O and Davido led"
    },
    {
        "text": "The case of Ashya King concerns a boy named Ashya King, who had a brain tumour. His parents, Brett and Naghemeh King, took their son out of Southampton General Hospital (England) in"
    },
    {
        "text": "The 2014–15 Linafoot season (known as the Vodacom Superligue 2014–15 for sponsorship reasons) is the 54th since its establishment. It began on 4 October 2014. A total of 20 clubs participate in"
    },
    {
        "text": "The Muslim Youth uprising is the official name given to an unsuccessful \"Islamic revolution\" that was set to take place in Egypt on November 28, 2014. The Salafist Front, an Islamist organization"
    },
    {
        "text": "The Brazilian Anti-Corruption Act (Brazilian Portuguese: Lei anticorrupção) officially \"Law No. 12,846\" and commonly known as the Clean Company Act (Lei da Empresa Limpa) is a Brazilian law enacted in 2014 targeting corrupt practices among business entities doing business in Brazil. It defines civil and administrative penalties, as well as the possibility of reductions in penalties for cooperation with law enforcement under a written leniency agreement signed and agreed to between the business and the government. The law is directed only at juridical persons which includes corporations and other institutions, but not individuals, who are covered by other laws. The Act has been invoked numerous times, resulting in leniency agreements returning billions of reals to the Brazilian Treasury, notably the agreement with Odebrecht S.A., which by itself was"
    },
    {
        "text": "Between 13 and 18 May 2014 a low-pressure cyclone designated Tamara and Yvette affected a large area of Southeastern and Central Europe, causing floods and landslides. Serbia and Bosnia and Herzegovina suffered the greatest damage, as the rain was the heaviest in 120 years of recorded weather measurements. By 20 May, at least 62 people had died as a result of the flooding, and"
    },
    {
        "text": "The case of Ashya King concerns a boy named Ashya King, who had a brain tumour. His parents, Brett and Naghemeh King, took their son out of Southampton General Hospital (England) in August 2014 over a disagreement with doctors regarding his treatment.Ashya had a medulloblastoma, which was successfully removed through surgery on 24 July 2014. He received further neurosurgery on 22 August.His parents desired their son be treated with proton therapy, which they felt was less harmful than conventional radiotherapy. At that time, the National Health Service (NHS) did not provide proton therapy in the United Kingdom. However, it has funded treatment abroad since April 2008 where evidence has shown there to be benefit. In this case, the doctors did not support moving the boy so that he"
    },
    {
        "text": "The Constitution of the Arab Republic of Egypt is the fundamental law of Egypt. The Egyptian Constitution of 2014 was passed in a referendum in January 2014. The constitution took effect after"
    },
    {
        "text": "The 2014 Toronto Argonauts season was their 57th season in the Canadian Football League and their 142nd season overall. The Argonauts finished in third place in the East Division but missed out"
    },
    {
        "text": "Clashes on the Armenian–Azerbaijan border (Tavush–Qazakh) and the line of contact between the Nagorno-Karabakh and Azerbaijan started on 27 July 2014. Reported casualties of the clashes were some of the highest since"
    },
    {
        "text": "The 2014 Wales Summit of the North Atlantic Treaty Organization (NATO) was a meeting of the heads of state and heads of government of the NATO countries, held in Newport, Wales on"
    },
    {
        "text": "The 2014 Yingjiang earthquake occurred on 24 May at 4:49 a.m. local time in Yingjiang County, Yunnan Province, China, with a moment magnitude of 5.6 and a maximum perceived intensity of VII (Very strong) on the Mercalli intensity scale. The epicenter was in the town of Kachang. There were 14 aftershocks, according to the Yunnan provincial seismological bureau.The earthquake affected about 23,800 people and"
    },
    {
        "text": "Cyclone Christina was a European windstorm which caused three fatalities and €375 million in damage across western Europe in early January 2014, making landfall several days after Cyclone Anne. Forming out of a powerful nor'easter off the coast of North America, Christina reached a peak intensity of 934 mb (27.6 inHg) as it crossed western Europe. The storm was more commonly referred to as"
    },
    {
        "text": "Gubernatorial elections were held in the Democratic Republic of the Congo in March 2014. The elections were initially scheduled for 2012, but were delayed until 2014.Elections were held for nineteen provincial governors."
    },
    {
        "text": "2014 Kunar Offensive refers to a 2014 armed conflict of the War in Afghanistan, between the Afghan Army and a terrorist group, Tehrik-i-Taliban Pakistan (TTP). It occurred in the Dangam district of"
    },
    {
        "text": "In 2014, an outbreak of Ebola virus disease in the Democratic Republic of the Congo (DRC) occurred. Genome sequencing has shown that this outbreak was not related to the 2014–15 West Africa Ebola virus epidemic, but was of the same EBOV species. It began in August 2014 and was declared over in November of that year, after 42 days without any new cases. This"
    },
    {
        "text": "Miss France 2015, the 85th edition of the Miss France pageant, was held on December 6, 2014 at Zénith d'Orléans in Orléans. Miss France 2014, Flora Coquerel of Orléanais (Centre-Val de Loire)"
    },
    {
        "text": "The Battle of Shuja'iyya occurred between the Israel Defense Forces and the Izz ad-Din al-Qassam Brigades on 20 July 2014 during 2014 Israel–Gaza conflict in the Shuja'iyya neighborhood of Gaza City, in the Gaza Strip.: 71 Shuja'iyya, with 92,000 people in 6 sq-kilometres, is one of the most densely populated areas of the Gaza Strip. According to the IDF, it had become a \"terrorist fortress\", that between 8 and 20 July had fired over 140 rockets into Israel after the outbreak of hostilities. Casualty figures are not known with precision, partly because bodies were recovered long after the fighting, and people had also died of injuries afterwards. The UN Protection Cluster states that between the 19-20th, 55 civilians, including 19 children and 14 women, were killed as a result of the IDF's actions. At the time, estimates varied from 66 to about 120 Palestinians killed, with a third of them women and children, and at least 288 wounded. The UN figures of Palestinian casualties are preliminary and subject to revision. 13 Israeli soldiers were killed.On 16 July, Israeli forces told residents of Shuja'iyya to leave and relocate to central Gaza City until further notice by means of leaflets, loudspeaker announcements, telephone calls, text messages, and radio messages. Residents interviewed afterwards by The Independent claimed lack of safe refuges and the difficulty of fleeing as reasons for staying put. By 19 July, OCHA reported that while the majority ignored the warnings and had not left their homes, up to half had gone as bombardments intensified. Israel condemned"
    },
    {
        "text": "25 Churchill Place is a 118 metres (387 ft) tall skyscraper in the eastern part of the London financial district Canary Wharf. It was built in 2014 and has 23 storeys. The"
    },
    {
        "text": "From March 2012 to May 2014, the Salvadoran government, the Catholic Church, and the country's two largest criminal gangs, Mara Salvatrucha (MS-13) and the 18th Street gang (Barrio 18), came to a truce, known in El Salvador simply as the Gang Truce (Spanish: Tregua entre Pandillas), to lower the country's rate of homicides and extortions in exchange for improved prison conditions and certain visitation privileges. The truce's principal negotiators were Minister of Public Security David Munguía Payés, former deputy Raúl Mijango, and Bishop Fabio Colindres, and the negotiations were overseen by President Mauricio Funes. The existence of the truce was alleged by the online newspaper El Faro in early March 2012, after 30 gang leaders were transferred from a maximum-security prison to a lower-security prison, and confirmed after representatives from the gangs and the Catholic Church admitted that they negotiated a truce with the government. However, the government initially denied that they had negotiated with the gangs and that any truce existed; as the truce resulted in a decrease in crime, the government began to acknowledge its existence, but continued to attribute the decrease in crime to its security policies. The government formally recognized its role in negotiating the truce in September 2012. Although fractures in the truce began to manifest in July and August 2012, in November 2012 an effort to establish \"peace zones\" in Salvadoran municipalities helped restore the truce and reaffirm the gangs' commitments to reduce their criminal activities. Although the gang surrendered its weapons and the government removed soldiers from the designated"
    },
    {
        "text": "Miss Universe Thailand 2014, the 15th Miss Universe Thailand pageant was held at Royal Paragon Hall, Siam Paragon in Bangkok on May 17, 2014. The contestants camped in Roi Et. before flying"
    },
    {
        "text": "General elections were held in Bahrain in November 2014 to elect the forty members of the Council of Representatives. The first round of voting took place on 22 November, with a second round on 29 November in the 34 constituencies in which no candidate received a majority.The elections were boycotted by the Shiite Islamist opposition Al-Wefaq. Of the 266 candidates, 22 were women. According to election officials, 349,713 Bahrainis, including 175,998 men and 173,175 women, were listed to vote. Although the government announced the voter turnout as 52.6%, the opposition claimed it was only 30%.Independents won 37 of the 40 seats with Sunni Islamists losing two of their five seats. The number of Shiite MPs fell to 14 as a result of the Al-Wefaq boycott. Female representation was"
    },
    {
        "text": "The analysis of communications between Malaysia Airlines Flight 370 and Inmarsat's satellite telecommunication network provide the primary source of information about Flight 370's location and possible in-flight events after it disappeared from"
    },
    {
        "text": "2013–2014 Atlantic winter storms in Europe were a series of winter storms affecting areas of Atlantic Europe and beyond. The French Atlantic coastal regions (chiefly Brittany), South West and Southern England, West Wales, Ireland, Spanish Atlantic coastal regions (particularly Galicia) were especially affected by a \"conveyor belt\" series of high-precipitation storms (mostly not exceptional for their winds) and by high tides. Many storms were explosively deepened by a strong jet stream, many deepening below 950 hPa. The repeated formation of large deep lows over the Atlantic brought storm surges and large waves which coincided with some of the highest astronomical tides of the year and caused coastal damage. The low pressure areas brought heavy rainfalls which led to flooding, which became most severe over parts of England such"
    },
    {
        "text": "On 30 June or 2 July 2014, the Armed Forces of the Democratic Republic of the Congo and United Nations forces launched an offensive against rebel groups in the Masisi and Walikale"
    },
    {
        "text": "The impact of the Arab Spring concerns protests or by the way attempts to organize growing protest movements that were inspired by or similar to the Arab Spring in the Arab-majority states of North Africa and the Middle East, according to commentators, organisers, and critics. These demonstrations and protest efforts have all been critical of the government in their respective countries, though they have"
    },
    {
        "text": "Armenia participated in the Junior Eurovision Song Contest 2014 which took place on 15 November 2014, in Marsa, Malta. The Armenian broadcaster Armenia 1 (ARMTV) was responsible for organising their entry for"
    },
    {
        "text": "The 23rd Actors and Actresses Union Awards ceremony was held on 10 March 2014 at the Teatro Coliseum in Madrid. The gala was hosted by Llum Barrera and Secun de la Rosa.In addition to the competitive awards, Carmen Pitillas, Dolores Ramírez, Delia Mateos and Pilar Vázquez (the promoters of the grassroots platform that managed to avoid the closure of the Renoir cinemas in Majadahonda)"
    },
    {
        "text": "The Wold Newton Hoard is a coin hoard dating from the early 4th century AD. It contains 1,857 coins held within a pottery container. It was acquired by the Yorkshire Museum in"
    },
    {
        "text": "The 13N was a Cacerolazo against President Cristina Fernández de Kirchner that took place in Argentina on November 13, 2014. It was organized by social networks. The people in the demonstration protested against the high crime rate, the high inflation and the corruption scandals. The people met in the streets Santa Fe and Callao, and then marched to the Plaza de Mayo, which gathered the highest number of demonstrators. There was a strong security network at the Plaza de Mayo and the Congressional Plaza. The demonstration a lower number of demonstrators than previous ones such as the 8N and the 18A.Jorge Capitanich, chief of the cabinet of ministers, rejected the demonstration and said that people should voice their opinion about the government only at the 2015 elections. =="
    },
    {
        "text": "The 2014 Vorarlberg state election was held on 21 September 2014 to elect the members of the Landtag of Vorarlberg. The Austrian People's Party (ÖVP) suffered substantial losses, and was deprived of"
    },
    {
        "text": "On 22 October 2014, a Palestinian rammed his car into a crowd of people waiting at the Ammunition Hill light rail station in the Sheikh Jarrah neighbourhood in East Jerusalem. The attack"
    },
    {
        "text": "The 2014 World Team Table Tennis Championships were held in Tokyo from 28 April to 5 May 2014. The Championships was staged in Japan for the seventh time and was the 52nd"
    },
    {
        "text": "The 2014 Tokyo Marathon (Japanese: 東京マラソン 2014) was the eighth edition of the annual marathon race in Tokyo, Japan and was held on Sunday, 23 February. An IAAF Gold Label Road Race,"
    },
    {
        "text": "Patagotitan is a genus of titanosaurian sauropod dinosaur from the Cerro Barcino Formation in Chubut Province, Patagonia, Argentina. The genus contains a single species known from at least six young adult individuals,"
    },
    {
        "text": "On the afternoon of 24 May 2014, a gunman opened fire at the Jewish Museum of Belgium in Brussels, killing four people. Three of them, an Israeli couple on holiday and a French woman, died at the scene. The fourth victim, a Belgian employee of the museum, was taken to the hospital but died of his injuries on 6 June. A little less than a week later, on 30 May 2014, a suspect was arrested in the French city of Marseille in connection with the shooting. The suspect was Mehdi Nemmouche, a 29-year-old French national of Algerian origin. A second suspect, Nacer Bendrer, was identified and arrested later. Prior to the shooting, Nemmouche had already spent time in French prisons, where he became involved in radical Islam. After"
    },
    {
        "text": "The 2014 Australian federal budget was the federal budget to fund government services and operations for the 2014/15 financial year. The 2014 budget was the first delivered by the Abbott government, since the Coalition's victory in the 2013 Australian federal election. Treasurer Joe Hockey presented the budget to the House of Representatives on 13 May 2014.The budget featured significant changes to address a perceived"
    },
    {
        "text": "The XX International AIDS Conference was held in Melbourne, Australia from 20 to 25 July 2014 at the Melbourne Convention and Exhibition Centre. It was organized by the International AIDS Society). Over"
    },
    {
        "text": "The Oulu child murders is a Finnish murder case, referring to the discovery of the bodies of five infants in the basement of an apartment building in Oulu, on June 3, 2014. The mother of the babies, 35-year-old Kaisa Emilia Vornanen-Karaduman, had concealed the pregnancies and abandoned them, after giving birth at home. The Rovaniemi Court of Appeal sentenced her to 13 years imprisonment"
    },
    {
        "text": "Miss Brazil World 2014 was the 25th edition of the Miss Brazil World pageant and the 9th under MMB Productions & Events. The contest took place on August 9, 2014. Each state, the Federal District and various Insular Islands competed for the title. Sancler Frantz of Ilha dos Lobos crowned her successor, Julia Gama of Rio Grande do Sul at the end. Gama represented"
    },
    {
        "text": "The blockade of the Gaza Strip is the ongoing land, air, and sea blockade of the Gaza Strip imposed by Israel and Egypt temporarily in 2005–2006 and permanently from 2007 onwards, following"
    },
    {
        "text": "The Wythenshawe and Sale East by-election was a by-election held on 13 February 2014 for the Parliament of the United Kingdom's House of Commons constituency of Wythenshawe and Sale East, following the death of the former MP, Paul Goggins.The election was won by Mike Kane of the Labour Party with a greatly increased share of the vote compared with the 2010 general election. UKIP,"
    },
    {
        "text": "The 64th annual Berlin International Film Festival was held from 6 to 16 February 2014. Wes Anderson's film The Grand Budapest Hotel opened the festival. British film director Ken Loach was presented"
    },
    {
        "text": "The Rotherham child sexual exploitation scandal consists of the organised child sexual abuse that occurred in the town of Rotherham, South Yorkshire, Northern England from the late 1980s until the 2010s and the failure of local authorities to act on reports of the abuse throughout most of that period. Researcher Angie Heal, who was hired by local officials and warned them about child exploitation occurring between 2002 and 2007, has since described it as the \"biggest child protection scandal in UK history\". Evidence of the abuse was first noted in the early 1990s, when care home managers investigated reports that children in their care were being picked up by taxi drivers. From at least 2001, multiple reports passed names of alleged perpetrators, several from one family, to the police and Rotherham Council. The first group conviction took place in 2010, when five British-Pakistani men were convicted of sexual offences against girls aged 12–16. From January 2011 Andrew Norfolk of The Times pressed the issue, reporting in 2012 that the abuse in the town was widespread and that the police and council had known about it for over ten years.The Times articles, along with the 2012 trial of the Rochdale child sex abuse ring, prompted the House of Commons Home Affairs Committee to conduct hearings. Following this and further articles from Norfolk, Rotherham Council commissioned an independent inquiry led by Professor Alexis Jay. In August 2014 the Jay report concluded that an estimated 1,400 children had been sexually abused in Rotherham between 1997 and 2013, predominantly by"
    },
    {
        "text": "The Argentine debt restructuring is a process of debt restructuring by Argentina that began on January 14, 2005, and allowed it to resume payment on 76% of the US$82 billion in sovereign bonds that defaulted in 2001 at the depth of the worst economic crisis in the nation's history. A second debt restructuring in 2010 brought the percentage of bonds under some form of"
    },
    {
        "text": "Arturo (1985 – July 3, 2016) was a polar bear living in Mendoza Zoological Park in Mendoza, Argentina, the only polar bear living in the country. He was born in the United States and transferred to Argentina in 1993. His companion, a female named Pelusa, died of cancer in 2012. The living conditions of the cage Arturo resided in were controversial, as temperatures reach"
    },
    {
        "text": "The 2014 Toronto FC season was the eighth season in club history. During the off-season, Toronto FC agreed to a one-year partnership with USL outfit Wilmington Hammerheads. Jackson, Justin Morrow, Dwayne De"
    },
    {
        "text": "Declared in June 2014, the West and Central African cholera outbreak as of January 25, 2015 claimed 1,683 registered deaths and over 91,361 reported cases with a reported case fatality rate (CFR) of 2% in 11 countries, which is 3 times more than in 2013. The case fatality ratio is high in the Sahelian area, equal or greater than 2%, especially in Nigeria, Chad,"
    },
    {
        "text": "On 18 March 2014, Russian president Vladimir Putin gave a speech to both chambers of the Federal Assembly of the Russian Federation in connection with the request for admission by the Crimean parliament of the republic in the Russian Federation. He spoke in the St. George Hall of the Grand Kremlin Palace in the Moscow Kremlin.In the same place, Putin delivered another speech on"
    },
    {
        "text": "The 2014 protests in Brazil, also known as There won't be a Cup or Fifa go home were public demonstrations in several Brazilian cities in response to the 2014 FIFA World Cup"
    },
    {
        "text": "Simon Hall (1977 or 1978 – 23 February 2014) was a British murderer who was wrongly helped by 'miscarriage of justice' campaigners, only for him to go on to confess to the murder he was convicted of and prove he was rightly convicted. Hall stabbed 79-year-old pensioner Joan Albert to death in her home in Capel St Mary, Suffolk in 2001, and was convicted"
    },
    {
        "text": "The Schellenberg smuggling incident is a case in which Canadian citizen Robert Lloyd Schellenberg was arrested, tried, and convicted on charges of smuggling drugs in the People's Republic of China. According to the prosecutors for the state, Schellenberg attempted to smuggle methamphetamine with a net weight of just over 222 kg (489 lb) from Dalian to Australia in November 2014, and after discovering that"
    },
    {
        "text": "Presidential elections were held in Egypt between 26 and 28 May 2014. There were only two candidates, former Egyptian defence minister Abdel Fattah el-Sisi and Egyptian Popular Current candidate Hamdeen Sabahi. El-Sisi won the election in a landslide victory, having received 97% of votes. Before announcing his candidacy in the election, el-Sisi, who as Defence Minister also served as Commander-in-Chief of the Egyptian Armed"
    },
    {
        "text": "The Western Antarctic Ice Sheet (WAIS) is the segment of the continental ice sheet that covers West Antarctica, the portion of Antarctica on the side of the Transantarctic Mountains that lies in"
    },
    {
        "text": "On January 17, 2014, a suicide bomber detonated explosives at the gate of the Taverna du Liban, a heavily fortified restaurant in Kabul popular with foreign nationals, including diplomats, aid workers and"
    },
    {
        "text": "Declared in June 2014, the West and Central African cholera outbreak as of January 25, 2015 claimed 1,683 registered deaths and over 91,361 reported cases with a reported case fatality rate (CFR)"
    },
    {
        "text": "Elections for the Legislature of Guam took place on November 4, 2014, coinciding with the 2014 United States elections and the Guam gubernatorial election. All 15 seats in the Legislature of Guam"
    },
    {
        "text": "Eleanor Poppy Miranda de Freitas (26 June 1990 – 4 April 2014) was an English woman who committed suicide three days before the commencement of her trial for perverting the course of justice for allegedly making a false accusation of rape. Her death prompted a debate over whether prosecuting people accused of making a false accusation of rape could deter rape victims from reporting the crime, as well as whether it was appropriate to prosecute vulnerable individuals (de Freitas had been diagnosed with bipolar disorder and depression and was judged by a psychiatrist to represent a suicide risk). The decision to prosecute de Freitas was ultimately upheld by both the Director of Public Prosecutions and the Attorney General for England and Wales, while the Metropolitan Police Service paid"
    },
    {
        "text": "In 2014, two explosions of ammunition depots occurred in Vrbětice of Vlachovice) in the Zlín District of the Czech Republic. The first explosion occurred on 16 October, and the second on 3 December. Two people were killed in the first explosion. The cleaning of unexploded ammunition left by the blasts ended on 13 October 2020. According to the Security Information Service and the Police"
    },
    {
        "text": "Fantastica Mania 2014 was a series of five professional wrestling events co-produced by Japanese promotion New Japan Pro-Wrestling (NJPW) and Mexican promotion Consejo Mundial de Lucha Libre (CMLL) taking place between January"
    },
    {
        "text": "Patagotitan is a genus of titanosaurian sauropod dinosaur from the Cerro Barcino Formation in Chubut Province, Patagonia, Argentina. The genus contains a single species known from at least six young adult individuals, Patagotitan mayorum, which was first announced in 2014 and then validly named in 2017 by José Carballido and colleagues. Preliminary studies and press releases suggested that Patagotitan was the largest known titanosaur and land animal overall, with an estimated length of 37 m (121 ft) and an estimated weight of 69 tonnes (76 short tons). Later research revised the length estimate down to 31 m (102 ft) and weight estimates down to approximately 50–57 tonnes (55–63 short tons), suggesting that Patagotitan was of a similar size to, if not smaller than, its closest relatives Argentinosaurus and"
    },
    {
        "text": "The 2014 SCO summit was the 13th annual summit of heads of state of the Shanghai Cooperation Organisation held between 11 and 12 September in Dushanbe, Tajikistan. Security was among the top"
    },
    {
        "text": "The 2013–2014 Bulgarian protests against the Oresharski cabinet was a series of demonstrations that were held in Bulgaria, mainly in the capital Sofia, against the left-wing coalition cabinet of Oresharski (coalition between Bulgarian Socialist Party and Movement for Rights and Freedoms (DPS), supported by the ultra-nationalist party Ataka). The demonstrations started on 28 May 2013, but actual large-scale protests did not emerge until 14"
    },
    {
        "text": "2014–2016 Croatian war veterans tent protest was 555 days long war veterans protest, often dubbed in Croatia as The Tenters (Croatian: šatoraši). The protests were initially aimed against Ministry of Croatian Veterans"
    },
    {
        "text": "The 2013–2016 epidemic of Ebola virus disease, centered in Western Africa, was the most widespread outbreak of the disease in history. It caused major loss of life and socioeconomic disruption in the region, mainly in Guinea, Liberia and Sierra Leone. The first cases were recorded in Guinea in December 2013; later, the disease spread to neighbouring Liberia and Sierra Leone, with minor outbreaks occurring in Nigeria and Mali. Secondary infections of medical workers occurred in the United States and Spain. In addition, isolated cases were recorded in Senegal, the United Kingdom and Italy. The number of cases peaked in October 2014 and then began to decline gradually, following the commitment of substantial international resources. It caused significant mortality, with a considerable case fatality rate. By the end of"
    },
    {
        "text": "The state visit of Michael D. Higgins to the United Kingdom occurred on 7 April 2014. It was the first state visit of a President of Ireland to the United Kingdom. The"
    },
    {
        "text": "Queen + Adam Lambert Rock Big Ben Live was a concert on New Year's Eve 2014 and New Years Day 2015 performed by Queen + Adam Lambert to celebrate the New Year in the UK. It was performed in the shadow of Big Ben in Central Hall Westminster in Central London. The concert was broadcast live on BBC One from 23:15 to 00:30. From"
    },
    {
        "text": "The Schellenberg smuggling incident is a case in which Canadian citizen Robert Lloyd Schellenberg was arrested, tried, and convicted on charges of smuggling drugs in the People's Republic of China. According to"
    },
    {
        "text": "The 2014 Farafra ambush (also called 2014 Al-Wadi Al-Gedid attack) occurred on 19 July 2014 when unidentified gunmen ambushed a desert checkpoint in the Farafra Oasis Road in Egypt's New Valley Governorate."
    },
    {
        "text": "The Falkland Islands was represented at the 2014 Commonwealth Games in Glasgow by 25 athletes across three sports, badminton, shooting, and lawn bowls, the largest ever Falkland Islands squad to be sent"
    },
    {
        "text": "Arturo (1985 – July 3, 2016) was a polar bear living in Mendoza Zoological Park in Mendoza, Argentina, the only polar bear living in the country. He was born in the United States and transferred to Argentina in 1993. His companion, a female named Pelusa, died of cancer in 2012. The living conditions of the cage Arturo resided in were controversial, as temperatures reach up to 40 °C (104 °F) in Argentina, and the pool in Arturo's cage was only 51 centimetres (20 in) deep. Animal rights activists had, in response, dubbed Arturo the \"world's saddest animal\" and promoted a petition to have him moved to Assiniboine Park Zoo, a zoo in Winnipeg, Manitoba, Canada. The petition was created by Laura Morales of Hamilton, Ontario. It gained considerable"
    },
    {
        "text": "Declared in June 2014, the West and Central African cholera outbreak as of January 25, 2015 claimed 1,683 registered deaths and over 91,361 reported cases with a reported case fatality rate (CFR) of 2% in 11 countries, which is 3 times more than in 2013. The case fatality ratio is high in the Sahelian area, equal or greater than 2%, especially in Nigeria, Chad, Cameroon and Niger. Nigeria, Ghana and Democratic Republic of the Congo being the most affected countries with Ghana reporting its worst outbreak since 1982.In January 2015 the Greater Accra Region and Volta region still reported cases of Cholera while in the rest of Ghana the outbreak was declared over. As of January 11 the Democratic Republic of the Congo, Ghana and Nigeria are the"
    },
    {
        "text": "The Wythenshawe and Sale East by-election was a by-election held on 13 February 2014 for the Parliament of the United Kingdom's House of Commons constituency of Wythenshawe and Sale East, following the"
    },
    {
        "text": "The Delhi-Kathmandu bus is a trans-boundary bus service connecting India and Nepal's capitals at Delhi and Kathmandu respectively. The service is operated by the Delhi Transport Corporation (DTC) and was launched in 2014.While Delhi Transport Corporation (DTC), a state run corporation, will run the bus service from Indian side, the Federation of Nepalese National Transport Entrepreneurs (FNNTE) is operating the bus service under supervision"
    },
    {
        "text": "All Star Extravaganza VI is a professional wrestling pay-per-view event produced by Ring of Honor (ROH). It took place on September 6, 2014, at the Mattamy Athletic Center in Toronto, Ontario, Canada."
    },
    {
        "text": "The 2013–2014 chikungunya outbreak represented the first recorded outbreak of the disease outside of tropical Africa and Asia. In December 2013, the first locally transmitted case of chikungunya in the Americas was detected in Saint Martin. Shortly after the first case the disease began to spread rapidly throughout the Caribbean region. By the end of the year, it had spread to Martinique and Guadeloupe, with suspected cases in Saint Barthélemy. By the end of January 2014, cases had been confirmed in Saint Barthélemy, as well as the British Virgin Islands, Dominica, and French Guiana. On the basis of 4,000 confirmed cases and over 30,000 suspected cases, the Caribbean Public Health Agency (CARPHA) declared a Caribbean-wide epidemic of the virus in early May. By the end of May, four"
    },
    {
        "text": "Parliamentary elections were held in Colombia on 9 March 2014 to elect members to both chambers of Congress. The nationwide constituency for the 102-member Senate was contested, as well as the 166"
    },
    {
        "text": "The 45th Pacific Islands Forum was held from 29 July to 1 August 2014 in Palau. The forum's official opening was held in the capital Ngerulmud, in Melekeok State, but the majority of events were held in Koror, Palau's largest city and former capital. The official theme of the meeting was \"The Ocean: Life & Future\". Topics under discussion include climate change, commercial fishing,"
    },
    {
        "text": "Azerbaijan participated in the Eurovision Song Contest 2014 with the song \"Start a Fire\" written by Stefan Örn, Johan Kronlund and Alessandra Günthardt. The song was performed by Dilara Kazimova. The Azerbaijani Eurovision entrant for the 2014 contest in Copenhagen, Denmark was selected through Böyük Səhnə, a talent show organised by the Azerbaijani broadcaster İctimai Television (İTV). Following three elimination shows and a final on 2 March 2014, a five-member jury selected Dilara Kazimova as the winner. The song \"Start a Fire\" was internally selected and presented to the public on 16 March. Azerbaijan was drawn to compete in the first semi-final of the Eurovision Song Contest which took place on 6 May 2014. Performing during the show in position 8, \"Start a Fire\" was announced among the"
    },
    {
        "text": "In 2014, two explosions of ammunition depots occurred in Vrbětice of Vlachovice) in the Zlín District of the Czech Republic. The first explosion occurred on 16 October, and the second on 3"
    },
    {
        "text": "The 13N was a Cacerolazo against President Cristina Fernández de Kirchner that took place in Argentina on November 13, 2014. It was organized by social networks. The people in the demonstration protested against the high crime rate, the high inflation and the corruption scandals. The people met in the streets Santa Fe and Callao, and then marched to the Plaza de Mayo, which gathered"
    },
    {
        "text": "From March 2012 to May 2014, the Salvadoran government, the Catholic Church, and the country's two largest criminal gangs, Mara Salvatrucha (MS-13) and the 18th Street gang (Barrio 18), came to a"
    },
    {
        "text": "2013–2014 Atlantic winter storms in Europe were a series of winter storms affecting areas of Atlantic Europe and beyond. The French Atlantic coastal regions (chiefly Brittany), South West and Southern England, West"
    },
    {
        "text": "United Nations Multidimensional Integrated Stabilization Mission in the Central African Republic (also called MINUSCA, which is an initialism of its French name Mission multidimensionnelle intégrée des Nations unies pour la stabilisation en"
    },
    {
        "text": "A photograph of then-Labour Party leader Ed Miliband eating a bacon sandwich became a source of sustained commentary and the subject of an internet meme in 2014 and 2015. Taken for the"
    },
    {
        "text": "A long series of criminal investigations have occurred in Brazil associated with Operation Car Wash. The first investigation was launched in March 2014, and is now known as phase 1 of the"
    },
    {
        "text": "The deaths of Simone Camilli and Ali Shehda Abu Afash occurred while the two journalists were reporting on the 2014 Israel–Gaza conflict. Simone Camilli (c. 1979 – 13 August 2014), an Italian, and Ali Shehda Abu Afash (ca. 1979 – 13 August 2014), a Palestinian, were journalists for the Associated Press. They were reporting on a bomb disposal team in Beit Lahiya, located in"
    },
    {
        "text": "Miss Universo Chile 2014, the 51st Miss Universo Chile pageant, was held on December 8, 2014. María Jesús Matthei crowned Hellen Toncio as her successor at end of the event. Hellen will"
    },
    {
        "text": "On October 11, 2014, Jennifer Laude (Tagalog pronunciation: [ˈlaʊdɛ]), a Filipina trans woman, was drowned to death by Joseph Scott Pemberton, a Lance Corporal in the United States Marine Corps in Olongapo,"
    },
    {
        "text": "Protests against the 2013 Egyptian coup d'état erupted in July 2013. Immediately following the removal of President Mohamed Morsi by the Egyptian Armed Forces on 3 July 2013 amid demonstrations against Morsi's rule, many protesters amassed near the Rabia Al-Adawiya Mosque to call for Morsi's return to power and condemn the military, while others demonstrated in support of the military and interim government. Deadly clashes such as Rabaa massacre continued for several days, with three particularly bloody incidents being described by officials as \"massacres\" perpetrated by security forces. During the month of Ramadan (10 July – 7 August), prime minister Hazem al-Beblawy threatened to disperse the ongoing Pro-Morsi sit-ins in Rabaa al-Adaweya square and al-Nahda square. The government crackdown of these protests occurred in a violent dispersal on"
    },
    {
        "text": "Ceiliúradh was a celebration of Irish culture that took place in the Royal Albert Hall on 10 April 2014, to mark the state visit to London of Irish President Michael D. Higgins. It was attended by the President and Sabina Higgins, with Prince and Princess Michael of Kent representing the Royal Family.The event was broadcast live on RTÉ, while an hour long highlights package"
    },
    {
        "text": "The Abkhazian Revolution took place in 2014, when President Aleksandr Ankvab resigned after hundreds of demonstrators stormed his office. After mass protests in the capital Sukhumi and the occupation of his office"
    },
    {
        "text": "Tbilisi, I Love You (Georgian: თბილისი, მიყვარხარ Tbilisi, miq’varkhar) is a 2014 anthology film starring an ensemble cast of actors of various nationalities and part of Emmanuel Benbihy’s Cities Of Love franchise that started with Paris, je t'aime and New York, I Love You. The film consists of a series of 10 short films written and directed by natives of Georgia, and take on"
    },
    {
        "text": "Separate men's and women's Wheelchair Basketball World Championship tournaments were held in 2014. The women's tournament was held at the Mattamy Athletic Centre in Toronto, Canada between 20 and 28 June 2014."
    },
    {
        "text": "The Chinese Golf Factory Workers Strike for Essential Rights was a strike that happened in Shenzhen, China. On July 21, 2014, approximately 300 Chinese workers at China Qilitian Golf Articles (QLT), in"
    },
    {
        "text": "The Abkhazian Revolution took place in 2014, when President Aleksandr Ankvab resigned after hundreds of demonstrators stormed his office. After mass protests in the capital Sukhumi and the occupation of his office on 27 May, Ankvab fled to his hometown of Gudauta and ultimately resigned on 1 June, after previously denouncing the demonstration as an attempted coup d'état.The uprising was attributed to public anger"
    },
    {
        "text": "The Suez Canal Corridor Area Project (Arabic: مشروع تطوير محور قناة السويس) is a megaproject in Egypt that was launched on 5 August 2014 by President Abdel Fattah el-Sisi and completed in"
    },
    {
        "text": "The 2014 European Individual Chess Championship took place from 2 to 15 March in Yerevan. 263 players took part. Although sometimes described as the men's championship, several women took part, including Judit"
    },
    {
        "text": "The 2014 Paris Municipal elections took place on 23 and 30 March 2014, at the same time as other French municipal elections. Anne Hidalgo of the Socialist Party was elected mayor of Paris, becoming the first woman to hold that position. She had been the city's deputy mayor. Hidalgo won with around 55% of the vote in the second round. Her principal opponent was"
    },
    {
        "text": "The 2014 National Coalition Party leadership election was held in Lahti, Finland on 14 June 2014 to elect the new chair of the National Coalition Party. Incumbent party chair and Prime Minister"
    },
    {
        "text": "The following addresses the events in Northern Afghanistan between April 2009 and 2014. While this part of the country had long been relatively peaceful compared to the all-out war zones of the south and east, tensions would flare up again in 2008 when the German soldiers deployed to the area came under attack more often, leading to the deaths of the several soldiers. Previously"
    },
    {
        "text": "Spy Booth was an artwork by Banksy in Cheltenham, England. The piece has been seen as a critique of the global surveillance disclosures of 2013.In 2014, Robin Barton and Bankrobber London helped with the preservation of the artwork, and attempted to broker the removal and sale of the piece. However the artwork was painted onto a Grade II listed building (153–159 Fairview Road) and"
    },
    {
        "text": "Presidential elections were held in Afghanistan on 5 April 2014, with a second round held on 14 June. Incumbent President Hamid Karzai was not eligible to run due to term limits. The"
    },
    {
        "text": "Brit Awards 2014 was held on 19 February 2014. It was the 34th edition of the British Phonographic Industry's annual pop Brit Awards. The awards ceremony was held at The O2 Arena"
    },
    {
        "text": "Operation Okra is the Australian Defence Force (ADF) contribution to the military intervention against the Islamic State. The force is part of Joint Task Force 633 in the Middle East. The operation"
    },
    {
        "text": "Organizations from around the world responded to the West African Ebola virus epidemic. In July 2014, the World Health Organization (WHO) convened an emergency meeting with health ministers from eleven countries and announced collaboration on a strategy to co-ordinate technical support to combat the epidemic. In August, they declared the outbreak an international public health emergency and published a roadmap to guide and coordinate the international response to the outbreak, aiming to stop ongoing Ebola transmission worldwide within 6–9 months. In September, the United Nations Security Council declared the Ebola virus outbreak in the West Africa subregion a \"threat to international peace and security\" and unanimously adopted a resolution urging UN member states to provide more resources to fight the outbreak; the WHO stated that the cost for combating the epidemic will be a minimum of $1 billion.The Economic Community of West African States (ECOWAS) and the World Bank Group have pledged aid money and the World Food Programme announced plans to mobilize food assistance for an estimated 1 million people living in restricted access areas. Several Non-Governmental Organizations have provided assistance in the efforts to control the spread of the disease. Up until the end of September, the humanitarian aid organisation Médecins Sans Frontières (Doctors Without Borders) is the leading organization responding to the crisis, with several treatment centers in the area. Samaritan's Purse has also provided direct patient care and medical support in Liberia; many nations and charitable organizations, foundations, and individuals have also pledged assistance to control the epidemic. As of September 2014,"
    },
    {
        "text": "From July 8 to August 26, 2014, another conflict between Israel and Gaza escalated and led to the outbreak of a war between Israel and Gaza. Between 2,127- 2,168 Gazans were killed, including 578 children. The Gaza Health Ministry reported more than 70% of the victims were civilians whilst Israel reported that 55% of the dead were civilians. On the Israeli side 66 soldiers"
    },
    {
        "text": "On December 29, 2013, three journalists working for the Qatari-based international news channel Al Jazeera English, Australian Peter Greste, Canadian Mohamed Fahmy and Egyptian Baher Mohamed were taken into custody by Egyptian"
    },
    {
        "text": "The Mini-Hollands scheme was introduced in March 2014 by Boris Johnson, then Mayor of London. It took the form of a competition among outer London boroughs for a £100-million fund. Three boroughs – Waltham Forest, Enfield and Kingston – won £30 million each, and the remaining £10 million was shared by several other boroughs. The scheme supported the boroughs to build Dutch-style cycling infrastructure"
    },
    {
        "text": "The 40th G7 summit was held 4–5 June, 2014 in Brussels, Belgium. It was originally scheduled to be held as the “40th G8 summit” and be hosted by Russia in the Black"
    },
    {
        "text": "The 2013–2016 epidemic of Ebola virus disease, centered in Western Africa, was the most widespread outbreak of the disease in history. It caused major loss of life and socioeconomic disruption in the region, mainly in Guinea, Liberia and Sierra Leone. The first cases were recorded in Guinea in December 2013; later, the disease spread to neighbouring Liberia and Sierra Leone, with minor outbreaks occurring in Nigeria and Mali. Secondary infections of medical workers occurred in the United States and Spain. In addition, isolated cases were recorded in Senegal, the United Kingdom and Italy. The number of cases peaked in October 2014 and then began to decline gradually, following the commitment of substantial international resources. It caused significant mortality, with a considerable case fatality rate. By the end of the epidemic, 28,616 people had been infected; of these, 11,310 had died, for a case-fatality rate of 40%. As of 8 May 2016, the World Health Organization (WHO) and respective governments reported a total of 28,646 suspected cases and 11,323 deaths (39.5%), though the WHO believes that this substantially understates the magnitude of the outbreak.On 8 August 2014, a Public Health Emergency of International Concern was declared and on 29 March 2016, the WHO terminated the Public Health Emergency of International Concern status of the outbreak. Subsequent flare-ups occurred; the epidemic was finally declared over on 9 June 2016, 42 days after the last case tested negative on 28 April 2016 in Monrovia.The outbreak left about 17,000 survivors of the disease, many of whom report post-recovery symptoms termed"
    },
    {
        "text": "A by-election was held in the Cook Islands electorate of Murienua on 19 February 2014. The by-election was precipitated by the resignation of the winner of the 2013 Murienua by-election following allegations"
    },
    {
        "text": "On 3 October 2014, Canadian Prime Minister Stephen Harper announced that he would put forth a motion to send forces to participate in the coalition for military intervention against ISIL by deploying"
    },
    {
        "text": "The Arab Sharkas case is the name given to the military trial of nine men in Egypt in August 2014. Six defendants were sentenced to death in October, and executed in May 2015. According to military prosecutors for the government of Egyptian president Abdel Fattah el-Sisi, the defendants killed soldiers during a military raid in the village of Arab Sharkas in March 2014. Human"
    },
    {
        "text": "2013–2014 Satkhira clashes refers to the crackdown on killed in a joint operations by Border Guards Bangladesh, Rapid Action Battalion and Bangladesh police in different places of Satkhira district, Bangladesh during the"
    },
    {
        "text": "Gubernatorial elections were held in the Democratic Republic of the Congo in March 2014. The elections were initially scheduled for 2012, but were delayed until 2014.Elections were held for nineteen provincial governors. Fourteen of the elections were won by allies of President Joseph Kabila, and were considered to have shored up Kabila's position, particularly in terms of control over local defence forces.Some leaders of"
    },
    {
        "text": "The Willis Resilience Expedition was a scientific and exploratory program that took place in Antarctica from November 2013 to January 2014, with the goal of a better understanding of changes in the Earth's climate brought on by global warming in addition to weather-related risk. Announced in August 2013, the expedition was led by explorer Douglas Stoup and Parker Liautaud, a teenage polar adventurer and"
    },
    {
        "text": "Julieka Ivanna Dhu (commonly referred to as Ms Dhu; her first name was generally not used in media reports out of respect for Aboriginal naming customs) was a 22-year-old Aboriginal Australian woman who died in police custody in South Hedland, Western Australia, in 2014. On 2 August that year, police responded to a report that Dhu's partner had violated an apprehended violence order. Upon"
    },
    {
        "text": "On 3 October 2014, Canadian Prime Minister Stephen Harper announced that he would put forth a motion to send forces to participate in the coalition for military intervention against ISIL by deploying combat aircraft. On 7 October 2014, the House of Commons approved of sending nine aircraft to join coalition airstrikes against ISIL in Iraq along with 69 special forces advisors to train the Iraqi government's military. The Canadian Armed Forces' contribution to the coalition against ISIL was later dubbed Operation Impact. On 30 March 2015, the House of Commons voted to extend the mission to targets in Syria. No additional forces were announced.In late November 2015, new Prime Minister Justin Trudeau announced the withdrawal of Canada's fighter aircraft from the fight against ISIL, but their surveillance and"
    },
    {
        "text": "Alexandre-Ferdinand Nguendet (born 23 May 1972) is a Central African politician who served as President of the National Transitional Council of the Central African Republic from 2013 to 2016. He briefly served"
    },
    {
        "text": "Malaysia Airlines Flight 17 (MH17/MAS17) was a scheduled passenger flight from Amsterdam to Kuala Lumpur that was shot down by Russian-controlled forces on 17 July 2014, while flying over eastern Ukraine. All"
    },
    {
        "text": "Conference of Western Balkan States was a 28 August 2014 conference of heads of states and governments of Western Balkans region initiated by German chancellor Angela Merkel. An idea for organization of"
    },
    {
        "text": "The 2014 Honda Indy Toronto was a Canadian open wheel motor race, held as the thirteenth and fourteenth rounds of the 2014 IndyCar Series season. It was the 28th annual edition of the Toronto Indy, and the 29th and 30th IndyCar races to be held at the 1.755-mile (2.824 km) street circuit at Exhibition Place in Toronto, Ontario, Canada. The races were contested over"
    },
    {
        "text": "The 2014 Nuclear Security Summit was a summit held in The Hague, the Netherlands, on March 24 and 25, 2014. It was the third edition of the conference, succeeding the 2012 Nuclear"
    },
    {
        "text": "The 2013–2014 Bulgarian protests against the Oresharski cabinet was a series of demonstrations that were held in Bulgaria, mainly in the capital Sofia, against the left-wing coalition cabinet of Oresharski (coalition between"
    },
    {
        "text": "In 2014, a series of groundbreaking diplomatic meetings was held between Wang Yu-chi, in his official capacity as the Minister of the Mainland Affairs Council (MAC) of the Republic of China (ROC), and Zhang Zhijun, the Minister of the Taiwan Affairs Office (TAO) of the People's Republic of China (PRC). The first meeting took place in Nanjing on 11 February 2014 when Wang visited"
    },
    {
        "text": "Berkin Elvan (5 January 1999 – 11 March 2014) was a 15-year-old boy who was hit on the head by a tear-gas canister fired by a police officer in Istanbul during the"
    },
    {
        "text": "Presidential elections were held in Colombia on 25 May 2014. Since no candidate received 50% of the vote in the first round, a run-off between the two candidates with the most votes"
    },
    {
        "text": "The 2013–14 season was Galatasaray's 110th in existence and 56th consecutive season in the Süper Lig. The club was aiming for an unprecedented twentieth league title, after winning the Süper Lig in"
    },
    {
        "text": "Between the months of March and April 2014, a court in Minya, Egypt, has recommended the death sentence to hundreds of members and supporters of the banned Muslim Brotherhood over an attack"
    },
    {
        "text": "The United States–Africa Leaders Summit 2014 was an international summit held in Washington D.C. from August 4–6, 2014. Leaders from fifty African states attended the three-day summit, which was hosted by U.S."
    },
    {
        "text": "Mercedes-Benz Fashion Week is an annual fashion industry event held in Sydney, Australia. The event is a part of Australian Fashion Week and has taken place at Carriageworks for two consecutive years. The 2014 event was held from 6–10 April. The event focuses on providing Australian designers a platform to connect with a global audience of fashion buyers, press and consumers.The industry-only event showcased"
    },
    {
        "text": "The Report of the Commission of Inquiry on Human Rights in the Democratic People's Republic of Korea is the landmark document resulting from the investigations on human rights in North Korea commissioned by the United Nations Human Rights Council in 2013 and concluded in 2014.The report unequivocally concluded that the North Korean government systematically violated human rights including freedom of thought, expression and religion; freedom from discrimination; freedom of movement and residence; and the right to food.The Commission further determined that North Korea had committed crimes against humanity and manifestly failed to uphold its responsibility to protect. These crimes entail \"extermination, murder, enslavement, torture, imprisonment, rape, forced abortions and other sexual violence, persecution on political, religious, racial and gender grounds, the forcible transfer of populations, the enforced disappearance"
    },
    {
        "text": "On 15 July 2014, at around 8:40 am MSK (UTC+04:00), an outbound Moscow Metro train derailed between Park Pobedy and Slavyansky Bulvar stations of the Arbatsko-Pokrovskaya Line. Casualties reported include 24 dead"
    },
    {
        "text": "From mid-2014 onward, Brazil experienced a severe economic crisis. The country's Gross Domestic Product (GDP) fell by 3.5% in 2015 and 3.3% in 2016, after which a small economic recovery began. That"
    },
    {
        "text": "United Nations Multidimensional Integrated Stabilization Mission in the Central African Republic (also called MINUSCA, which is an initialism of its French name Mission multidimensionnelle intégrée des Nations unies pour la stabilisation en Centrafrique) is a UN peacekeeping mission, which started on April 10, 2014, to protect Central African Republic civilians under Chapter VII of the UN Charter. It transformed the 6,000-strong African Union-led peacekeeping force known as MISCA into a UN peacekeeping mission and became operational on September 15, 2014. The UN deployed a transition team to set up MINUSCA and prepare for a seamless transition of authority from MISCA to MINUSCA. As of 30 September 2021, it has more than 15,000 troops, police and civilian personnel on the ground. Its role is to: support for the transition"
    },
    {
        "text": "2014 Kunar Offensive refers to a 2014 armed conflict of the War in Afghanistan, between the Afghan Army and a terrorist group, Tehrik-i-Taliban Pakistan (TTP). It occurred in the Dangam district of eastern Kunar province, in Afghanistan bordering on Pakistan.The offensive was launched by the Afghan Army on 22 December 2014 after Kunar province had been the site of armed clashes since 12 December"
    },
    {
        "text": "China–Brazil Earth Resources Satellite 4 (CBERS-4), also known as Ziyuan I-04 or Ziyuan 1E, is a remote sensing satellite intended for operation as part of the China–Brazil Earth Resources Satellite program between the Chinese Center for Resources Satellite Data and Application and Brazilian National Institute for Space Research. The fifth CBERS satellite to fly, it was successfully launched on 7 December 2014. It replaces"
    },
    {
        "text": "Anti-government protests (Khmer: បាតុកម្មប្រឆាំងរាជរដ្ឋាភិបាល) were a series of protests in Cambodia from July 2013 to July 2014. Popular demonstrations in Phnom Penh took place against the government of Prime Minister Hun Sen,"
    },
    {
        "text": "The 2014 West Midlands Police and Crime Commissioner by-election was a by-election for the position of Police and Crime Commissioner in the West Midlands Police region of the United Kingdom, held on"
    },
    {
        "text": "The 2013–2016 epidemic of Ebola virus disease, centered in Western Africa, was the most widespread outbreak of the disease in history. It caused major loss of life and socioeconomic disruption in the region, mainly in Guinea, Liberia and Sierra Leone. The first cases were recorded in Guinea in December 2013; later, the disease spread to neighbouring Liberia and Sierra Leone, with minor outbreaks occurring"
    },
    {
        "text": "The Mini-Hollands scheme was introduced in March 2014 by Boris Johnson, then Mayor of London. It took the form of a competition among outer London boroughs for a £100-million fund. Three boroughs"
    },
    {
        "text": "From March 2012 to May 2014, the Salvadoran government, the Catholic Church, and the country's two largest criminal gangs, Mara Salvatrucha (MS-13) and the 18th Street gang (Barrio 18), came to a truce, known in El Salvador simply as the Gang Truce (Spanish: Tregua entre Pandillas), to lower the country's rate of homicides and extortions in exchange for improved prison conditions and certain visitation"
    },
    {
        "text": "Following the simultaneous federal elections and regional elections of 25 May 2014, negotiations started to form a new Federal Government as well as new regional governments: a Flemish, Walloon, French Community and Brussels Government. A Government of the German-speaking Community was formed only a few days after the elections. The outgoing federal Di Rupo Government consisted of a tripartite of the three traditional \"ideological"
    },
    {
        "text": "The Economic Adjustment Programme for Cyprus, usually referred to as the Bailout programme, is a memorandum of understanding on financial assistance to the Republic of Cyprus in order to cope with the"
    },
    {
        "text": "A by-election was held in the Cook Islands electorate of Murienua on 19 February 2014. The by-election was precipitated by the resignation of the winner of the 2013 Murienua by-election following allegations of election fraud.Both candidates in the 2013 by-election indicated that they would run again. A \"stand-in\" candidate for the Cook Islands Party, Tare Mareiti, subsequently withdrew. The election was won by the"
    },
    {
        "text": "Miss World 2014, the 64th edition of the Miss World pageant, was held on 14 December 2014 at the ExCeL London in London, United Kingdom. 121 contestants competed for the crown. Megan"
    },
    {
        "text": "The Minsk agreements were a series of international agreements which sought to end the Donbas war fought between armed Russian separatist groups and Armed Forces of Ukraine, with Russian regular forces playing a central part. The first, known as the Minsk Protocol, was drafted in 2014 by the Trilateral Contact Group on Ukraine, consisting of Ukraine, Russia, and the Organization for Security and Co-operation"
    },
    {
        "text": "The Brazilian Anti-Corruption Act (Brazilian Portuguese: Lei anticorrupção) officially \"Law No. 12,846\" and commonly known as the Clean Company Act (Lei da Empresa Limpa) is a Brazilian law enacted in 2014 targeting"
    },
    {
        "text": "The International Year of Crystallography (abbreviation: IYCr2014) is an event promoted in the year 2014 by the United Nations to celebrate the centenary of the discovery of X-ray crystallography and to emphasise the global importance of crystallography in human life. UNESCO and the International Union of Crystallography (IUCr) are responsible for this event. The opening ceremony of the International Year of Crystallography was held"
    },
    {
        "text": "The 45th Pacific Islands Forum was held from 29 July to 1 August 2014 in Palau. The forum's official opening was held in the capital Ngerulmud, in Melekeok State, but the majority"
    },
    {
        "text": "Below are the foreign reactions to the Euromaidan. Euromaidan was a wave of demonstrations and civil unrest in Ukraine that began on the night of 21 November 2013 after the Ukrainian government"
    },
    {
        "text": "Eleanor Poppy Miranda de Freitas (26 June 1990 – 4 April 2014) was an English woman who committed suicide three days before the commencement of her trial for perverting the course of"
    },
    {
        "text": "The 2014 Toronto FC season was the eighth season in club history. During the off-season, Toronto FC agreed to a one-year partnership with USL outfit Wilmington Hammerheads. Jackson, Justin Morrow, Dwayne De Rosario, Gilberto, Michael Bradley, Jermain Defoe, Bradley Orr, Collen Warner, Luke Moore, Dominic Oduro, Warren Creavalle and Júlio César came to Toronto. Toronto opened pre-season on January 24. Toronto will start the"
    },
    {
        "text": "The 2014 G20 Brisbane summit was the ninth meeting of the G20 heads of government/heads of state. It was held in Brisbane, the capital city of Queensland, Australia, on 15–16 November 2014. The hosting venue was the Brisbane Convention & Exhibition Centre at South Brisbane. The event was the largest ever peacetime police operation in Australia.On 1 December 2013 Brisbane became the official host"
    },
    {
        "text": "General elections were held in Bolivia on 12 October 2014, the second to take place under the country's 2009 constitution, and the first supervised by the Plurinational Electoral Organ, a newly created fourth branch of government. Incumbent President Evo Morales was re-elected for a third term. Bolivian voters elected the President and Vice President of the Republic, 130 members of the Chamber of Deputies,"
    },
    {
        "text": "The Delhi-Kathmandu bus is a trans-boundary bus service connecting India and Nepal's capitals at Delhi and Kathmandu respectively. The service is operated by the Delhi Transport Corporation (DTC) and was launched in 2014.While Delhi Transport Corporation (DTC), a state run corporation, will run the bus service from Indian side, the Federation of Nepalese National Transport Entrepreneurs (FNNTE) is operating the bus service under supervision of the Ministry of Physical Infrastructure and Transport MoPIT. Likewise, there are other private organizations providing Kathmandu to Delhi bus service from Nepal. This bus service has a 2X2 seating arrangement and is an AC bus service. The service operates from Dr. Ambedkar bus stand near Delhi gate in Delhi. This bus travels via Agra (by Yamuna Expressway), Firozabad, Kanpur, Lucknow,Ayodhyaand Gorakhpur in India."
    },
    {
        "text": "Blood Swept Lands and Seas of Red was a public art installation created in the moat of the Tower of London, England, between July and November 2014. It commemorated the centenary of the outbreak of World War I and consisted of 888,246 ceramic red poppies, each intended to represent one British or Colonial serviceman killed in the War. The ceramic artist was Paul Cummins,"
    },
    {
        "text": "The 2014 Australian federal budget was the federal budget to fund government services and operations for the 2014/15 financial year. The 2014 budget was the first delivered by the Abbott government, since"
    },
    {
        "text": "The 31st Robert Awards ceremony was held on 26 February 2014 in Copenhagen, Denmark. Organized by the Danish Film Academy, the awards honoured the best in Danish and foreign film of 2013."
    },
    {
        "text": "The Delhi-Kathmandu bus is a trans-boundary bus service connecting India and Nepal's capitals at Delhi and Kathmandu respectively. The service is operated by the Delhi Transport Corporation (DTC) and was launched in"
    },
    {
        "text": "Between 13 and 18 May 2014 a low-pressure cyclone designated Tamara and Yvette affected a large area of Southeastern and Central Europe, causing floods and landslides. Serbia and Bosnia and Herzegovina suffered the greatest damage, as the rain was the heaviest in 120 years of recorded weather measurements. By 20 May, at least 62 people had died as a result of the flooding, and hundreds of thousands had been forced from their homes. Towns of Obrenovac in Serbia and Doboj in Bosnia and Herzegovina account for most victims, after being inundated by several-meter high waters from nearby rivers.Floodwaters caused over 2,000 landslides across Southeast Europe, spreading damage across many towns and villages. The rains activated torrents and mudslides, and subsequently several rivers in watersheds of Sava and Morava"
    },
    {
        "text": "The eighteenth summit of 'South Asian Association of Regional Cooperation' (SAARC) was held in Kathmandu, the capital of Federal Democratic Republic of Nepal during 26–27 November 2014. The theme of the summit"
    },
    {
        "text": "General elections were held in Costa Rica on Sunday, 2 February 2014 to elect a new president, two vice presidents, and 57 Legislative Assembly lawmakers. In accordance with Article 132 of the constitution, incumbent President Laura Chinchilla Miranda was ineligible to run for a second consecutive term.The ruling National Liberation Party put forward San José Mayor Johnny Araya Monge as its presidential candidate; the Libertarian Movement party nominated former legislator Otto Guevara Guth; the leftist Broad Front nominated José María Villalta Florez-Estrada; and the center-left Citizens' Action Party nominated Luis Guillermo Solís Rivera. Opinion polls in December 2013 showed Araya ahead with 37 percent, Villalta close behind at 32 percent, Guevara at 15 percent, and Solís trailing at eight percent, suggesting the likelihood of a run-off vote in"
    },
    {
        "text": "The 2014 Iquique earthquake struck off the coast of Chile on 1 April, with a moment magnitude of 8.2, at 20:46 local time (23:46 UTC). The epicenter of the earthquake was approximately 95 kilometres (59 mi) northwest of Iquique. The mainshock was preceded by a number of moderate to large shocks and was followed by a large number of moderate to very large aftershocks,"
    },
    {
        "text": "Breck David Lafave Bednar (17 March 1999 – 17 February 2014) was an English teenager of American descent from Caterham, Surrey, who was murdered by 18-year-old Lewis Daynes on 17 February 2014,"
    },
    {
        "text": "Global Wars was a professional wrestling supershow co-produced by the American Ring of Honor (ROH) and Japanese New Japan Pro-Wrestling (NJPW) promotions. The event took place on May 10, 2014, at the Ted Reeve Arena in Toronto, Ontario, Canada and aired live on internet pay-per-view (iPPV) through Ustream. The event was originally billed as \"Border Wars\", a name ROH had used for events in 2012 and 2013.With the exception of one interpromotional match, wrestlers from NJPW and ROH were kept separated from each other with the bookers from each promotion handling their own half of the show. The event featured nine matches with three championships on the line; two from ROH and one from NJPW. In the undercard of the event, The Young Bucks retained the IWGP Junior"
    },
    {
        "text": "The Trojan Horse scandal, also known as \"Operation Trojan Horse\" or the Trojan Horse affair, involves claims of an alleged conspiracy to introduce an \"Islamist\" or \"Salafist\" ethos into several schools in Birmingham, England. The name, based on the Greek legend, comes from an anonymous letter sent to Birmingham City Council in late 2013, alleged to be from Birmingham \"Islamists\" detailing how to wrest control of a school, and speculating about expanding the scheme to other cities. The letter was leaked to the press in March 2014. Around a month later, Birmingham City Council revealed that following the letter release it had received hundreds of allegations of plots similar to those described in the letter, some claims dating back over 20 years.Tahir Alam, former chairman of the Park View Educational Trust which ran three schools in Birmingham, was alleged to have written a 72-page document for the Muslim Council of Britain in 2007 detailing a blueprint for the \"Islamisation\" of secular state schools, a claim that has been widely debunked. This document provided guidance about the religious needs and practices of Muslim parents and pupils that would facilitate their integration into schools. It was entitled Towards Greater Understanding: Meeting the Needs of Muslim Pupils in State Schools. Information and Guidance for Schools and is available as an appendix to the Kershaw Report. The introduction of the document states that the \"purpose is to promote greater understanding of the faith, religious and cultural needs of Muslim pupils and how they can be accommodated within schools. It also"
    },
    {
        "text": "The Hampden Bridge was a heritage-listed wooden Allan Truss bridge over the Murrumbidgee River in Wagga Wagga, in New South Wales, Australia. It was officially opened to traffic on 11 November 1895"
    },
    {
        "text": "Presidential elections were held in Croatia on 28 December 2014 and 11 January 2015, the sixth such elections since independence in 1991. Only four candidates contested the elections, the lowest number since 1997. Incumbent President Ivo Josipović, who had been elected as the candidate of the Social Democratic Party in 2009–2010 but ran as an independent, was eligible to seek reelection for a second"
    },
    {
        "text": "The 2014 Berlin Marathon was the 41st edition of the Berlin Marathon. The marathon took place in Berlin, Germany, on 28 September 2014 and was the fourth World Marathon Majors race of the year. The men's race was won by Kenyan athlete Dennis Kimetto in a world record time of 2:02:57, breaking the previous record of Wilson Kipsang by 26 seconds. Kimetto's performance means that the last six men's world records at the distance have all been set at the Berlin Marathon. Runner-up Emmanuel Mutai also surpassed Kipsang's old mark, finishing in 2:03:13. En route to his second-place finish, Mutai set a world record at the 30K distance (1:27:37).The women's race was won by Tirfi Tsegaye of Ethiopia in a time of 2:20:18 hours. Finishing third in a"
    },
    {
        "text": "The 2014 Coupe de la Ligue Final was the 20th final of France's football league cup competition, the Coupe de la Ligue, a competition for the 42 teams that the Ligue de Football Professionnel (LFP) manages. The final took place on 19 April 2014 at the Stade de France in Saint-Denis and was contested between Lyon and Paris Saint-Germain. PSG won 2–1 and became"
    },
    {
        "text": "The ANZAC centenary advisory board was established by Department of the Prime Minister and Cabinet of Australia to organise the centenary commemorations of the Australian and jointly New Zealand contribution to the"
    },
    {
        "text": "The 2014 Coupe de la Ligue Final was the 20th final of France's football league cup competition, the Coupe de la Ligue, a competition for the 42 teams that the Ligue de"
    },
    {
        "text": "Early general elections were held in Greenland on 28 November 2014. They were called after Prime Minister Aleqa Hammond resigned following a spending scandal. Siumut and Inuit Ataqatigiit emerged as the largest"
    },
    {
        "text": "The Hotesur scandal took place in Argentina in 2014. Hotesur is a firm that administers the hotels in El Calafate that belong to Cristina Fernández de Kirchner and her family. Initially, it was suspected of not paying taxes, but the investigation headed by judge Claudio Bonadio led to suspicions about a possible case of money laundering, involving the businessman Lázaro Báez as well. As"
    },
    {
        "text": "Spy Booth was an artwork by Banksy in Cheltenham, England. The piece has been seen as a critique of the global surveillance disclosures of 2013.In 2014, Robin Barton and Bankrobber London helped with the preservation of the artwork, and attempted to broker the removal and sale of the piece. However the artwork was painted onto a Grade II listed building (153–159 Fairview Road) and the council prevented it from being removed, giving it retrospective listed building consent in 2015 and affording it some protection from removal. Despite this, the artwork was removed, destroying it in August 2016. Spy Booth was auctioned as nine stucco-faced brick fragments sawed from the wall and as an NFT.The GCHQ has used the picture, as a symbolic image for \"How does an analyst"
    },
    {
        "text": "The 19th Empire Awards ceremony (officially known as the Jameson Empire Awards), presented by the British film magazine Empire, honored the best films of 2013 and took place on 30 March 2014"
    },
    {
        "text": "The 2014 Channel O Music Video Awards took place on 29 November 2014 at the Nasrec Expo Centre in Soweto. Nominees were announced on 4 September. Cassper Nyovest, K.O and Davido led the nominations with 5 each. DJ Clock's hit song \"Pluto\", which features the singing trio Beatenberg, followed with 4. AKA and Uhuru both received three nominations apiece. Cassper Nyovest and Diamond Platnumz"
    },
    {
        "text": "The African Declaration on Internet Rights and Freedoms (AfDec) has been created in order to promote an Internet environment that conforms to established human rights standards and meets Africa's social and economic development needs. The Declaration was agreed on at the 2013 African Internet Governance Forum (AfIGF) in Nairobi, Kenya and launched in 2014 at the global Internet Governance Forum in Istanbul, Turkey. It"
    },
    {
        "text": "The Suez Canal Corridor Area Project (Arabic: مشروع تطوير محور قناة السويس) is a megaproject in Egypt that was launched on 5 August 2014 by President Abdel Fattah el-Sisi and completed in 2015. The project aimed to increase the role of the Suez Canal region in international trade and to develop the canal cities of Suez, Ismailia, and Port Said. The project involved building a new city (Ismailia), an industrial zone, fish farms, encouraging the development of a tech industry, building seven new tunnels between Sinai and Ismailia and Port Said, improving five existing ports, creating new centers for logistics and ship services, and digging a new canal parallel to the Suez Canal. The new canal was constructed to increase capacity by allowing ships to sail in both"
    },
    {
        "text": "Spectra is the name of a series of art installations by Ryoji Ikeda which use intense white light as a sculptural material. The most recent presentation of spectra was in Hobart, Tasmania, Australia for four days ending 24 June, 2018 to mark the winter solstice, and as an installation piece at the Dark Mofo festival held by MONA. spectra [Amsterdam] was the first presentation"
    },
    {
        "text": "The 28th Goya Awards were presented at the Madrid Marriott Auditorium Hotel in Madrid on February 9, 2014 to honour the best in Spanish films of 2013. Manel Fuentes was the master of ceremonies for the first time. Nominees were announced on January 7, 2014.Living Is Easy with Eyes Closed won six awards, including Best Film, Best Director, Best Actor and Best Original Screenplay,"
    },
    {
        "text": "The blockade of the Gaza Strip is the ongoing land, air, and sea blockade of the Gaza Strip imposed by Israel and Egypt temporarily in 2005–2006 and permanently from 2007 onwards, following the Israeli disengagement from Gaza.The blockade was made permanent after Hamas took control of the Gaza Strip during the Battle of Gaza, seizing government institutions and replacing Fatah and other Palestinian Authority (PA) officials with Hamas members. Earlier, after Hamas won elections and formed the PA government in March 2006, led by Ismail Haniya, Israel and the Quartet on the Middle East set conditions before they would continue to provide aid to the PA or have any dialogue with any member of a Hamas-led PA government. These conditions were: recognition of Israel, disavowal of violent actions,"
    },
    {
        "text": "The 16th Meril Prothom Alo Awards ceremony, presented by Prothom Alo took place on 25 April 2014, at the Bangabandhu International Conference Center in Dhaka, Bangladesh as a part of 2013–14 film"
    },
    {
        "text": "G 1/11 is a decision issued on 19 March 2014 by the Enlarged Board of Appeal of the European Patent Office (EPO), holding that a Technical Board of Appeal rather than the Legal Board of Appeal is competent for an appeal against a decision of an Examining Division refusing a request for refund of a search fee under Rule 64(2) EPC, which has not"
    },
    {
        "text": "On 18 April 2014, a group of sixteen Chinese citizens, later identified as ethnic Uyghurs, engaged in a shootout with Vietnamese border guards after seizing their guns as they were being detained"
    },
    {
        "text": "The Eurovision Song Contest 2014 was the 59th edition of the Eurovision Song Contest. It took place in Copenhagen, Denmark, following the country's victory at the 2013 contest with the song \"Only Teardrops\" by Emmelie de Forest. Organised by the European Broadcasting Union (EBU) and host broadcaster Danish Broadcasting Corporation (DR), the contest was held at B&W Hallerne, and consisted of two semi-finals on 6 and 8 May, and a final on 10 May 2014. The three live shows were presented by Danish television presenter Lise Rønne, musician Nikolaj Koppel and actor Pilou Asbæk.Thirty-seven countries participated in the contest; this included the return of Poland and Portugal after absences of two years and one year respectively. Overall, there were two fewer countries competing compared to the previous year,"
    },
    {
        "text": "The International Year of Crystallography (abbreviation: IYCr2014) is an event promoted in the year 2014 by the United Nations to celebrate the centenary of the discovery of X-ray crystallography and to emphasise"
    },
    {
        "text": "The 2014 Mexico–Guatemala earthquake struck 4 km (2.5 mi) west of Puerto Madero on July 7 at 05:23:54. The shock had a moment magnitude of 6.9 and a maximum Mercalli intensity of"
    },
    {
        "text": "From March 2012 to May 2014, the Salvadoran government, the Catholic Church, and the country's two largest criminal gangs, Mara Salvatrucha (MS-13) and the 18th Street gang (Barrio 18), came to a truce, known in El Salvador simply as the Gang Truce (Spanish: Tregua entre Pandillas), to lower the country's rate of homicides and extortions in exchange for improved prison conditions and certain visitation privileges. The truce's principal negotiators were Minister of Public Security David Munguía Payés, former deputy Raúl Mijango, and Bishop Fabio Colindres, and the negotiations were overseen by President Mauricio Funes. The existence of the truce was alleged by the online newspaper El Faro in early March 2012, after 30 gang leaders were transferred from a maximum-security prison to a lower-security prison, and confirmed after"
    },
    {
        "text": "The state visit of Michael D. Higgins to the United Kingdom occurred on 7 April 2014. It was the first state visit of a President of Ireland to the United Kingdom. The visit came three years after the first state visit by a reigning British monarch to what is now the Republic of Ireland following its independence. President Michael D. Higgins and his wife"
    },
    {
        "text": "The third edition of the Champs-Élysées Film Festival was held from 11 to 17 June 2014, with actors Jacqueline Bisset and Bertrand Tavernier as Honorary Presidents and Keanu Reeves, Agnès Varda, Whit Stillman and Mike Figgis as Guests of Honor. More than 120,000 people attended the Festival, with more than 110 films screened. Ronit Elkabetz and Shlomi Elkabetz's Gett: The Trial of Viviane Amsalem"
    },
    {
        "text": "United Nations Security Council Resolution 2167, concerning the critical role of regional cooperation in International Peacekeeping and Security was adopted unanimously on 28 July 2014. The resolution originated through a debate initiated by the Permanent Representative of Rwanda by sending a letter dated 3 July addressed to the Secretary-General. The 15 member body emphasised that concrete steps should be taken by United Nations and"
    },
    {
        "text": "The 2014 Iquique earthquake struck off the coast of Chile on 1 April, with a moment magnitude of 8.2, at 20:46 local time (23:46 UTC). The epicenter of the earthquake was approximately"
    },
    {
        "text": "The Willis Resilience Expedition was a scientific and exploratory program that took place in Antarctica from November 2013 to January 2014, with the goal of a better understanding of changes in the Earth's climate brought on by global warming in addition to weather-related risk. Announced in August 2013, the expedition was led by explorer Douglas Stoup and Parker Liautaud, a teenage polar adventurer and environmental campaigner. The expedition was underwritten by Willis Group, a global risk advisor, insurance and reinsurance broker. The communications team, including driver and mechanic Eyjo Furteitsson, communication manager Nathan Hambrook-Skinner, and cinematographer Paddy Scott trailed the team in the 6x6 expedition truck built especially for the expedition by Arctic Trucks.The expedition consisted of three main components: Science. Liautaud and Stoup conducted an isotope transect"
    },
    {
        "text": "Around midday on October 22, 2014, a passing motorist saw an Asian woman walking north along the Ingraham Trail on the outskirts of Yellowknife in the Northwest Territories, Canada. Several days later,"
    },
    {
        "text": "The War of 1812 Monument, officially titled Triumph Through Diversity (Triomphe grâce à la diversité in French), is a bronze and stone memorial, located at Parliament Hill in Ottawa, Ontario, Canada, Canada's capital. Seven figures—a First Nations fighter, a Métis militiaman, a regular infantryman from the Royal Newfoundland Regiment of Fencible Infantry, a Quebec soldier of the Canadian Voltigeurs being bandaged by a female figure, a Royal Navy marine, and a farmer—represent those who took part on the Canadian side of the War of 1812. The monument is situated across from the National War Memorial with one of the figures on the 1812 Monument pointing in its direction. Also part of the monument is a maple tree planted in soil taken from 10 Canadian battlefield sites and watered"
    },
    {
        "text": "The third competition weekend of the 2014–15 ISU Speed Skating World Cup will be held in Sportforum Hohenschönhausen in Berlin, Germany, from Friday, 5 December, until Sunday, 7 December 2014.Artur Waś of"
    },
    {
        "text": "Belarus participated in the Eurovision Song Contest 2014 with the song \"Cheesecake\" written by Yuriy Vashchuk and Dmitry Novik. The song was performed by Teo, which is the artistic name of singer Yuriy Vashchuk. The Belarusian entry for the 2014 contest in Copenhagen, Denmark was selected through a national final organised by the Belarusian broadcaster National State Television and Radio Company of the Republic of Belarus (BTRC). The national final consisted of fourteen competing acts participating in a televised production where \"Cheesecake\" performed by Teo was selected as the winner following the combination of votes from a jury panel and public televoting. Belarus was drawn to compete in the second semi-final of the Eurovision Song Contest which took place on 8 May 2014. Performing during the show in"
    },
    {
        "text": "S.A.S. v. France was a case brought for the European Court of Human Rights which ruled that the French ban on face covering did not violate European Convention on Human Rights's (ECHR) provisions on right to privacy or freedom of religion, nor other invoked provisions. On these two points, the Court held her decision by fifteen votes to two. The two judges in the minority expressed their partly dissenting opinion. The French ban against face covering, loi n° 2010-1192 du 11 octobre 2010 interdisant la dissimulation du visage dans l'espace public, was adopted on 11 October 2010 and went into effect on 11 April 2011. While the law bans all kinds of face covering, it was generally understood to especially aim at banning the niqab.On the same day the law came into force, a French woman born in 1990 of Pakistani origin referred to as S.A.S. filed a complaint against the French state as the law prevented to her from wearing the niqab in public places.The woman argued that the law violated articles 3 (against inhuman or degrading treatment or punishment), 8 (on the right to privacy), 9 (on the freedom of religion), 10 (on the right to freedom of expression), 11 (on the right to freedom of assembly), and 14 (which prohibits discrimination) of the ECHR.On their side, the French state argued with regard to articles 8 and 9, that the exceptions in paragraph 2 of these articles applied. Paragraph 2 of article 9 allows limitations on the right to religion if the limitations \"are"
    },
    {
        "text": "Atiqullah Raufi was the chief of the secretariat of the Supreme Court of Afghanistan. He was assassinated as he was heading to work on December 13, 2014, around 9:00 a.m., in Kabul,"
    },
    {
        "text": "The Rotherham child sexual exploitation scandal consists of the organised child sexual abuse that occurred in the town of Rotherham, South Yorkshire, Northern England from the late 1980s until the 2010s and"
    },
    {
        "text": "Anti-government protests (Khmer: បាតុកម្មប្រឆាំងរាជរដ្ឋាភិបាល) were a series of protests in Cambodia from July 2013 to July 2014. Popular demonstrations in Phnom Penh took place against the government of Prime Minister Hun Sen, triggered by widespread allegations of electoral fraud during the Cambodian general election of 2013. Demands to raise the minimum wage to $160 a month and resentment at Vietnamese influence in Cambodia have"
    },
    {
        "text": "Miss International 2014, the 54th Miss International pageant, organized by the International Cultural Association held on November 11, 2014 at the Grand Prince Hotel Takanawa in Tokyo, Japan. Bea Santiago of the"
    },
    {
        "text": "The 2014 UK Music Video Awards were held on 10 November 2014 at the Queen Elizabeth Hall in Southbank Centre, London and was hosted by Adam Buxton to recognise the best in music videos and music film making from United Kingdom and worldwide. The nominations were announced on 2 October 2014. The collaboration \"Turn Down for What\" between French producer DJ Snake and American"
    },
    {
        "text": "The 2014 Honda Indy Toronto was a Canadian open wheel motor race, held as the thirteenth and fourteenth rounds of the 2014 IndyCar Series season. It was the 28th annual edition of"
    },
    {
        "text": "The 2015 World Junior Ice Hockey Championships was the 39th edition of Ice Hockey World Junior Championship, played from December 26, 2014 to January 5, 2015. It was co-hosted by Toronto, Ontario, and Montreal, Quebec, Canada, and organized by Hockey Canada, Hockey Quebec, the Ontario Hockey Federation, the Montreal Canadiens, Maple Leafs Sports and Entertainment and Evenko. Games were split between Air Canada Centre in Toronto and Bell Centre in Montreal, with Montreal hosting Group A matches and two quarter finals, and Toronto hosting Group B, along with the relegation games, two quarter finals, along with the semi-finals, bronze medal, and gold medal games.After failing to medal at the previous two editions of the tournament, Canada beat Russia in the final to win the gold medal, marking Canada's"
    },
    {
        "text": "Miss Colombia 2014 was the 62nd edition of the Miss Colombia pageant. It was held on November 17, 2014 in Cartagena, Colombia. At the end of the event, Paulina Vega of Atlántico"
    },
    {
        "text": "Hamas, the governing authority in the Gaza Strip, has constructed a sophisticated network of military tunnels since it seized control of the Strip in 2007. The tunnel system branches beneath many Gazan towns and cities, such as Khan Yunis, Jabalia and the Shati refugee camp. The internal tunnels, running some dozens of kilometres within the Gaza Strip, have several functions. Hamas uses the tunnels to hide its arsenal of rocketry underground, to facilitate communication, to permit munition stocks to be hidden, and to conceal militants, making detection from the air difficult. Hamas leader Khalid Meshal said in an interview with Vanity Fair that the tunnel system is a defensive structure, designed to place obstacles against Israel's powerful military arsenal and engage in counter-strikes behind the lines of the IDF. He admitted that the tunnels are used for infiltration of Israel, but said that offensive operations have never caused the death of civilians in Israel, and denied allegations of planned mass attacks on Israeli civilians.The cross-border tunnels were used in the capture of Gilad Shalit in 2006, and multiple times during the 2014 conflict. Destroying the tunnels was a primary objective of Israeli forces in the 2014 Israel–Gaza conflict. The IDF reported that it \"neutralized\" 32 tunnels, fourteen of which crossed into Israel. On at least four occasions during the conflict, Palestinian militants crossing the border through the tunnels engaged in combat with Israeli soldiers. Officially, Israeli spokesmen has always maintained that the aim of the “terror tunnels” is to harm Israel civilians. According to Prime Minister"
    },
    {
        "text": "Talking Statues is a project created initially in 2013 by David Peter Fox in Copenhagen, Denmark involving pre-recorded voiceovers accompanying various statues available in a smartphone app. The statue of Hans Christian Andersen in the King's Garden in Copenhagen was the first talking statue in the world. Later the idea was applied in Helsinki, New York, London, San Diego, Chicago, Vilnius, Parma, Dublin, Berlin, Manchester, and others. The project works with mobile technology and activated through a QR code found on the statue, when you scan it you will be called. You can also download our app, then you can find the Talking Statues in the world and have it talk to GPS so that they call you on your smartphone when you get close to the statue."
    },
    {
        "text": "On 22 October 2014, a Palestinian rammed his car into a crowd of people waiting at the Ammunition Hill light rail station in the Sheikh Jarrah neighbourhood in East Jerusalem. The attack killed a three-month-old girl and a 22-year-old Ecuadorian potential convert to Judaism, and injured seven others. Police shot the driver of the vehicle as he fled the scene and he later died"
    },
    {
        "text": "On 28 April 2014, 61-year-old teacher Ann Maguire (5 April 1953 – 28 April 2014) was stabbed to death while teaching a Spanish lesson at Corpus Christi Catholic College in Halton Moor,"
    },
    {
        "text": "Euromaidan (; Ukrainian: Євромайдан, romanized: Yevromaidan, lit. 'Euro Square', IPA: [jeu̯romɐjˈdɑn]), or the Maidan Uprising, was a wave of demonstrations and civil unrest in Ukraine, which began on 21 November 2013 with large protests in Maidan Nezalezhnosti (Independence Square) in Kyiv. The protests were sparked by President Viktor Yanukovych's sudden decision not to sign the European Union–Ukraine Association Agreement, instead choosing closer ties to Russia and the Eurasian Economic Union. Ukraine's parliament had overwhelmingly approved of finalizing the Agreement with the EU, but Russia had put pressure on Ukraine to reject it. The scope of the protests widened, with calls for the resignation of Yanukovych and the Azarov government. Protesters opposed what they saw as widespread government corruption, abuse of power, human rights violations, and the influence of"
    },
    {
        "text": "The 2014 West Midlands Police and Crime Commissioner by-election was a by-election for the position of Police and Crime Commissioner in the West Midlands Police region of the United Kingdom, held on 21 August 2014. It was triggered by the death of Bob Jones, the inaugural West Midlands Police and Crime Commissioner, who died on 1 July 2014.The election had to be held with"
    },
    {
        "text": "The war on terror, officially the Global War on Terrorism (GWOT), is a global counterterrorism military campaign initiated by the United States following the September 11 attacks and is also the most recent global conflict spanning multiple wars. The main targets of the campaign were militant Islamist and Salafi jihadist armed organisations such as Al-Qaeda, the Islamic State, and their international affiliates, which were waging military insurgencies to overthrow governments of various Muslim-majority countries. Other major targets included the Ba'athist regime in Iraq, which was toppled during an invasion in 2003, and various militant factions that fought during the ensuing Iraqi insurgency. The \"war on terror\" was officially declared over in May 2010 and again in May 2013. Other American military campaigns during the 2010s have also been"
    },
    {
        "text": "Chang'e 5-T1 (Chinese: 嫦娥五号T1; pinyin: Cháng'é wǔhào T1) was an experimental robotic spacecraft that was launched to the Moon on 23 October 2014, by the China National Space Administration (CNSA) to conduct"
    },
    {
        "text": "The World Cultural Council performed its 31st Award Ceremony on November 17, 2014 at the Dipoli Hall, Otakaari 1 Building, Aalto University, Espoo, Finland. Aalto University acted as the host and co-organizer of the event, which was the opening act prior to the Aalto University Academic Summit titled \"The Impact of Universities on Economic Growth.\"The WCC presented awards to two distinguished scientists. Acclaimed enzymologist"
    },
    {
        "text": "S.A.S. v. France was a case brought for the European Court of Human Rights which ruled that the French ban on face covering did not violate European Convention on Human Rights's (ECHR)"
    },
    {
        "text": "On 24 November 2013, the Joint Plan of Action (برنامه اقدام مشترک), also known as the Geneva interim agreement (Persian: توافق هسته‌ای ژنو), was a pact signed between Iran and the P5+1"
    },
    {
        "text": "An earthquake occurred in the northern Aegean Sea between Greece and Turkey on May 24, 2014. It had a moment magnitude of 6.9 and a maximum Mercalli intensity of VIII (Severe). Serious damage was reported on the Turkish island of Imbros and the cities of Edirne and Çanakkale, as well as on the Greek island of Lemnos. The earthquake was felt in Bulgaria and"
    },
    {
        "text": "A constitutional referendum was held in Egypt on 14 and 15 January 2014 and with Egyptians abroad voting between 8 and 12 January. The new constitution was approved by 98.1% of voters."
    },
    {
        "text": "Simon Hall (1977 or 1978 – 23 February 2014) was a British murderer who was wrongly helped by 'miscarriage of justice' campaigners, only for him to go on to confess to the"
    },
    {
        "text": "On 5 May 2014, a yacht and a dinghy, both overcrowded and carrying migrants destined for Greece, capsized about four nautical miles off the coast of the Greek island of Samos, in the Aegean Sea. The vessels had been trying to enter Greece illegally at the time they overturned. The cause of the capsizing remains unclear, since weather conditions at the time and place"
    },
    {
        "text": "Belarus participated in the Eurovision Song Contest 2014 with the song \"Cheesecake\" written by Yuriy Vashchuk and Dmitry Novik. The song was performed by Teo, which is the artistic name of singer Yuriy Vashchuk. The Belarusian entry for the 2014 contest in Copenhagen, Denmark was selected through a national final organised by the Belarusian broadcaster National State Television and Radio Company of the Republic"
    },
    {
        "text": "The 2014 UEC European Track Championships was the fifth edition of the elite UEC European Track Championships in track cycling and took place at the Vélodrome Amédée Détraux in Baie-Mahault, Guadeloupe, France, between 16 and 19 October. The Event was organised by the European Cycling Union. All European champions are awarded the UEC European Champion jersey which may be worn by the champion throughout the year when competing in the same event at other competitions. The programme for the 2014 championships was considerably extended, and all World Championship track events were held; ten Olympic events, (sprint, team sprint, keirin, team pursuit and omnium, for both men and women), for which qualification points for the 2016 Summer Olympics were available for the first time, and nine non-Olympic events; the"
    },
    {
        "text": "Stichting Shell Pensioenfonds v Krys [2014] UKPC 41 (24 November 2014) was a decision of the Privy Council on appeal from the British Virgin Islands relating to an anti-suit injunction in connection"
    },
    {
        "text": "The 2013–2014 Israeli–Palestinian peace talks were part of the Israeli–Palestinian peace process. Direct negotiations between Israel and the Palestinians began on 29 July 2013 following an attempt by United States Secretary of State John Kerry to restart the peace process. Martin Indyk of the Brookings Institution in Washington, D.C. was appointed by the US to oversee the negotiations. Indyk served as U.S. ambassador to Israel and assistant secretary of state for Near East affairs during the Clinton administration. Hamas, the Palestinian government in Gaza, rejected Kerry's announcement, stating that Palestinian president Mahmoud Abbas has no legitimacy to negotiate in the name of the Palestinian people.The negotiations were scheduled to last up to nine months to reach a final status to the Palestinian-Israeli conflict by mid-2014. The Israeli negotiating"
    },
    {
        "text": "General elections were held in Botswana on 24 October 2014. The result was an eleventh straight victory for the Botswana Democratic Party, which won 37 of the 57 elected seats. Incumbent President"
    },
    {
        "text": "The 2014–15 Aruban Division di Honor season is the 54th season of top-tier football in Aruba. It began on 10 October 2014. Britannia are the reigning champions, coming off their fourth league"
    },
    {
        "text": "The First Cabinet of Kim Kielsen was a former administration of Greenland. It was appointed on 10 December 2014 with Kim Kielsen from Forward (Siumut) as Prime Minister, leading a coalition between"
    },
    {
        "text": "G 1/12 is a decision issued on 30 April 2014 by the Enlarged Board of Appeal of the European Patent Office (EPO), holding that an appellant's identity in a notice of appeal can be corrected under Rule 101(2) EPC, provided the requirements of Rule 101(1) EPC are met. The Enlarged Board of Appeal also held that an appellant's identity can be corrected under Rule"
    },
    {
        "text": "The Toronto Rock are a lacrosse team based in Toronto playing in the National Lacrosse League (NLL). The 2014 season was the 17th in franchise history, and 16th as the Rock. After an up-and-down start to the season, the Rock acquired goaltender Brandon Miller from the Philadelphia Wings at the trade deadline hoping to revitalize their shaky defense. On April 5, star forward Garrett Billings tore his ACL during a game against the Vancouver Stealth and was lost for the remainder of the season. Despite losing the league's scoring leader, the Rock won that game, which started a four-game winning streak to finish the regular season and clinch second place in the Eastern division ahead of the slumping Buffalo Bandits. But the Bandits ended their 8-game losing streak"
    },
    {
        "text": "The FATCA agreement is an international agreement signed between Canada and the United States that allows the implementation of the Foreign Account Tax Compliance Act (an Act of the U.S. Congress) in"
    },
    {
        "text": "General elections were held in Antigua and Barbuda on 12 June 2014. The result was a victory for the opposition Antigua and Barbuda Labour Party led by Gaston Browne, which won 14"
    },
    {
        "text": "Lars Joachim Mittank (born February 9, 1986) is a German man who disappeared on July 8, 2014, near Varna Airport in Varna, Bulgaria. Mittank was vacationing at the Golden Sands resort, where he was supposedly involved in a fight, and was subsequently unable to fly home with his friends for health reasons. Mittank was documented acting strangely while alone in Bulgaria. He called home to his mother claiming that people were trying to kill him. On the day when he was supposed to fly home, Mittank went to the Varna Airport to consult with a doctor. He was later seen on airport security footage running out of the airport and towards an adjacent forest. He has never been seen since. The case has generated intense interest, and the"
    },
    {
        "text": "The 27th European Film Awards were presented on 13 December 2014 in Riga, Latvia. The winners were selected by more than 2,500 members of the European Film Academy. Nominations for the People's"
    },
    {
        "text": "Virunga is a 2014 British documentary film directed by Orlando von Einsiedel. It focuses on the conservation work of park rangers within the Congo's Virunga National Park during the rise of the violent M23 Rebellion in 2012 and investigates the activity of the British oil company Soco International within the UNESCO World Heritage Site. Soco International ended up officially exploring oil opportunities in Virunga"
    },
    {
        "text": "2014–2016 Croatian war veterans tent protest was 555 days long war veterans protest, often dubbed in Croatia as The Tenters (Croatian: šatoraši). The protests were initially aimed against Ministry of Croatian Veterans deputy Bojan Glavašević and Minister Predrag Matić himself, however the protesters subsequently changed their demands and started demanding the resignation of left-wing Prime Minister Zoran Milanović and then President Ivo Josipović. The protests escalated in May 2015 when a group of protesters breached the riot police cordons in Zagreb Upper Town and barricaded themselves inside St. Mark Church, where they again clashed with the police. At the same time another group of protesters near the central tent blocked the traffic and brought out gas bottles on Savska street which they apparently threatened to blow if the"
    },
    {
        "text": "The 2014 Wales Summit of the North Atlantic Treaty Organization (NATO) was a meeting of the heads of state and heads of government of the NATO countries, held in Newport, Wales on 4 and 5 September 2014. Such summits are sporadically held and allow leaders and officials from NATO Allies to discuss current issues of mutual concern and to plan strategic activities. The 2014"
    },
    {
        "text": "Organizations from around the world responded to the West African Ebola virus epidemic. In July 2014, the World Health Organization (WHO) convened an emergency meeting with health ministers from eleven countries and announced collaboration on a strategy to co-ordinate technical support to combat the epidemic. In August, they declared the outbreak an international public health emergency and published a roadmap to guide and coordinate the international response to the outbreak, aiming to stop ongoing Ebola transmission worldwide within 6–9 months. In September, the United Nations Security Council declared the Ebola virus outbreak in the West Africa subregion a \"threat to international peace and security\" and unanimously adopted a resolution urging UN member states to provide more resources to fight the outbreak; the WHO stated that the cost for"
    },
    {
        "text": "Talking Statues is a project created initially in 2013 by David Peter Fox in Copenhagen, Denmark involving pre-recorded voiceovers accompanying various statues available in a smartphone app. The statue of Hans Christian Andersen in the King's Garden in Copenhagen was the first talking statue in the world. Later the idea was applied in Helsinki, New York, London, San Diego, Chicago, Vilnius, Parma, Dublin, Berlin, Manchester, and others. The project works with mobile technology and activated through a QR code found on the statue, when you scan it you will be called. You can also download our app, then you can find the Talking Statues in the world and have it talk to GPS so that they call you on your smartphone when you get close to the statue. The project started in Kings Garden in Copenhagen, where Fox accompanied his two children Alfred and Leah to kindergarten. On the way, they passed the many statues, including H. C. Andersen, who became the first Talking Statue in the world launched on 13th of September 2013. In connection with the launch, a leaflet designed by Mathilde Lunderskov was published with a map of the 10 Talking Statues. The monologues were written by film director Carsten Rudolf in collaboration with David Peter Fox and the performance was made by actor Jens Jacob Tychsen. The first project was overseen from the start by Jens Peter Munk from the Municipality, who has written several books about these statues in Copenhagen. The project in 2013 was supported by the City of Copenhagen"
    },
    {
        "text": "The following addresses the events in Northern Afghanistan between April 2009 and 2014. While this part of the country had long been relatively peaceful compared to the all-out war zones of the south and east, tensions would flare up again in 2008 when the German soldiers deployed to the area came under attack more often, leading to the deaths of the several soldiers. Previously hindered by national caveats, the deteroriating security situation prompted the German-led Regional Command North to launch a series of operations to take on the rising insurgency. Concerted operations began after an insurgent attack on PRT Kunduz within minutes of German Chancellor Angela Merkel's departure from a visit. Within two years, the German presence would be doubled and additional reinforcements from the American ISAF contingent"
    },
    {
        "text": "R v Incedal and Rarmoul-Bouhadjar (2014), formerly known as R v AB and CD, is a criminal case brought in the United Kingdom against two people suspected of terrorism offences. It was"
    },
    {
        "text": "Cayman has introduced a new regime for the licensing and registration of directors of investment fund companies that are “regulated” under the Mutual Funds Law (2013 Revision) and directors of companies registered as “excluded persons” under paragraphs 1 and 4 of Schedule 4 of the Securities Investment and Business Law (2011 Revision). Each relevant entity is defined in the Law as a “Covered Entity”."
    },
    {
        "text": "The Argentine debt restructuring is a process of debt restructuring by Argentina that began on January 14, 2005, and allowed it to resume payment on 76% of the US$82 billion in sovereign bonds that defaulted in 2001 at the depth of the worst economic crisis in the nation's history. A second debt restructuring in 2010 brought the percentage of bonds under some form of repayment to 93%, though ongoing disputes with holdouts remained. Bondholders who participated in the restructuring settled for repayments of around 30% of face value and deferred payment terms, and began to be paid punctually; the value of their nearly worthless bonds also began to rise. The remaining 7% of bondholders were later repaid 25% less then they were demanding, after centre-right and US-aligned leader"
    },
    {
        "text": "Before the Dawn was a concert residency by the English singer-songwriter Kate Bush in 2014 at the Hammersmith Apollo in London. The residency consisted of 22 dates; it was Bush's first series"
    },
    {
        "text": "The 2014 protests in Brazil, also known as There won't be a Cup or Fifa go home were public demonstrations in several Brazilian cities in response to the 2014 FIFA World Cup and other social issues, realized by many social movements, mostly in the capitals where the megaevent was happening, Their main criticism was the high government spending on the World Cup to the"
    },
    {
        "text": "Presidential elections were held in Egypt between 26 and 28 May 2014. There were only two candidates, former Egyptian defence minister Abdel Fattah el-Sisi and Egyptian Popular Current candidate Hamdeen Sabahi. El-Sisi"
    },
    {
        "text": "The Yarkand Massacre was an episode of violence that began on 28 July 2014 in Yarkant County, Kashgar Region of the Xinjiang Uyghur Autonomous Region, China, and lasted for several days, as"
    },
    {
        "text": "On 28 April 2014, 61-year-old teacher Ann Maguire (5 April 1953 – 28 April 2014) was stabbed to death while teaching a Spanish lesson at Corpus Christi Catholic College in Halton Moor, Leeds, England. The perpetrator, William \"Will\" Cornick, who was 15 years old when he committed the murder, was sentenced to life with a minimum of 20 years at Leeds Crown Court on"
    },
    {
        "text": "The Willis Resilience Expedition was a scientific and exploratory program that took place in Antarctica from November 2013 to January 2014, with the goal of a better understanding of changes in the"
    },
    {
        "text": "The 2014 Gaza Valley airstrike was a friendly fire incident that took place in Zabul Province, Afghanistan on 9 June 2014 when five U.S. troops and one Afghan interpreter were killed when"
    },
    {
        "text": "Miss Belgium 2014 was the 46th edition of the Miss Belgium held on January 11, 2014 at the Plopsaland Theater in De Panne, Belgium. The winner, Laurence Langen from Limburg, was crowned by the outgoing title holder, Noémie Happart (Miss Belgium 2013). Langen would represent Belgium in the competitions of Miss Universe 2014 and Miss World 2014, but gave up due to health problems,"
    },
    {
        "text": "The FATCA agreement is an international agreement signed between Canada and the United States that allows the implementation of the Foreign Account Tax Compliance Act (an Act of the U.S. Congress) in Canada. It is one of 30 intergovernmental agreements the US has concluded with other countries to implement the FATCA.FATCA requires United States persons, including individuals who live outside the United States, and financial institutions outside the United States, to report the principal amount held in their financial accounts outside of the United States to the Internal Revenue Service (IRS). According to the Canadian Broadcasting Corporation (CBC) there are about one million American citizens living in Canada. This treaty also affects their spouses, children, or anyone with whom they own property, share a business connection, or hold"
    },
    {
        "text": "Presidential elections were held in Egypt between 26 and 28 May 2014. There were only two candidates, former Egyptian defence minister Abdel Fattah el-Sisi and Egyptian Popular Current candidate Hamdeen Sabahi. El-Sisi won the election in a landslide victory, having received 97% of votes. Before announcing his candidacy in the election, el-Sisi, who as Defence Minister also served as Commander-in-Chief of the Egyptian Armed Forces, was responsible for officially announcing the removal of president Mohamed Morsi from office in the aftermath of the June 2013 Egyptian protests. After Morsi's removal, Sisi installed a temporary interim government, but remained Egypt's Minister of Defence and assumed the role of the country's First Deputy Prime Minister. On 26 March 2014, he officially retired from the military, and announced that he would run as a candidate in the 2014 presidential election. The election, held between 26 and 28 May and which included only one opponent, was boycotted by some political parties, as well as many Islamists, including the Muslim Brotherhood's Freedom & Justice Party, the Brotherhood itself having been previously declared a terrorist organization in December 2013.The elections, which were planned to take place for two days, were extended to a third day. Official figures showed that 25,578,233 people voted in the elections, and the election had a turnout of 47.5% (lower than the 2012 election's 52%), with el-Sisi winning with 23.78 million votes, 96.91%, ten million more votes than former president Mohamed Morsi (who garnered 13 million votes against his opponent in the close runoff of the 2012 election)."
    },
    {
        "text": "Organizations from around the world responded to the West African Ebola virus epidemic. In July 2014, the World Health Organization (WHO) convened an emergency meeting with health ministers from eleven countries and"
    },
    {
        "text": "Cayman has introduced a new regime for the licensing and registration of directors of investment fund companies that are “regulated” under the Mutual Funds Law (2013 Revision) and directors of companies registered"
    },
    {
        "text": "The 2014 Kremlin Cup was a tennis tournament played on indoor hard courts. It was the 25th edition of the Kremlin Cup for the men (19th edition for the women) and part"
    },
    {
        "text": "Spy Booth was an artwork by Banksy in Cheltenham, England. The piece has been seen as a critique of the global surveillance disclosures of 2013.In 2014, Robin Barton and Bankrobber London helped"
    },
    {
        "text": "Fantastica Mania 2014 was a series of five professional wrestling events co-produced by Japanese promotion New Japan Pro-Wrestling (NJPW) and Mexican promotion Consejo Mundial de Lucha Libre (CMLL) taking place between January 15 and 19, 2014. 2014 was the fourth year in which NJPW and CMLL come together to produce Fantastica Mania events, but the first time they held five events in one year, compared to two events in 2011 and 2012 and three in 2013. 2014 also marked the first time Fantasticamania events were held outside of Tokyo's Korakuen Hall, with the January 14 taking place in Osaka, Osaka at the Bodymaker Colosseum, the January 15 event in Kyoto, Kyoto at the KBS Hall and the January 17 event in Tokyo's Shin-Kiba 1st Ring, while the January"
    },
    {
        "text": "The 2013–14 season was Galatasaray's 110th in existence and 56th consecutive season in the Süper Lig. The club was aiming for an unprecedented twentieth league title, after winning the Süper Lig in the previous season. In Europe, Galatasaray competed in the UEFA Champions League for a thirteenth season. They also competed in the Turkish Cup, entering in the fourth round, as well as the"
    },
    {
        "text": "Operation Full Disclosure (Hebrew: מבצע חשיפה מלאה) was a military operation carried out by the Israel Defense Forces on March 5, 2014, in the Red Sea. After days of surveillance far out to sea, Israeli Navy Shayetet 13 commandos seized the Iranian-owned and Panamanian-registered merchant vessel Klos C that had set sail from Iran, heading for Port Sudan via Iraq. On board, the commandos"
    },
    {
        "text": "The Hai Yang Shi You 981 standoff, also known as the 2014 China-Vietnam oil rig crisis, refers to the tensions between China and Vietnam arising from the Chinese state-owned China National Offshore"
    },
    {
        "text": "General elections were held in Dominica on 8 December 2014 to elect the 21 members of the House of Assembly. Prime Minister Roosevelt Skerrit announced the election date on 5 November 2014"
    },
    {
        "text": "The analysis of communications between Malaysia Airlines Flight 370 and Inmarsat's satellite telecommunication network provide the primary source of information about Flight 370's location and possible in-flight events after it disappeared from military radar coverage at 2:22 Malaysia Standard Time (MYT) on 8 March 2014 (17:22 UTC, 7 March), one hour after communication with air traffic control ended and the aircraft departed from its planned flight path while over the South China Sea. Flight 370 was a scheduled commercial flight with 227 passengers and 12 crew which departed Kuala Lumpur, Malaysia at 0:41 and was scheduled to land in Beijing, China at 6:30 China Standard Time (6:30 MYT; 22:30 UTC, 7 March). Malaysia has worked in conjunction with the Australian Transport Safety Bureau to co-ordinate the analysis, which"
    },
    {
        "text": "The Vienna Summer of Logic was a scientific event in the summer of 2014, combining 12 major conferences and several workshops from the fields of mathematical logic, logic in computer science, and logic in artificial intelligence. The meetings took place from July 9 to 24, 2014, and attracted more than 2000 scientists and researchers.The event was organized by the Kurt Gödel Society at Vienna University of Technology. Participating meetings include:In the Logic in Computer Science stream (representing the Federated Logic Conference (FLoC)): International Conference on Computer Aided Verification (CAV) IEEE Computer Security Foundations Symposium (CSF) International Conference on Logic Programming (ICLP) International Joint Conference on Automated Reasoning (IJCAR) Conference on Interactive Theorem Proving (ITP) Joint meeting of the EACSL Annual Conference on Computer Science Logic (CSL) and the"
    },
    {
        "text": "Double salary saga is the name given by media outlets to a political scandal in Ghana. Between 2012 and 2016, some members of the John Dramani Mahama administration who were ministers or deputy ministers and doubled as members of parliament were alleged to have received double salaries during their term in office. The law however requires such officials to choose to receive salary either"
    },
    {
        "text": "The GSK China scandal was an imbroglio where the China branch of the global drugmaker GlaxoSmithKline (GSK) pleaded guilty to paying bribes to doctors and hospitals to promote the company's products in China. The scandal started with sex tapes of the company's China head, Mark Reilly and his Chinese girlfriend at a Shanghai department, which were sent to several senior executives of the company."
    },
    {
        "text": "The 2014 Prix de l'Arc de Triomphe was a horse race held at Longchamp on Sunday, 5 October 2014. It was the 93rd running of the Prix de l'Arc de Triomphe. The"
    },
    {
        "text": "Blockupy is a movement protesting against austerity. The Blockupy alliance includes trade unions and Germany's Linkspartei.Representing grass-roots critics of supranational financial institutions such as the “troika”: the European Commission (EC), European Central Bank (ECB) and International Monetary Fund (IMF), its name is derived from the Occupy movement which sprang up in Wall Street in 2011.Organisers have verbally supported (since July 2015, former) Greek finance"
    },
    {
        "text": "The Ettehadiya case is a controversial legal case in Egypt where thousands of protesters went down to the Ittihadiya Palace, the Presidential offices in Cairo, asking for the repeal of the newly issued protest law as part of the international day for the solidarity with the Egyptian detainees on 21 June 2014. The march headed for the Heliopolis presidential Palace was demanding the repeal"
    },
    {
        "text": "Karen Petrosyan v. Azerbaijan was an international human rights case regarding the rights of Artush Petrosyan and his son Karen Petrosyan – an Armenian national from Chinari village, Tavush province of Armenia, who died while in captivity in Azerbaijan in 2014. The judgment of the European Court of Human Rights on the case originated in an application (no. 32427/16) against the Republic of Azerbaijan lodged with the Court under the Convention for the Protection of Human Rights and Fundamental Freedoms by the applicant, Artush Petrosyan, on 25 April 2016. He Submitted that his son had been publicly humiliated, tortured and killed by decapitation by Azerbaijani State agents and that \"his son’s body had not been repatriated in a timely manner, that there had been no effective investigation on"
    },
    {
        "text": "The 2014 UK Music Video Awards were held on 10 November 2014 at the Queen Elizabeth Hall in Southbank Centre, London and was hosted by Adam Buxton to recognise the best in"
    },
    {
        "text": "Belarus participated in the Eurovision Song Contest 2014 with the song \"Cheesecake\" written by Yuriy Vashchuk and Dmitry Novik. The song was performed by Teo, which is the artistic name of singer"
    },
    {
        "text": "The 2014 Sundarbans oil spill was an oil spill that occurred on 9 December 2014 at the Shela River in Sundarbans, Bangladesh, a UNESCO World Heritage Site. The spill occurred when an"
    },
    {
        "text": "The eighteenth summit of 'South Asian Association of Regional Cooperation' (SAARC) was held in Kathmandu, the capital of Federal Democratic Republic of Nepal during 26–27 November 2014. The theme of the summit was Deeper Integration for Peace and Prosperity, focused on enhancing connectivity between the member states for easier transit-transport across the region. Sushil Koirala, the then Nepalese prime minister, was the main host"
    },
    {
        "text": "Between the months of March and April 2014, a court in Minya, Egypt, has recommended the death sentence to hundreds of members and supporters of the banned Muslim Brotherhood over an attack on a police station in December 2013. The defendants included Mohamed Badie, the group's top leader, whose sentence was confirmed on June 21, 2014, along with 181 of the brotherhood's supporters. This"
    },
    {
        "text": "2013–2014 Satkhira clashes refers to the crackdown on killed in a joint operations by Border Guards Bangladesh, Rapid Action Battalion and Bangladesh police in different places of Satkhira district, Bangladesh during the 2013 Bangladesh unrest. They began on December 16, 2013 and continued after the 2014 Bangladesh election. There are allegations that various formations of the Indian military participated in the crackdown, an allegation"
    },
    {
        "text": "Presidential elections were held in Colombia on 25 May 2014. Since no candidate received 50% of the vote in the first round, a run-off between the two candidates with the most votes took place three weeks later on 15 June 2014. According to the official figures released by the National Registry office (Registraduría Nacional), as of 22 May 2014 (the cut-off date to register)"
    },
    {
        "text": "The 2014 Gaza War, also known as Operation Protective Edge (Hebrew: מִבְצָע צוּק אֵיתָן, romanized: Miv'tza Tzuk Eitan, lit. 'Operation Strong Cliff'), was a military operation launched by Israel on 8 July"
    },
    {
        "text": "On August 12, 2014 a magnitude 5.1 earthquake struck Ecuador 22 km (14 mi) west-southwest of Cayambe at a depth of 11.9 km (7.4 mi). The earthquake shook Ecuador's capital Quito 32 km (20 mi), causing large dust clouds and prompting the temporary shutdown of Quito's Mariscal Sucre International Airport. The earthquake killed at least 4 people including two men who were buried by"
    },
    {
        "text": "The Bristol child sex abuse ring was a group of 13 men who committed sexual offences against underage teenage girls in Bristol, in Southwestern England. In November 2014, they were convicted of"
    },
    {
        "text": "The blockade of the Gaza Strip is the ongoing land, air, and sea blockade of the Gaza Strip imposed by Israel and Egypt temporarily in 2005–2006 and permanently from 2007 onwards, following the Israeli disengagement from Gaza.The blockade was made permanent after Hamas took control of the Gaza Strip during the Battle of Gaza, seizing government institutions and replacing Fatah and other Palestinian Authority"
    },
    {
        "text": "Operation Car Wash (Portuguese: Operação Lava Jato) was a criminal investigation by the Federal Police of Brazil's Curitiba branch. It began in March 2014 and was initially headed by investigative judge Sérgio Moro, and in 2019 by Judge Luiz Antônio Bonat. It has resulted in more than a thousand warrants of various types. According to the Operation Car Wash task force, investigations implicate administrative members of the state-owned oil company Petrobras, politicians from Brazil's largest parties (including presidents of the Republic), presidents of the Chamber of Deputies and the Federal Senate, state governors, and businessmen from large Brazilian companies. The Federal Police consider it the largest corruption investigation in the country's history. The taskforce was officially disbanded on 1 February 2021.Originally a money laundering investigation, it expanded to"
    },
    {
        "text": "Azerbaijan participated in the Turkvision Song Contest 2014 which took place in Kazan, Tatarstan, Russia. Azad Azerbaijan TV (ATV) was responsible for organising their entry for the contest. Elvin Ordubadli won the"
    },
    {
        "text": "The third competition weekend of the 2014–15 ISU Speed Skating World Cup will be held in Sportforum Hohenschönhausen in Berlin, Germany, from Friday, 5 December, until Sunday, 7 December 2014.Artur Waś of Poland both men's 500 m races. In the women's competitions, Ireen Wüst of the Netherlands won three gold medals; in the 1500 m and 3000 m races, as well as in the"
    },
    {
        "text": "A long series of criminal investigations have occurred in Brazil associated with Operation Car Wash. The first investigation was launched in March 2014, and is now known as phase 1 of the investigation, with subsequent inquiries numbered sequentially and having code names such as phase 2 (Operation Bidone), phase 3 (Operation Casablanca), and so on. By February 2021, there were 80 announced phases of"
    },
    {
        "text": "The 2015 World Junior Ice Hockey Championships was the 39th edition of Ice Hockey World Junior Championship, played from December 26, 2014 to January 5, 2015. It was co-hosted by Toronto, Ontario,"
    },
    {
        "text": "The 2014 Balkan Athletics Indoor Championships was the 19th edition of the annual indoor track and field competition for athletes from the Balkans, organised by Balkan Athletics. It was held on 22 February at the Ataköy Athletics Arena in Istanbul, Turkey. Ivana Španović broke the Serbian indoor record to win the women's long jump with a mark of 6.92 m (22 ft 8+1⁄4 in)."
    },
    {
        "text": "The Brazilian Anti-Corruption Act (Brazilian Portuguese: Lei anticorrupção) officially \"Law No. 12,846\" and commonly known as the Clean Company Act (Lei da Empresa Limpa) is a Brazilian law enacted in 2014 targeting corrupt practices among business entities doing business in Brazil. It defines civil and administrative penalties, as well as the possibility of reductions in penalties for cooperation with law enforcement under a written"
    },
    {
        "text": "The 6th BRICS summit was the sixth annual diplomatic meeting of the BRICS, a grouping of major emerging economies that includes Brazil, Russia, India, China and South Africa. It was hosted by Brazil, as the first host country of the current five-year summit cycle; the host city was Fortaleza. Though Brazil had previously hosted a four-member BRIC summit in April 2010, 2014 marked its first full BRICS summit; the 2010 summit in Brasília did not officially include South Africa, who were only invited as guests as a prelude to their gaining full membership in December 2010. Argentine President Cristina Kirchner was a special guest of the summit, and the BRICS leaders met with their UNASUR counterparts shortly after. The 6th BRICS summit resulted in the official inauguration of"
    },
    {
        "text": "The 2014 Berlin Marathon was the 41st edition of the Berlin Marathon. The marathon took place in Berlin, Germany, on 28 September 2014 and was the fourth World Marathon Majors race of"
    },
    {
        "text": "In the afternoon of January 21, 2014, the Chinese internet suffered a major failure. The country's DNS infrastructure, which is responsible for translating domain names into IP addresses, started directing unrelated domains from various TLDs to the completely unresponsive IP address 65.49.2.178 at 15:10 (UTC+8). As a result, two-thirds of all domestic websites became non-functional, including such high-traffic sites as Baidu and Sina.It is"
    },
    {
        "text": "The World Scrabble Championship 2014, renamed by Mattel to Scrabble Champions Tournament in 2013, was held at the ExCeL London Exhibition and Convention Centre, London in November 2014. It was the first time that the World Championship had become an open event when MSI invited all players to compete. However, due to the high entry fee and high venue cost, only 108 players entered"
    },
    {
        "text": "The World Cultural Council performed its 31st Award Ceremony on November 17, 2014 at the Dipoli Hall, Otakaari 1 Building, Aalto University, Espoo, Finland. Aalto University acted as the host and co-organizer"
    },
    {
        "text": "Gutter oil, trench oil, sewer oil and tainted oil (Chinese: 地沟油 / 地溝油; pinyin: dìgōu yóu, or 餿水油; sōushuǐ yóu) are Chinese slang terms primarily used in China and Taiwan to refer to recycled oil. It can be used to describe the illicit practice of restaurants reusing cooking oil that has already been cooked with longer than safety codes permit. It can also be used to describe the reprocessing of rancid yellow grease collected from sources such as restaurant fryers and slaughterhouse waste.The usage of gutter oil is highly frowned upon and often leads to prosecution. For example, selling gutter oil in China can result in lengthy prison sentences or the death sentence with reprieve. For example, in 2014, businessman Zhu Chuanfeng was sentenced to the latter for"
    },
    {
        "text": "On 20 October 2014, Unijet Flight 074P, a Dassault Falcon 50 business jet taking off from Vnukovo International Airport in Moscow, Russia, crashed into a snow plow that had strayed onto the runway, killing all four people on board. Among the victims was Total's Chairman and CEO Christophe de Margerie, who was returning to Paris, France.The driver of the snow removal vehicle, who was"
    },
    {
        "text": "The case of Ashya King concerns a boy named Ashya King, who had a brain tumour. His parents, Brett and Naghemeh King, took their son out of Southampton General Hospital (England) in August 2014 over a disagreement with doctors regarding his treatment.Ashya had a medulloblastoma, which was successfully removed through surgery on 24 July 2014. He received further neurosurgery on 22 August.His parents desired their son be treated with proton therapy, which they felt was less harmful than conventional radiotherapy. At that time, the National Health Service (NHS) did not provide proton therapy in the United Kingdom. However, it has funded treatment abroad since April 2008 where evidence has shown there to be benefit. In this case, the doctors did not support moving the boy so that he could get proton therapy and, in response, on 28 August 2014, the parents took their son out of the hospital without informing the medical team and boarded a ferry to France.The same day, an international manhunt for Ashya and his parents commenced. and, on 30 August, they were found in Velez Malaga, Spain. The parents were arrested and their son was sent to a local hospital for urgent treatment.On 2 September 2014, following public outcry against the arrest, then UK prime minister David Cameron called for “an urgent outbreak of common sense” while his deputy said it was not appropriate to “throw the full force of the law” at the couple.On 3 September 2014, Ashya King's parents were freed from the Spanish prison when the request to extradite"
    },
    {
        "text": "The 2014 Prix de l'Arc de Triomphe was a horse race held at Longchamp on Sunday, 5 October 2014. It was the 93rd running of the Prix de l'Arc de Triomphe. The winner was Al Shaqab Racing's Treve, a four-year-old filly trained in France by Criquette Head-Maarek and ridden by Thierry Jarnet, repeating her victory in 2013. She became the first horse since Alleged"
    },
    {
        "text": "Presidential elections were held in Afghanistan on 5 April 2014, with a second round held on 14 June. Incumbent President Hamid Karzai was not eligible to run due to term limits. The registration period for presidential nominations was open from 16 September 2013 until 6 October 2013. A total of 27 candidates were confirmed to be running for office. However, on 22 October Afghanistan's"
    },
    {
        "text": "The Eurovision Song Contest 2014 was the 59th edition of the Eurovision Song Contest. It took place in Copenhagen, Denmark, following the country's victory at the 2013 contest with the song \"Only"
    },
    {
        "text": "Miss Brazil World 2014 was the 25th edition of the Miss Brazil World pageant and the 9th under MMB Productions & Events. The contest took place on August 9, 2014. Each state,"
    },
    {
        "text": "The 2014 National People's Congress (formally, the Second Session of the 12th National People's Congress) held its annual meeting in March 2014 at the Great Hall of the People in Beijing, China."
    },
    {
        "text": "The Pocklington Iron Age burial ground is a prehistoric cemetery discovered in 2014 on the outskirts of Pocklington in the East Riding of Yorkshire, England. Excavations carried out on an ongoing basis since then, have uncovered more than 160 skeletons and more than 70 square barrows thought to date to the Middle Iron Age that are attributed to the Arras culture, an ancient British"
    },
    {
        "text": "Patagotitan is a genus of titanosaurian sauropod dinosaur from the Cerro Barcino Formation in Chubut Province, Patagonia, Argentina. The genus contains a single species known from at least six young adult individuals, Patagotitan mayorum, which was first announced in 2014 and then validly named in 2017 by José Carballido and colleagues. Preliminary studies and press releases suggested that Patagotitan was the largest known titanosaur and land animal overall, with an estimated length of 37 m (121 ft) and an estimated weight of 69 tonnes (76 short tons). Later research revised the length estimate down to 31 m (102 ft) and weight estimates down to approximately 50–57 tonnes (55–63 short tons), suggesting that Patagotitan was of a similar size to, if not smaller than, its closest relatives Argentinosaurus and Puertasaurus. Still, Patagotitan is one of the most completely-known titanosaurs, and so its interrelationships with other titanosaurs have been relatively consistent in phylogenetic analyses. This led to its use in a re-definition of the group Colossosauria by Carballido and colleagues in 2022. Like Argentinosaurus and other members of the Lognkosauria, Patagotitan was a particularly large and robust titanosaur. It can be distinguished from its close relatives by a suite of unique characteristics in its back and tail vertebrae, scapulae and humeri in the forelimb, and ischia and femora in the hindlimb. Among these was the presence of accessory vertebral articulations known as the hyposphene-hypantrum articulations between only one pair of vertebrae at the level of the scapular blade, which was likely a weight-bearing adaptation not seen in any"
    },
    {
        "text": "Breck David Lafave Bednar (17 March 1999 – 17 February 2014) was an English teenager of American descent from Caterham, Surrey, who was murdered by 18-year-old Lewis Daynes on 17 February 2014, at Daynes' flat in Grays, Essex. Bednar knew Daynes only through online gaming, and had never met him in person until he visited Daynes' flat on the day of the murder. Daynes"
    },
    {
        "text": "Art Buff is a graffiti artwork by Banksy which was created in Folkestone in 2014, Banksy announcing it as \"part of the Folkestone triennial. Kind of\". The work depicts a woman wearing headphones and staring at a plinth, upon which rests a patch of painted-out graffiti. The name of the piece is a play on words, \"buff\" being a slang term for the painting over of graffiti.Reported on 13 October 2014, Art Buff was vandalized with the spray painting of a penis sitting on top of the plinth.During early November 2014 Robin Barton and Bankrobber London organized the removal of Art Buff from its Folkestone location following requests from the owners of the wall, and announced plans to put it up for sale in aid of a cancer"
    },
    {
        "text": "The 72nd World Science Fiction Convention (Worldcon), also known as Loncon 3, was held on 14–18 August 2014 at the ExCeL London in London, United Kingdom.The convention committee was co-chaired by Alice"
    },
    {
        "text": "Operation Full Disclosure (Hebrew: מבצע חשיפה מלאה) was a military operation carried out by the Israel Defense Forces on March 5, 2014, in the Red Sea. After days of surveillance far out to sea, Israeli Navy Shayetet 13 commandos seized the Iranian-owned and Panamanian-registered merchant vessel Klos C that had set sail from Iran, heading for Port Sudan via Iraq. On board, the commandos found long-range missiles suspected to be destined for the Gaza Strip concealed in containers full of Iranian bags marked as Portland cement. An unnamed senior Egyptian security official reportedly confirmed that the arms shipment was headed for militants in either Gaza or Sinai. A UN panel of experts concluded that the weapons came from Iran and were being sent to Sudan, accusing Iran of"
    },
    {
        "text": "Typhoon Hagupit (hə-goo-PEET, [hɐguˈpit]; Filipino word meaning \"lashing or flogging\"), known in the Philippines as Typhoon Ruby, was the second most intense tropical cyclone in 2014. Hagupit particularly impacted the Philippines in"
    },
    {
        "text": "The 67th British Academy Film Awards, more commonly known as the BAFTAs, were held on 16 February 2014 at the Royal Opera House in London, honouring the best national and foreign films of 2013. The nominations were announced on 8 January 2014 by actor Luke Evans and actress Helen McCrory. Presented by the British Academy of Film and Television Arts, accolades were handed out for the best feature-length film and documentaries of any nationality that were screened at British cinemas in 2013.Gravity won six of its eleven nominations, including Best Director for Alfonso Cuarón, Outstanding British Film, Best Cinematography, Best Original Music, Best Sound, and Best Special Visual Effects. 12 Years a Slave won Best Film and Best Actor in a Leading Role for Chiwetel Ejiofor. Cate Blanchett"
    },
    {
        "text": "General elections were held in the Republika Srpska entity of Bosnia and Herzegovina on 12 October 2014 as part of the Bosnian general elections. Incumbent President Milorad Dodik was re-elected, running on"
    },
    {
        "text": "Around midday on October 22, 2014, a passing motorist saw an Asian woman walking north along the Ingraham Trail on the outskirts of Yellowknife in the Northwest Territories, Canada. Several days later, after seeing stories in the local media that 45-year old Atsumi Yoshikubo (吉窪昌美) who had been visiting the city from her home in southern Japan, had gone missing, she reported the sighting. It was the last time she was seen alive. Yoshikubo's absence was first noted five days after that sighting, when staff at her hotel noticed she had not checked out two days after her stay was due to have ended. In her room they found her luggage, still packed; she had apparently never boarded her flight home. Footage from the hotel's security camera showed"
    },
    {
        "text": "On June 19, 2014, torrential rains caused severe flash flooding across northeastern Bulgaria leaving dozens of villages without electricity and submerging large parts of several cities in the region. At least 16"
    },
    {
        "text": "The 2014 SCO summit was the 13th annual summit of heads of state of the Shanghai Cooperation Organisation held between 11 and 12 September in Dushanbe, Tajikistan. Security was among the top issues for 13th annual summit and all members during the last meeting reached a consensus on fighting against separatism, extremism and terrorism, as well as on safeguarding regional peace and security therefore"
    },
    {
        "text": "In October 2013, there was an outbreak of Zika fever in French Polynesia, the first outbreak of several Zika outbreaks across Oceania. With 8,723 cases reported, it was the largest outbreak of"
    },
    {
        "text": "The World Cultural Council performed its 31st Award Ceremony on November 17, 2014 at the Dipoli Hall, Otakaari 1 Building, Aalto University, Espoo, Finland. Aalto University acted as the host and co-organizer of the event, which was the opening act prior to the Aalto University Academic Summit titled \"The Impact of Universities on Economic Growth.\"The WCC presented awards to two distinguished scientists. Acclaimed enzymologist Professor Sir Philip Cohen received the Albert Einstein World Award of Science for his forty-year research into cellular communication. Professor Federico Rosei accepted the José Vasconcelos World Award of Education, granted for his excellence in the field of university teaching. Jussi Nuorteva, Director of the National Archives of Finland and member of the WCC, presented the Winners' Book to the laureates. Professor Sir Philip"
    },
    {
        "text": "The 2014 UEC European Track Championships was the fifth edition of the elite UEC European Track Championships in track cycling and took place at the Vélodrome Amédée Détraux in Baie-Mahault, Guadeloupe, France, between 16 and 19 October. The Event was organised by the European Cycling Union. All European champions are awarded the UEC European Champion jersey which may be worn by the champion throughout"
    },
    {
        "text": "The Cemfjord was a Cyprus-registered cargo ship which foundered in the Pentland Firth off the north-east coast of Scotland on 2 January 2015. Built as the general cargo ship Margareta in 1984,"
    },
    {
        "text": "Around midday on October 22, 2014, a passing motorist saw an Asian woman walking north along the Ingraham Trail on the outskirts of Yellowknife in the Northwest Territories, Canada. Several days later, after seeing stories in the local media that 45-year old Atsumi Yoshikubo (吉窪昌美) who had been visiting the city from her home in southern Japan, had gone missing, she reported the sighting."
    },
    {
        "text": "The 2014 United Nations Security Council election was held on 16 October 2014 during the 69th session of the United Nations General Assembly, held at United Nations Headquarters in New York City. The elections were for five non-permanent seats on the UN Security Council for two-year mandates commencing on 1 January 2015. In accordance with the Security Council's rotation rules, whereby the ten non-permanent UNSC seats rotate among the various regional blocs into which UN member states traditionally divide themselves for voting and representation purposes, the five available seats were allocated as follows: One for Africa One for the Asia-Pacific Group One for Latin America and the Caribbean Two for the Western European and Others GroupThe five members will serve on the Security Council for the 2015–16 period."
    },
    {
        "text": "Georgia joined the war in Afghanistan in 2004 and the country had become the largest non-NATO and the largest per capita troop contributor to the International Security Assistance Force in Afghanistan by"
    },
    {
        "text": "The 2014 American immigration crisis was a surge in unaccompanied children and women from the Northern Triangle of Central America (NTCA) seeking entrance to the United States in 2014. According to U.S."
    },
    {
        "text": "G 1/13 is a decision issued on 25 November 2014 by the Enlarged Board of Appeal of the European Patent Office (EPO), holding that in opposition proceedings a retroactive effect of a"
    },
    {
        "text": "A by-election was held in the Cook Islands constituency of Mitiaro on 11 November 2014.In the July 2014 general election, the contest for the Mitiaro seat resulted in a tie. Incumbent MP"
    },
    {
        "text": "The Schellenberg smuggling incident is a case in which Canadian citizen Robert Lloyd Schellenberg was arrested, tried, and convicted on charges of smuggling drugs in the People's Republic of China. According to the prosecutors for the state, Schellenberg attempted to smuggle methamphetamine with a net weight of just over 222 kg (489 lb) from Dalian to Australia in November 2014, and after discovering that his translator had informed the police, he boarded a plane at Dalian Zhoushuizi International Airport with the intention of fleeing to Thailand. Schellenberg was arrested by Chinese police when the plane had a stopover at Guangzhou Baiyun International Airport. Schellenberg argued that he was framed by drug dealer Xu Qing and that he was an innocent tourist. On November 20, 2018, the Dalian Intermediate People's Court tried and sentenced Schellenberg to 15 years in prison for drug smuggling, confiscation of 150,000 yuan in personal property, and deportation. Schellenberg appealed the verdict. On December 29 of the same year, the Liaoning Provincial High People's Court retried him. During the trial, the prosecutor claimed that the initial trial that Schellenberg was an accessory criminal, and the crime did not succeed, so the punishment should be light was inappropriate. The High Court of Liaoning Province ruled in court to send the case back to Dalian Intermediate People's Court for retrial. On January 14, 2019, the Dalian Intermediate People's Court opened a retrial to review the case, sentencing Schellenberg to death and confiscation of all property. After the retrial, Schellenberg's defense team stated that it would"
    },
    {
        "text": "Parliamentary elections were held in Colombia on 9 March 2014 to elect members to both chambers of Congress. The nationwide constituency for the 102-member Senate was contested, as well as the 166 seats of the House of Representatives, plus the delegates to the Andean Parliament. There were 773 candidates for the Senate, 1,528 candidates for the House of Representatives, and 23 candidates for the five Colombian seats in the Andean Parliament. 32,795,962 Colombians had been registered to vote in the elections by the cut-off date of 25 January 2014.The elections were notable for the decision by former president Álvaro Uribe to stand for the Senate, the first ex-president in modern Colombian history to run for Congress afterwards. Uribe is constitutionally barred from standing for president again, having already"
    },
    {
        "text": "The Miss Brazil 2014 was the 60th edition of the Miss Brazil pageant, held in Centro de Eventos do Ceará, Fortaleza, Ceará, Jakelyne Oliveira of Mato Grosso, crowned her successor Melissa Gurgel"
    },
    {
        "text": "R v Incedal and Rarmoul-Bouhadjar (2014), formerly known as R v AB and CD, is a criminal case brought in the United Kingdom against two people suspected of terrorism offences. It was proposed to make it the first criminal trial in British legal history to be held entirely in secret, but the Court of Appeal of England and Wales ruled in June 2014 that"
    },
    {
        "text": "International reactions to the annexation of Crimea by the Russian Federation have largely been condemnatory of Russia's actions, supportive of Ukraine's sovereignty and territorial integrity, and supportive of finding a quick end to the crisis. The United States and the European Union responded by enacting sanctions against Russia for its role in the crisis, and urged Russia to withdraw. Russia has accused the United"
    },
    {
        "text": "On 2 May 2014, a pair of mudslides occurred in Argo District, Badakhshan Province, Afghanistan. The death toll is uncertain, the number of deaths varying from 350 to 2,700. Around 300 houses"
    },
    {
        "text": "On 3 October 2014, Canadian Prime Minister Stephen Harper announced that he would put forth a motion to send forces to participate in the coalition for military intervention against ISIL by deploying combat aircraft. On 7 October 2014, the House of Commons approved of sending nine aircraft to join coalition airstrikes against ISIL in Iraq along with 69 special forces advisors to train the Iraqi government's military. The Canadian Armed Forces' contribution to the coalition against ISIL was later dubbed Operation Impact. On 30 March 2015, the House of Commons voted to extend the mission to targets in Syria. No additional forces were announced.In late November 2015, new Prime Minister Justin Trudeau announced the withdrawal of Canada's fighter aircraft from the fight against ISIL, but their surveillance and transport and refuelling aircraft would remain in the area. All airstrikes by the Canadian fighter aircraft ended as of 15 February 2016. As part of the Canadian reorganization of the operation in February 2016, it was announced the number of military trainers would triple to a total of 600 ground personnel. This force was later augmented in mid-May 2016 by three Bell CH-146 Griffon helicopters.On 20 July 2016, it was announced by Defence Minister Harjit Sajjan that Canada was deploying a field hospital in support of United States and French troops in their effort to retake Mosul. The hospital requires 60 personnel, however the Minister said that the number of committed to the overall operation would not climb. The hospital's deployment would be for one year.On 7 January"
    },
    {
        "text": "The 39th annual Toronto International Film Festival, the 39th event in the Toronto International Film Festival series, was held in Canada from 4–14 September 2014. David Dobkin's film The Judge, starring Robert"
    },
    {
        "text": "The BRW Rich 200, 2014 is the 31st annual survey of the wealthiest people resident in Australia, published online by The Australian Financial Review on 26 June 2014.In the 2014 list, the"
    },
    {
        "text": "Euromaidan (; Ukrainian: Євромайдан, romanized: Yevromaidan, lit. 'Euro Square', IPA: [jeu̯romɐjˈdɑn]), or the Maidan Uprising, was a wave of demonstrations and civil unrest in Ukraine, which began on 21 November 2013 with large protests in Maidan Nezalezhnosti (Independence Square) in Kyiv. The protests were sparked by President Viktor Yanukovych's sudden decision not to sign the European Union–Ukraine Association Agreement, instead choosing closer ties to"
    },
    {
        "text": "A rescue occurred at Riesending cave between 8–19 June 2014, in Bavaria, Germany, after a speleologist, who had been exploring the cave in a group of three, suffered a traumatic brain injury as a result of a rockfall. It became one of the largest cave rescues in history, involving more than 700 people for 11 days and an estimated cost of close to €1"
    },
    {
        "text": "The Newark by-election was a by-election in the Newark constituency of the British House of Commons, which was held on 5 June 2014, following the resignation of Patrick Mercer. Conservative Robert Jenrick"
    },
    {
        "text": "The Normandy Format (French: Format Normandie), also known as the Normandy contact group, is a grouping of states who met in an effort to resolve the war in Donbas and the wider"
    },
    {
        "text": "2014 Kalbajar incident refers to the crossing of a small group of Azerbaijanis into Kalbajar district, their subsequent capture and conviction for murder and sabotage by the Republic of Artsakh. In July 2014, three ethnic Azerbaijanis crossed Nagorno-Karabakh Line of Contact in to Kalbajar District, then controlled by breakaway Republic of Artsakh forces. This was followed by disappearance of 17-year-old local Smbat Tsakanyan who was later found dead from gunshot wounds and who was last seen walking with the Azerbaijanis in a video used as evidence in the trial. The Azerbaijanis were detained for \"reconnaissance operations in the area on orders from Azerbaijan’s intelligence service,\" as well as kidnapping and killing of Tsakanyan. One of the Azerbaijanis named Hasanov attacked Major Sargis Abrahamyan and his companion Karine Davtyan"
    },
    {
        "text": "The Estación Polar Científica Conjunta Glaciar Unión (or Union Glacier Joint Scientific Polar Station) or Union Glacier Station is a summer Antarctic base of Chile, situated on Union Glacier in the Ellsworth Mountains. It is jointly operated from November to January by the Chilean Antarctic Institute and the three armed forces of Chile. It was inaugurated on 4 January 2014 by Chilean President Sebastián Piñera Echeñique.In 2013, the Antarctic stations Teniente Arturo Parodi Alister and Antonio Huneeus were dismantled and their equipment was transferred to Union Glacier Station. This followed the relocation in November 2010 of the operations of the private American company Antarctic Logistics & Expeditions LLC, which has operated the landing strip on Union Glacier since December 2008 and also runs Union Glacier Camp.After the American"
    },
    {
        "text": "Fantastica Mania 2014 was a series of five professional wrestling events co-produced by Japanese promotion New Japan Pro-Wrestling (NJPW) and Mexican promotion Consejo Mundial de Lucha Libre (CMLL) taking place between January 15 and 19, 2014. 2014 was the fourth year in which NJPW and CMLL come together to produce Fantastica Mania events, but the first time they held five events in one year,"
    },
    {
        "text": "Cyclone Tini (also referred to as Storm Darwin in Ireland) a European windstorm that Western Europe, particularly Ireland and the United Kingdom on 12 February 2014. The storm brought hurricane-force winds to Ireland the with the Met Office and Met Éireann describing the storm as one of the most significant to affect Ireland, Wales and West England in recent decades. Tini was one of"
    },
    {
        "text": "The 2014 Tokyo Marathon (Japanese: 東京マラソン 2014) was the eighth edition of the annual marathon race in Tokyo, Japan and was held on Sunday, 23 February. An IAAF Gold Label Road Race, it was the first World Marathon Majors event to be held that year and represented the second occasion that the Tokyo race was part of the elite-level marathon series. Both elite race"
    },
    {
        "text": "The following addresses the events in Northern Afghanistan between April 2009 and 2014. While this part of the country had long been relatively peaceful compared to the all-out war zones of the"
    },
    {
        "text": "The South Yorkshire Police and Crime Commissioner by-election was a 2014 by-election on 30 October 2014 for the position of Police and Crime Commissioner in the South Yorkshire Police region of the United Kingdom. It was triggered by the resignation of Shaun Wright, the inaugural South Yorkshire Police and Crime Commissioner, who stepped down from the position on 16 September 2014 following the Rotherham"
    },
    {
        "text": "The 2014 Moscow Victory Day Parade took place in Red Square on 9 May 2014 to commemorate the 69th anniversary of the capitulation of Nazi Germany in 1945, which formally ended hostilities"
    },
    {
        "text": "The 2014–15 North American winter was frigid and prolifically wintry, especially across the eastern half of North America in the months of January–March. The season began early, with many places in North"
    },
    {
        "text": "MS Norman Atlantic was a roll-on/roll-off passenger (ROPAX) ferry owned by the Italian ferry company Visemar di Navigazione. The ferry was chartered by ANEK Lines from December 2014. On 28 December 2014,"
    },
    {
        "text": "The concept of Targeted Poverty Alleviation (simplified Chinese: 精准扶贫; traditional Chinese:精準扶貧, pinyin: jīng zhǔn fú pín) was first raised by Xi Jinping, General Secretary of the Chinese Communist Party to combat poverty in China. Targeted poverty alleviation plays into China's poverty alleviation strategy, and is to contribute to the Party's century goal of “comprehensively building a “moderately prosperous society” that is the first objective of Xi Jinping’s agenda of the Four Comprehensives. In his speeches, Xi Jinping emphasizes that without solving the poverty problem in rural areas, China cannot become a moderately prosperous society.The Targeted Poverty Alleviation Strategy was officially adopted by the Chinese government in 2014. Chinese premier, Li Keqiang, said in his government report in March 2014, “local governments need to merge poverty alleviation resources….and take"
    },
    {
        "text": "On the morning of 18 September 2014, police in Australia carried out the biggest counter-terrorism operation in the nation's history, with over 800 heavily armed officers targeting households in the cities of"
    },
    {
        "text": "The 2014 Split district elections were held on 9 June 2014 for the councils of 34 city districts and local committees of Split. The Croatian Democratic Union coalition won 98 council seats,"
    },
    {
        "text": "The Schellenberg smuggling incident is a case in which Canadian citizen Robert Lloyd Schellenberg was arrested, tried, and convicted on charges of smuggling drugs in the People's Republic of China. According to the prosecutors for the state, Schellenberg attempted to smuggle methamphetamine with a net weight of just over 222 kg (489 lb) from Dalian to Australia in November 2014, and after discovering that his translator had informed the police, he boarded a plane at Dalian Zhoushuizi International Airport with the intention of fleeing to Thailand. Schellenberg was arrested by Chinese police when the plane had a stopover at Guangzhou Baiyun International Airport. Schellenberg argued that he was framed by drug dealer Xu Qing and that he was an innocent tourist. On November 20, 2018, the Dalian Intermediate"
    },
    {
        "text": "Oslo is a discothèque, bar and food venue located in Hackney Central, East London. It is the first club to open in that area of Hackney. Notable musicians that played in it since 2014 opening are Marina and the Diamonds, Klaxons, Sky Ferreira and others. Oslo Hackney, the club's bookings are run by Conrad Rogan. DJs that have played in the venue include AJ"
    },
    {
        "text": "The war on terror, officially the Global War on Terrorism (GWOT), is a global counterterrorism military campaign initiated by the United States following the September 11 attacks and is also the most recent global conflict spanning multiple wars. The main targets of the campaign were militant Islamist and Salafi jihadist armed organisations such as Al-Qaeda, the Islamic State, and their international affiliates, which were"
    },
    {
        "text": "Ryōgoku Peter Pan 2014: Maybe Summer Will Change My Life! (両国ピーターパン2014〜人生変えちゃう夏かもね!〜, Ryōgoku Pītā Pan 2014: jinsei kaechau natsu kamo ne) was a professional wrestling event promoted by DDT Pro-Wrestling (DDT). The event"
    },
    {
        "text": "Cyclone Tini (also referred to as Storm Darwin in Ireland) a European windstorm that Western Europe, particularly Ireland and the United Kingdom on 12 February 2014. The storm brought hurricane-force winds to"
    },
    {
        "text": "Forum for India-Pacific Islands cooperation (FIPIC) is a multinational grouping developed in 2014 for cooperation between India and 14 Pacific Islands nations which include Cook Islands, Fiji, Kiribati, Marshall Islands, Micronesia, Nauru,"
    },
    {
        "text": "Water supply problems in Caleta Olivia occurred on 2014 (called the Thirst Days) and culminated in a series of protests about the lack of water produced by the rupture of the aqueduct"
    },
    {
        "text": "The 6th BRICS summit was the sixth annual diplomatic meeting of the BRICS, a grouping of major emerging economies that includes Brazil, Russia, India, China and South Africa. It was hosted by"
    },
    {
        "text": "MS Norman Atlantic was a roll-on/roll-off passenger (ROPAX) ferry owned by the Italian ferry company Visemar di Navigazione. The ferry was chartered by ANEK Lines from December 2014. On 28 December 2014, she caught fire in the Strait of Otranto, in the Adriatic Sea. At the time of the fire there were an estimated 475 people on board the ship including 417 passengers, 55"
    },
    {
        "text": "The 2014 FIBA World Championship for Women, the 17th edition of FIBA's premier international tournament for women's national basketball teams, was held in Ankara and Istanbul, Turkey from 27 September to 5 October 2014.This tournament implemented the new expanded free throw lane, the restricted arc, and extended 3-point line (6.6–6.75 m). The United States defended their title and won their ninth overall gold medal"
    },
    {
        "text": "2014–2016 Croatian war veterans tent protest was 555 days long war veterans protest, often dubbed in Croatia as The Tenters (Croatian: šatoraši). The protests were initially aimed against Ministry of Croatian Veterans deputy Bojan Glavašević and Minister Predrag Matić himself, however the protesters subsequently changed their demands and started demanding the resignation of left-wing Prime Minister Zoran Milanović and then President Ivo Josipović. The"
    },
    {
        "text": "Operation Car Wash (Portuguese: Operação Lava Jato) was a criminal investigation by the Federal Police of Brazil's Curitiba branch. It began in March 2014 and was initially headed by investigative judge Sérgio Moro, and in 2019 by Judge Luiz Antônio Bonat. It has resulted in more than a thousand warrants of various types. According to the Operation Car Wash task force, investigations implicate administrative"
    },
    {
        "text": "From mid-2014 onward, Brazil experienced a severe economic crisis. The country's Gross Domestic Product (GDP) fell by 3.5% in 2015 and 3.3% in 2016, after which a small economic recovery began. That recovery continued until 2020, when the COVID-19 pandemic began to impact the economy again. The economic crisis occurred alongside a political crisis that resulted in the impeachment of president Dilma Rousseff. These"
    },
    {
        "text": "Gutter oil, trench oil, sewer oil and tainted oil (Chinese: 地沟油 / 地溝油; pinyin: dìgōu yóu, or 餿水油; sōushuǐ yóu) are Chinese slang terms primarily used in China and Taiwan to refer"
    },
    {
        "text": "The 2014 Kremlin Cup was a tennis tournament played on indoor hard courts. It was the 25th edition of the Kremlin Cup for the men (19th edition for the women) and part of the ATP World Tour 250 Series of the 2014 ATP World Tour, and of the Premier Series of the 2014 WTA Tour. It was held at the Olympic Stadium in Moscow,"
    },
    {
        "text": "Euromaidan (; Ukrainian: Євромайдан, romanized: Yevromaidan, lit. 'Euro Square', IPA: [jeu̯romɐjˈdɑn]), or the Maidan Uprising, was a wave of demonstrations and civil unrest in Ukraine, which began on 21 November 2013 with"
    },
    {
        "text": "The GSK China scandal was an imbroglio where the China branch of the global drugmaker GlaxoSmithKline (GSK) pleaded guilty to paying bribes to doctors and hospitals to promote the company's products in"
    },
    {
        "text": "The 2014 European Aquatics Championships took place from 13 to 24 August 2014 in Berlin, Germany. It was the 31st edition of the championships, and was held in a temporary facility placed in the centre of the Berlin Velodrome. Great Britain headed the medal table on gold medals and total medals, by some distance their best ever performance at the championships. In addition, two"
    },
    {
        "text": "The 2014 Sundarbans oil spill was an oil spill that occurred on 9 December 2014 at the Shela River in Sundarbans, Bangladesh, a UNESCO World Heritage Site. The spill occurred when an oil-tanker named Southern Star VII, carrying 350,000 litres (77,000 imp gal; 92,000 US gal) of furnace oil, was in collision with a cargo vessel and sank in the river. By 17 December, the oil had spread over a 350 km2 (140 sq mi) area. The oil spread to a second river and a network of canals in Sundarbans, which blackened the shoreline. The spill threatened trees, plankton, and vast populations of small fish and dolphins. The spill occurred at a protected mangrove area, home to rare Irrawaddy and Ganges river dolphins. By 12 January 2015, 70,000"
    },
    {
        "text": "The Battle of Shuja'iyya occurred between the Israel Defense Forces and the Izz ad-Din al-Qassam Brigades on 20 July 2014 during 2014 Israel–Gaza conflict in the Shuja'iyya neighborhood of Gaza City, in"
    },
    {
        "text": "Lars Joachim Mittank (born February 9, 1986) is a German man who disappeared on July 8, 2014, near Varna Airport in Varna, Bulgaria. Mittank was vacationing at the Golden Sands resort, where he was supposedly involved in a fight, and was subsequently unable to fly home with his friends for health reasons. Mittank was documented acting strangely while alone in Bulgaria. He called home"
    },
    {
        "text": "The 4th Magritte Awards ceremony, presented by the Académie André Delvaux, honored the best films of 2013 in Belgium and took place on 1 February 2014, at the Square in the historic site of Mont des Arts, Brussels beginning at 8:00 p.m. CET. During the ceremony, the Académie André Delvaux presented Magritte Awards in 21 categories. The ceremony was televised in Belgium by BeTV. Actress Émilie Dequenne presided the ceremony, while actor Fabrizio Rongione hosted the show for the second time.The nominees for the 4th Magritte Awards were announced on 9 January 2014. Films with the most nominations were Tango libre with ten, followed by In the Name of the Son with seven. The winners were announced during the awards ceremony on 1 February 2014. Ernest & Celestine"
    },
    {
        "text": "The 2014 Toronto Mayoral Election took place on October 27, 2014. Incumbent Mayor Rob Ford initially ran for re-election, but dropped out after being diagnosed with a tumour - instead running for"
    },
    {
        "text": "Wrestle Kingdom 8 in Tokyo Dome was a professional wrestling pay-per-view (PPV) event produced by the New Japan Pro-Wrestling (NJPW) promotion, which took place at the Tokyo Dome in Tokyo, Japan on January 4, 2014. It was the 23rd January 4 Tokyo Dome Show and the eighth held under the \"Wrestle Kingdom\" name. Like the previous year, the event aired worldwide on internet pay-per-view"
    },
    {
        "text": "Armenia participated in the Junior Eurovision Song Contest 2014 which took place on 15 November 2014, in Marsa, Malta. The Armenian broadcaster Armenia 1 (ARMTV) was responsible for organising their entry for the contest. The Armenian entry was selected through a national final held on 14 September 2014. Betty and her song \"People of the Sun\" was chosen to represent the nation in Marsa,"
    },
    {
        "text": "The 2014 Tokyo gubernatorial election took place on February 9, 2014 to replace outgoing Governor Naoki Inose, who resigned effective December 24, 2013. Yōichi Masuzoe was declared the winner in exit polling, with a substantial lead over the fifteen other candidates. His final tally was 2,112,979 votes (42.86%), with his two closest competitors Morihiro Hosokawa and Kenji Utsunomiya failing to break the 20% mark."
    },
    {
        "text": "The second inauguration of Juan Manuel Santos as the 32rd President of Colombia marked the beginning of his second term in the house of Nariño as head of state for Juan Manuel"
    },
    {
        "text": "Air Algérie Flight 5017 was a scheduled international passenger flight from Ouagadougou, Burkina Faso, to Algiers, Algeria, which crashed near Gossi, Mali, on 24 July 2014. The McDonnell Douglas MD-83 twinjet with"
    },
    {
        "text": "Chang'e 5-T1 (Chinese: 嫦娥五号T1; pinyin: Cháng'é wǔhào T1) was an experimental robotic spacecraft that was launched to the Moon on 23 October 2014, by the China National Space Administration (CNSA) to conduct atmospheric re-entry tests on the capsule design planned to be used in the Chang'e 5 mission. As part of the Chinese Lunar Exploration Program, Chang'e 5, launched in 2020, was a Moon sample return mission. Like its predecessors, the spacecraft is named after the Chinese Moon goddess Chang'e. The craft consisted of a return vehicle capsule and a service module orbiter.The return capsule of Chang'e 5-T1, named Xiaofei (Chinese: 小飞), meaning \"little flyer\" in Chinese, landed in Siziwang Banner, Inner Mongolia, on 31 October 2014, 22:42 UTC. The CE-5-T1 Service Module entered lunar orbit on 13"
    },
    {
        "text": "The 2014 DFB-Pokal Final decided the winner of the 2013–14 DFB-Pokal, the 71st season of Germany's premier football cup. It was played on 17 May at the Olympiastadion in Berlin. In the final, Borussia Dortmund played Bayern Munich. The winners would have earned a place in the group stage of the 2014–15 UEFA Europa League, but both teams had already qualified for the 2014–15 UEFA Champions League via their league positions. Because of this, the three Europa League spots were passed down through league positions. This was the last season in which the cup runners-up would have qualified for the Europa League if the winners had already qualified for the Champions League. The winners also earned the right to play in the 2014 DFL-Supercup; as Bayern had already"
    },
    {
        "text": "2014 Kalbajar incident refers to the crossing of a small group of Azerbaijanis into Kalbajar district, their subsequent capture and conviction for murder and sabotage by the Republic of Artsakh. In July 2014, three ethnic Azerbaijanis crossed Nagorno-Karabakh Line of Contact in to Kalbajar District, then controlled by breakaway Republic of Artsakh forces. This was followed by disappearance of 17-year-old local Smbat Tsakanyan who"
    },
    {
        "text": "The 2014 Toronto Blue Jays season was the 38th season for the franchise, and the 25th full season of play (26th overall) at Rogers Centre. Pitcher Roy Halladay signed a one-day contract"
    },
    {
        "text": "Double salary saga is the name given by media outlets to a political scandal in Ghana. Between 2012 and 2016, some members of the John Dramani Mahama administration who were ministers or"
    },
    {
        "text": "The 2015 World Junior Ice Hockey Championships was the 39th edition of Ice Hockey World Junior Championship, played from December 26, 2014 to January 5, 2015. It was co-hosted by Toronto, Ontario, and Montreal, Quebec, Canada, and organized by Hockey Canada, Hockey Quebec, the Ontario Hockey Federation, the Montreal Canadiens, Maple Leafs Sports and Entertainment and Evenko. Games were split between Air Canada Centre"
    },
    {
        "text": "The Abkhazian Revolution took place in 2014, when President Aleksandr Ankvab resigned after hundreds of demonstrators stormed his office. After mass protests in the capital Sukhumi and the occupation of his office on 27 May, Ankvab fled to his hometown of Gudauta and ultimately resigned on 1 June, after previously denouncing the demonstration as an attempted coup d'état.The uprising was attributed to public anger with Ankvab over his perceived liberal policy toward ethnic Georgians in Abkhazia, a breakaway republic with limited recognition. Although Abkhazia seceded from Georgia in 1992, the Ankvab administration allowed ethnic Georgians to register as voters and receive Abkhazian passports.The revolution led to an early presidential election being called in August 2014. Opposition leader Raul Khajimba was elected president with a narrow majority of the"
    },
    {
        "text": "The 2014 Helsinki University massacre plan was a mass murder planned by two people in Helsinki, Finland. The plan was discovered in spring 2014. The attack never happened, because a third person"
    },
    {
        "text": "The 2013–2014 Thai political crisis was a period of political instability in Thailand. Anti-government protests took place between November 2013 and May 2014, organised by the People's Democratic Reform Committee (PDRC), a political pressure group led by former Democrat Party parliamentary representative (MP) Suthep Thaugsuban. The crisis eventually resulted in the removal of incumbent Prime Minister Yingluck Shinawatra, a coup d'état, and the establishment of a military junta. The primary aim of the protests was the removal of former prime minister Thaksin Shinawatra's – the brother of Yingluck – influence on Thai politics and the creation of an unelected \"people's council\" to oversee reforms of the political system. Protesters viewed Thaksin as corrupt and damaging to Thailand's democracy, although he enjoyed strong support in many areas of Thailand, particularly the poorer north and northeast, due to his reforming social programs and economic policies. Political parties allied to Thaksin had won a majority in every election since 2001. Other issues, such as the royal succession, a rural-urban or north-south divide, social inequality, over-centralised bureaucracy, royal and military influence in politics, and class conflict were suggested as factors behind the crisis by analysts and commentators. Protests were first triggered by a proposed amnesty bill which would have pardoned politicians of various charges from the period following the 2006 coup d'état. Anti-government protestors argued the bill, and a simultaneous government attempt to alter the 2007 constitution, favoured Thaksin and would potentially allow him to return from self-imposed exile due to a corruption conviction. The pro-government Red Shirt movement also"
    },
    {
        "text": "Many states and international organisations have reacted to the ongoing Russo-Ukrainian War in the Donbas region of Ukraine, which began in April 2014. In August 2014 when the intervention of Russian troops"
    },
    {
        "text": "The 2014 Balkans Cup was a rugby league football tournament that was held in Serbia between 17 October and 19 October. The winner won the inaugural Balkans Cup Trophy.Four teams competed in the 2014 event. These teams were: Serbia, Greece, Hungary and Bosnia.After winning the European Championship C a week before the tournament began, Greece transferred their form to the tournament and were crowned"
    },
    {
        "text": "On 11 February 2014, a C-130 Hercules military transport aircraft of the Algerian Air Force, carrying 74 passengers and 4 crew members, crashed into Djebel Fertas mountain near Aïn Kercha, Algeria. Only"
    },
    {
        "text": "The 23rd Actors and Actresses Union Awards ceremony was held on 10 March 2014 at the Teatro Coliseum in Madrid. The gala was hosted by Llum Barrera and Secun de la Rosa.In"
    },
    {
        "text": "Azerbaijan participated in the Eurovision Song Contest 2014 with the song \"Start a Fire\" written by Stefan Örn, Johan Kronlund and Alessandra Günthardt. The song was performed by Dilara Kazimova. The Azerbaijani"
    },
    {
        "text": "Miss International 2014, the 54th Miss International pageant, organized by the International Cultural Association held on November 11, 2014 at the Grand Prince Hotel Takanawa in Tokyo, Japan. Bea Santiago of the Philippines crowned her successor Valerie Hernández of Puerto Rico at the end of the event. Miss International beauty pageant is aimed at promoting \"Love Peace and Excitement to the World\". The contestants"
    },
    {
        "text": "Bulgaria selected their Junior Eurovision Song Contest 2014 entry through an internal selection. On 26 July 2014 the Bulgarian broadcaster BNT stated that they will return to the contest with Krisia Todorova."
    },
    {
        "text": "On 5 May 2014, a yacht and a dinghy, both overcrowded and carrying migrants destined for Greece, capsized about four nautical miles off the coast of the Greek island of Samos, in"
    },
    {
        "text": "The Practice of the 'One Country, Two Systems' Policy in the Hong Kong Special Administrative Region (Chinese: 「一國兩制」在香港特別行政區的實踐) is a white paper issued by the Information Office of the State Council of the People's Republic of China (PRC) on the practice of the \"one country, two systems\" policy in the Hong Kong Special Administrative Region (HKSAR) on 10 June 2014 in the midst of"
    },
    {
        "text": "On 18 May 2014, a bus carrying 49 passengers caught on fire in Fundación, Colombia. According to different sources, 32 children, 33 children or 31 children and one adult died as a"
    },
    {
        "text": "2014 Commonwealth of Independent States Cup was the 22nd annual Commonwealth of Independent States Cup since its establishment in 1993. It was hosted in Saint Petersburg, Russia between 24 January and 2"
    },
    {
        "text": "The Ettehadiya case is a controversial legal case in Egypt where thousands of protesters went down to the Ittihadiya Palace, the Presidential offices in Cairo, asking for the repeal of the newly"
    },
    {
        "text": "ARSAT-1 is a geostationary communications satellite operated by AR-SAT and built by the Argentine company INVAP. ARSAT-1 was launched into orbit on October 16, 2014, from French Guiana alongside Intelsat-30 satellite using an Ariane 5 rocket. It is expected to be located at 72° West longitude geostationary slot. ARSAT-1 is the first geostationary satellite built in Latin America. Total cost of the satellite is"
    },
    {
        "text": "The Minsk agreements were a series of international agreements which sought to end the Donbas war fought between armed Russian separatist groups and Armed Forces of Ukraine, with Russian regular forces playing a central part. The first, known as the Minsk Protocol, was drafted in 2014 by the Trilateral Contact Group on Ukraine, consisting of Ukraine, Russia, and the Organization for Security and Co-operation in Europe (OSCE), with mediation by the leaders of France and Germany in the so-called Normandy Format. After extensive talks in Minsk, Belarus, the agreement was signed on 5 September 2014 by representatives of the Trilateral Contact Group and, without recognition of their status, by the then-leaders of the self-proclaimed Donetsk People's Republic (DPR) and Luhansk People's Republic (LPR). This agreement followed multiple previous"
    },
    {
        "text": "Lights Out was an event on 4 August 2014 in the United Kingdom to commemorate the centenary of the start of World War I. It was inspired by the words of Sir"
    },
    {
        "text": "The second inauguration of Juan Manuel Santos as the 32rd President of Colombia marked the beginning of his second term in the house of Nariño as head of state for Juan Manuel Santos, being the fifth president of Colombia to be re-elected and the second in a row, for this time his vice-presidential formula fell to the former interior minister and former finance minister"
    },
    {
        "text": "In October 2013, there was an outbreak of Zika fever in French Polynesia, the first outbreak of several Zika outbreaks across Oceania. With 8,723 cases reported, it was the largest outbreak of Zika fever before the outbreak in the Americas that began in April 2015. An earlier outbreak occurred on Yap Island in the Federated States of Micronesia in 2007, but it is thought"
    },
    {
        "text": "Arturo (1985 – July 3, 2016) was a polar bear living in Mendoza Zoological Park in Mendoza, Argentina, the only polar bear living in the country. He was born in the United"
    },
    {
        "text": "The United States–Africa Leaders Summit 2014 was an international summit held in Washington D.C. from August 4–6, 2014. Leaders from fifty African states attended the three-day summit, which was hosted by U.S. President Barack Obama. The summit primarily focused on trade, investment and security of the continent. Leaders from 50 of the 54 existing African sovereign nations were invited to attend. After the summit,"
    },
    {
        "text": "An internal conflict in the Central African Republic (CAR) started essentially on 13 April 2013, when the government of President Michel Djotodia officially took over. The fighting was between the government of the Central African Republic's former Séléka coalition of rebel groups, who are mainly from the Muslim minority, and the mainly Christian anti-balaka coalition. The conflict was part of the ongoing Central African Republic Civil War (2012–present). International organisations, such as the United Nations, had warned of a possible genocide. UNSC resolution 2122 authorised the African-led International Support Mission to the Central African Republic (MISCA) to be deployed to the country, and France to lead operations with additional troops sent to bolster its force in the country. Following a summit of Economic Community of Central African States"
    },
    {
        "text": "Marius (6 February 2012 – 9 February 2014) was a male giraffe living at Copenhagen Zoo. Though healthy, he was genetically unsuitable for future captive breeding, as his genes were over-represented in"
    },
    {
        "text": "S.A.S. v. France was a case brought for the European Court of Human Rights which ruled that the French ban on face covering did not violate European Convention on Human Rights's (ECHR) provisions on right to privacy or freedom of religion, nor other invoked provisions. On these two points, the Court held her decision by fifteen votes to two. The two judges in the minority expressed their partly dissenting opinion. The French ban against face covering, loi n° 2010-1192 du 11 octobre 2010 interdisant la dissimulation du visage dans l'espace public, was adopted on 11 October 2010 and went into effect on 11 April 2011. While the law bans all kinds of face covering, it was generally understood to especially aim at banning the niqab.On the same day"
    },
    {
        "text": "In July 2014, an internationally publicised incident occurred in which a Thai woman, Pattaramon Janbua, who had been hired as a surrogate mother for an Australian couple, sought to raise money for"
    },
    {
        "text": "General elections were held in the Cook Islands on 9 July 2014, determining the membership of the 14th Cook Islands Parliament. The Cook Islands Party (CIP) initially appeared to have retained its"
    },
    {
        "text": "The 2014 Burkina Faso uprising was a series of demonstrations and riots in Burkina Faso in October 2014 that quickly spread to multiple cities. They began in response to attempts at changing the constitution to allow President Blaise Compaoré to run again and extend his 27 years in office. Pressure for political change came from civil society and in particular from the country's youth. Following a tumultuous day on 30 October, which included the involvement of former Defence Minister Kouamé Lougué and the burning of the National Assembly and other government buildings as well as the ruling Congress for Democracy and Progress party's headquarters, Compaoré dissolved the government and declared a state of emergency before eventually fleeing to Côte d'Ivoire with the support of President Alassane Ouattara. General Honoré Nabéré Traoré announced that a transitional government would run the country until an election within 12 months. After another day of mass protests and initially refusing to resign, after mounting domestic pressure Compaoré resigned from his 27-year presidency on 31 October and Traoré took over as the interim head of state. However, Lieutenant Colonel Yacouba Isaac Zida also staked a claim to be interim head of state citing Traoré's unpopularity. A statement by military chiefs asserted that Zida had their unanimous backing. A coalition of unnamed opposition parties rejected the military takeover. Further protests were called for the morning of 2 November, but were smaller yet there was at least one casualty amidst a police response. The African Union gave the country a fortnight to end military"
    },
    {
        "text": "The Flanders Fields Memorial Garden is a monument dedicated to the participants of World War I situated alongside the Guards Chapel at Wellington Barracks in Central London, England. The garden was opened by Queen Elizabeth II of the United Kingdom and King Philippe of the Belgians on 6 November 2014. Prince Philip, Duke of Edinburgh and Prince William, Duke of Cambridge were also in"
    },
    {
        "text": "Japanese whaling, in terms of active hunting of whales, is estimated by the Japan Whaling Association to have begun around the 12th century. However, Japanese whaling on an industrial scale began around the 1890s when Japan started to participate in the modern whaling industry, at that time an industry in which many countries participated. Japan resumed commercial whaling in July 2019, and since then"
    },
    {
        "text": "ARSAT-1 is a geostationary communications satellite operated by AR-SAT and built by the Argentine company INVAP. ARSAT-1 was launched into orbit on October 16, 2014, from French Guiana alongside Intelsat-30 satellite using"
    },
    {
        "text": "Malaysia Airlines Flight 17 (MH17/MAS17) was a scheduled passenger flight from Amsterdam to Kuala Lumpur that was shot down by Russian-controlled forces on 17 July 2014, while flying over eastern Ukraine. All 283 passengers and 15 crew were killed. Contact with the aircraft, a Boeing 777-200ER, was lost when it was about 50 km (31 mi) from the Ukraine–Russia border, and wreckage from the"
    },
    {
        "text": "On August 12, 2014 a magnitude 5.1 earthquake struck Ecuador 22 km (14 mi) west-southwest of Cayambe at a depth of 11.9 km (7.4 mi). The earthquake shook Ecuador's capital Quito 32"
    },
    {
        "text": "The Indian consulate in Herat, Afghanistan was attacked on 23 May 2014 by four heavily armed militants, three days before the inaugural ceremony of Narendra Modi as the Prime Minister of India."
    },
    {
        "text": "The Minsk agreements were a series of international agreements which sought to end the Donbas war fought between armed Russian separatist groups and Armed Forces of Ukraine, with Russian regular forces playing a central part. The first, known as the Minsk Protocol, was drafted in 2014 by the Trilateral Contact Group on Ukraine, consisting of Ukraine, Russia, and the Organization for Security and Co-operation in Europe (OSCE), with mediation by the leaders of France and Germany in the so-called Normandy Format. After extensive talks in Minsk, Belarus, the agreement was signed on 5 September 2014 by representatives of the Trilateral Contact Group and, without recognition of their status, by the then-leaders of the self-proclaimed Donetsk People's Republic (DPR) and Luhansk People's Republic (LPR). This agreement followed multiple previous attempts to stop the fighting in the region and aimed to implement an immediate ceasefire. The agreement failed to stop fighting, and was thus followed with a revised and updated agreement, Minsk II, which was signed on 12 February 2015. This agreement consisted of a package of measures, including a ceasefire, withdrawal of heavy weapons from the front line, release of prisoners of war, constitutional reform in Ukraine granting self-government to certain areas of Donbas and restoring control of the state border to the Ukrainian government. While fighting subsided following the agreement's signing, it never ended completely, and the agreement's provisions were never fully implemented. The Minsk II was suggested by former German Foreign Minister Frank-Walter Steinmeier as a mechanism of granting a special status to Donbass, and"
    },
    {
        "text": "The Cemfjord was a Cyprus-registered cargo ship which foundered in the Pentland Firth off the north-east coast of Scotland on 2 January 2015. Built as the general cargo ship Margareta in 1984, she was converted to carry cement in 1998 and was en route from Aalborg, Denmark to Runcorn, Cheshire, United Kingdom when she capsized in bad weather and sank in 82 metres (270"
    },
    {
        "text": "The 19th Empire Awards ceremony (officially known as the Jameson Empire Awards), presented by the British film magazine Empire, honored the best films of 2013 and took place on 30 March 2014 at the Grosvenor House Hotel in London, England. During the ceremony, Empire presented Empire Awards in 14 categories as well as five honorary awards. The awards for Best Best Supporting Actor and"
    },
    {
        "text": "The War of 1812 Monument, officially titled Triumph Through Diversity (Triomphe grâce à la diversité in French), is a bronze and stone memorial, located at Parliament Hill in Ottawa, Ontario, Canada, Canada's capital. Seven figures—a First Nations fighter, a Métis militiaman, a regular infantryman from the Royal Newfoundland Regiment of Fencible Infantry, a Quebec soldier of the Canadian Voltigeurs being bandaged by a female"
    },
    {
        "text": "The Ninth East Asia Summit was held in Nay Pyi Taw, Myanmar (Burma) on November 12–14, 2014. The East Asia Summit is an annual meeting of national leaders from the East Asian"
    },
    {
        "text": "Ethiopian Airlines Flight 702 was a scheduled flight from Addis Ababa to Milan via Rome on 17 February 2014. The aircraft, an Ethiopian Airlines Boeing 767-300ER, was hijacked by the unarmed co-pilot,"
    },
    {
        "text": "A referendum on joining the Unified Patent Court was held in Denmark on 25 May 2014 alongside European Parliament elections. The referendum was approved with 62.5% of the vote, enabling the government"
    },
    {
        "text": "The Zhengzhou Airport riot occurred on 5–6 February 2014. Passengers at the airport in Zhengzhou, capital of the Chinese province of Henan, angry over lengthy delays due to snowy weather, smashed computers at airline check-in counters and destroyed information kiosks. It has been estimated that as many as 2,000 people took part over two days before police were able to restore order.Some of the angry passengers had been waiting for as long as five days to catch flights back to their jobs in other cities after their annual trips to see family during the Chinese New Year holiday period. They were further frustrated by the lack of information from airline and airport staff while they waited. The mass incident highlighted the difficulties faced by China's commercial airline industry"
    },
    {
        "text": "Conference of Western Balkan States was a 28 August 2014 conference of heads of states and governments of Western Balkans region initiated by German chancellor Angela Merkel. An idea for organization of conference came in light of the celebration of the 100th anniversary of the beginning of World War I. It is the first conference in this framework and organizers expressed their desire to continue it in future with Vienna and Paris mentioned as a potential next hosts after Berlin (so called Berlin Process). Günther Oettinger confirmed at conference that event will be organised annually with Vienna as a host city in 2015 and Paris in 2016.The German chancellor announced intention to organize a conference on 7 June 2014. Invitation for participation was sent to all the countries of South Eastern Europe including Croatia and Slovenia that were already members of the European Union at the time of conference.The main intention was to show commitment for process of Future enlargement of the European Union, little progress of Bosnia and Herzegovina and Macedonia in that process and relations of Serbia with Russia in the light of International sanctions during the 2014 pro-Russian unrest in Ukraine.During the Foreign Ministers’ segment, Albanian Foreign Minister Bushati underlined the importance of making this initiative periodical, as well as finding the right instruments to enable, in future years, the drafting and implementation of concrete joint projects in the region. In this regard Albanian delegation presented a document under the title \"Albanian Working Paper for the Western Balkans Conference in Berlin\", which is"
    },
    {
        "text": "An internal conflict in the Central African Republic (CAR) started essentially on 13 April 2013, when the government of President Michel Djotodia officially took over. The fighting was between the government of"
    },
    {
        "text": "On 15 May 2014, the double-decker ferry MV Miraj-4 capsized in the Meghna River, 50 kilometres (31 mi) southeast of Dhaka, Bangladesh. Between 150 and 200 people were on board at the"
    },
    {
        "text": "On 15 July 2014, at around 8:40 am MSK (UTC+04:00), an outbound Moscow Metro train derailed between Park Pobedy and Slavyansky Bulvar stations of the Arbatsko-Pokrovskaya Line. Casualties reported include 24 dead and 160 injured. Early reports suggested a power surge or a terrorist attack to be the cause of the derailment, but both were soon dismissed. This accident was the deadliest ever recorded"
    },
    {
        "text": "BugSat 1 (nickname Tita) is an Argentine microsatellite launched on 19 June 2014. The satellite is built in flattened box shape, optimized for piggy-back launch. All instruments are powered by solar cells"
    },
    {
        "text": "A terrorist ramming attack occurred on 4 August 2014, when a man drove an excavator type of tractor out of a construction site, injuring several pedestrians and killing one man before ramming the tractor into a public bus, overturning the bus and then hitting it repeatedly. The terrorist was shot dead at the scene by a police officer while still seated at the wheel"
    },
    {
        "text": "General elections were held in Fiji on 17 September 2014 to select the 50 members of Parliament. The FijiFirst party led by Prime Minister Frank Bainimarama won a landslide victory, winning 32 of the 50 seats. The Social Democratic Liberal Party and the National Federation Party were the only other two parties to cross the 5% electoral threshold and win seats.The elections had originally"
    },
    {
        "text": "The Eurovision Song Contest 2014 was the 59th edition of the Eurovision Song Contest. It took place in Copenhagen, Denmark, following the country's victory at the 2013 contest with the song \"Only Teardrops\" by Emmelie de Forest. Organised by the European Broadcasting Union (EBU) and host broadcaster Danish Broadcasting Corporation (DR), the contest was held at B&W Hallerne, and consisted of two semi-finals on"
    },
    {
        "text": "Talking Statues is a project created initially in 2013 by David Peter Fox in Copenhagen, Denmark involving pre-recorded voiceovers accompanying various statues available in a smartphone app. The statue of Hans Christian"
    },
    {
        "text": "Virunga is a 2014 British documentary film directed by Orlando von Einsiedel. It focuses on the conservation work of park rangers within the Congo's Virunga National Park during the rise of the"
    },
    {
        "text": "Hamas, the governing authority in the Gaza Strip, has constructed a sophisticated network of military tunnels since it seized control of the Strip in 2007. The tunnel system branches beneath many Gazan towns and cities, such as Khan Yunis, Jabalia and the Shati refugee camp. The internal tunnels, running some dozens of kilometres within the Gaza Strip, have several functions. Hamas uses the tunnels"
    },
    {
        "text": "On the morning of 18 September 2014, police in Australia carried out the biggest counter-terrorism operation in the nation's history, with over 800 heavily armed officers targeting households in the cities of Sydney and Brisbane. It came days after the Australian government raised the terror threat from medium to high due to concerns about Australian citizens returning to the country after fighting with the"
    },
    {
        "text": "The 2013–2014 Israeli–Palestinian peace talks were part of the Israeli–Palestinian peace process. Direct negotiations between Israel and the Palestinians began on 29 July 2013 following an attempt by United States Secretary of"
    },
    {
        "text": "The Hotesur scandal took place in Argentina in 2014. Hotesur is a firm that administers the hotels in El Calafate that belong to Cristina Fernández de Kirchner and her family. Initially, it"
    },
    {
        "text": "Presidential elections were held in Afghanistan on 5 April 2014, with a second round held on 14 June. Incumbent President Hamid Karzai was not eligible to run due to term limits. The registration period for presidential nominations was open from 16 September 2013 until 6 October 2013. A total of 27 candidates were confirmed to be running for office. However, on 22 October Afghanistan's Independent Election Commission disqualified 16 of the candidates, leaving only 11 in the race. By April 2014 three candidates gave up the race and decided to support some of the eight remaining candidates. Opinion polls showed Abdullah Abdullah and Ashraf Ghani as the front-runners and indeed the results of the first round of the election had Abdullah in the lead and Ghani behind him."
    },
    {
        "text": "Malaysia Airlines Flight 17 (MH17/MAS17) was a scheduled passenger flight from Amsterdam to Kuala Lumpur that was shot down by Russian-controlled forces on 17 July 2014, while flying over eastern Ukraine. All 283 passengers and 15 crew were killed. Contact with the aircraft, a Boeing 777-200ER, was lost when it was about 50 km (31 mi) from the Ukraine–Russia border, and wreckage from the aircraft fell near Hrabove in Donetsk Oblast, Ukraine, 40 km (25 mi) from the border. The shoot-down occurred during the war in Donbas over territory controlled by Russian separatist forces.The responsibility for investigation was delegated to the Dutch Safety Board (DSB) and the Dutch-led joint investigation team (JIT), who in 2016 reported that the airliner had been downed by a Buk surface-to-air missile launched"
    },
    {
        "text": "Lights Out was an event on 4 August 2014 in the United Kingdom to commemorate the centenary of the start of World War I. It was inspired by the words of Sir Edward Grey, foreign secretary: \"The lamps are going out all over Europe; we shall not see them lit again in our lifetime.\"The main event was the voluntary turning off of lights from"
    },
    {
        "text": "A bronze statue of the British singer Amy Winehouse is located in the Stables Market in Camden Town, in north London. Sculpted by Scott Eaton, it was unveiled in 2014, three years"
    },
    {
        "text": "A rescue occurred at Riesending cave between 8–19 June 2014, in Bavaria, Germany, after a speleologist, who had been exploring the cave in a group of three, suffered a traumatic brain injury"
    },
    {
        "text": "Art Buff is a graffiti artwork by Banksy which was created in Folkestone in 2014, Banksy announcing it as \"part of the Folkestone triennial. Kind of\". The work depicts a woman wearing"
    }
]